[
    {
      "id": 1,
      "name": "Mahesh Sharma",
      "description": "Mahesh Chand Shastri, age 44, holds an M.A. and a Ph.D. in astrology. He is an accomplished astrologer, known for his teaching and consultancy in astrology. As the owner of an app company, he is dedicated to leveraging technology to enhance and spread the ancient knowledge of astrology. He can be reached at mobile numbers 941311077 and 7665888021. Mahesh's journey into astrology is deeply personal and marked by significant challenges and perseverance. ,,As a child, Mahesh faced tremendous difficulties following the untimely deaths of his parents. This tragedy forced him to confront life's hardships early on. Despite the ridicule and mockery from those around him, he was determined to honor his late father's dream of becoming an astrologer. Holding onto his father's vision, Mahesh pursued his studies with unwavering dedication, eventually earning an M.A. and a Ph.D. in astrology ,,Throughout his educational journey, Mahesh faced skepticism and ridicule from those who doubted the value of his chosen path. However, his resolve never wavered. He immersed himself in learning the principles and doctrines of astrology, which became the foundation of his career. Mahesh's determination culminated in the establishment of a company named Vedic Astrology. Despite his best efforts, the company did not achieve the success he had hoped for, leading him to explore various new ideas in pursuit of success ,,Mahesh's initial attempts at establishing his company were fraught with failure. Each new venture seemed to end in disappointment, but he refused to give up. He believed in the potential of astrology to make a significant impact and continued to innovate. His perseverance finally paid off when he founded another company, aptly named Brahat Jyotish, based on numerological insights. This venture saw more success than his previous attempts, but Mahesh's journey was far from over ,,In 2007, during a particularly challenging time, Mahesh envisioned creating an app that could predict the future. Little did he know that this idea would resonate deeply with his unborn son. At the time, Mahesh did not realize the significance of his vision, but it later became apparent that his son had somehow internalized this dream. Mahesh's struggles continued as he approached several coders to develop his app, but each attempt ended in failure, resulting in significant financial losses. After four unsuccessful attempts and substantial monetary setbacks, Mahesh felt disheartened and considered abandoning his dream ,,Despite these setbacks, Mahesh's deep-seated desire to see his vision come to life remained. He believed that the karmic merits of his past lives might be favoring him, as he had planted the idea of becoming a coder into his son's mind from a very young age. This determination manifested through his seemingly harsh treatment of his son. Mahesh showed his son anger, resentment, and a strict demeanor, all the while planting the seeds of ambition and determination ,,By the time his son reached third grade, Mahesh introduced him to the world of computers. In fifth grade, he began nurturing his son's dream of becoming a software engineer. This goal became a shared vision for both father and son, albeit under challenging circumstances. Despite the perceived lack of affection, Mahesh's son embraced the dream wholeheartedly. He devoted countless hours to studying astrology and learning to code, balancing his schoolwork with his passion for technology ,,Mahesh's son worked tirelessly, day and night, to master both astrology and coding. He also began earning money, showcasing his independence and determination. While Mahesh had nearly given up on his dream, his son continued to persevere. Ultimately, it was his son's relentless effort and dedication that brought the app to life. Mahesh's dream was finally realized, and the app was successfully developed. This achievement filled Mahesh with a profound sense of pride and emotional reflection ,,Despite the years of strictness and apparent resentment, Mahesh's son never complained or sought validation. He attributed his success to his father's guidance and teachings. Mahesh, on the other hand, recognized the invaluable contribution of Ashish, his collaborator, whose support and belief played a crucial role. Without Ashish's father's encouragement, Mahesh's son might not have been able to complete the app's design, structure, and data ,,The completion of the app was a testament to the combined efforts and sacrifices of both Mahesh and his son. It was a significant milestone that underscored the importance of perseverance, guidance, and mutual support. This journey taught Mahesh a profound lesson: that divine providence provides us with opportunities and resources, but it is up to us to utilize them effectively. Often, the people we least expect are the ones who help us achieve our greatest accomplishments ,,Mahesh's story is a compelling narrative of resilience, determination, and the power of belief. It highlights the importance of parental influence, the impact of perseverance, and the transformative power of dreams. Despite the adversities and emotional turmoil, Mahesh and his son succeeded in creating an app that not only fulfilled Mahesh's long-held dream but also set a new standard in the field of astrology. This journey has reinforced Mahesh's belief in the potential of astrology and his commitment to sharing its profound insights with the world ,,",
      "image": "https://astrologer.indianastrology.com/img/astrologer/146/146.jpg"
    },
    {
      "id": 2,
      "name": "Vaidhurya Sharma",
      "description": "Vaidhurya Sharma, a 17-year-old with a completed secondary education, is deeply involved in app development, specializing in AI, backend databases, JavaScript, and Python. Hailing from Bangalore, Odisha, his story is one of perseverance and resilience. From a young age, Vaidhurya faced the stern demeanor, anger, and dissatisfaction of his father. These experiences instilled a deep desire within him to earn his father's respect and happiness. Determined to change his father's perception, Vaidhurya embarked on a journey of self-improvement and skill acquisition. ,,By the third grade, Vaidhurya had already started learning about computers and astrology. His father harbored a dream of him becoming a software engineer and had expressed a strong desire for Vaidhurya to create an app that he had envisioned for years. This dream became Vaidhurya's driving force, and by the fifth grade, he was resolute in his decision to build the app for his father. While other children his age were playing, Vaidhurya shouldered responsibilities and carried a laptop, delving into the intricacies of astrology and technology ,,Despite his dedication, Vaidhurya faced numerous setbacks and failures in his initial attempts to develop the app. However, he did not give up. Believing that divine intervention might help him achieve his goal, Vaidhurya delved into spiritual practices. He performed rituals involving three of the ten Mahavidyas, learning tantra, mantra, and even yantra to aid his efforts. The harsh nature of his father compelled Vaidhurya to use these spiritual practices for financial gain, all while managing his school studies ,,After five years of relentless effort and spiritual practices, Vaidhurya finally began to see progress. His hard work and determination started to pay off, and he received significant support from Ashish, Shrija, his father, and Tikesh. The combined efforts and encouragement of these individuals played a crucial role in his success. Vaidhurya acknowledges Ashish's immense contribution, recognizing him as a true friend who stood by him through thick and thin. Despite the hardships he faced, Ashish's unwavering support and friendship helped Vaidhurya immensely ,,Shrija, who later became a funder and investor in the app, also provided invaluable assistance. Without her support, the app might not have reached its current stage. Shrija's belief in Vaidhurya and her financial investment were instrumental in the app's success. Tikesh, although sometimes lacking in enthusiasm, contributed significantly to the app's development. His involvement, though motivated by self-interest, helped Vaidhurya in completing the app ,,Above all, Vaidhurya credits his father and his guru for his achievements. He regards them as the foundation upon which he stands, acknowledging their influence and guidance. His father's dream and his guru's teachings have been the driving forces behind his journey. Vaidhurya sees Ashish and Shrija as his heart, while Tikesh is considered the sustenance that kept him going ,,Vaidhurya's ultimate goal, much like Ashish's, is to use this app to promote Sanatan Dharma and redefine astrology. He aims to present astrology in a new light, countering the modern-day perception of it as a mere joke. He wants to show the world the true potential and significance of astrology. Vaidhurya's story is a testament to the power of determination, resilience, and the support of friends and mentors. It highlights the importance of never giving up on one's dreams, no matter how challenging the journey may b ,,",
      "image": "https://image.lexica.art/full_jpg/f358f622-4df3-473c-978e-acb9efa128d5"
    },
    {
      "id": 3,
      "name": "Ashish Vyas",
      "description": "Ashish Vyas, a 20-year-old student, is currently in his second semester of pursuing a Bachelor of Computer Applications (BCA). He resides in Noida, Rajasthan, and can be reached at 8058560370. Ashish has developed a strong proficiency in various skills such as designing, data typing, design editing, and JavaScript. His journey into the world of technology and coding has a heartfelt backstory that underscores his dedication and passion. ,,While Ashish was engrossed in his education, focusing on coding, his father sought guidance from his Guruji to help shape Ashish’s career. Recognizing the potential in both Ashish and his own son, Guruji suggested that they could mutually benefit from assisting each other. This was a pivotal moment in Ashish’s life, as Guruji's son not only encouraged him but also thoroughly explained the project that would become a cornerstone of his career ,,With newfound inspiration and a clear vision, Ashish dived into the project, taking charge of the app's design, working on Figma for user interfaces, and coding the application. His skills in data typing and design editing proved invaluable as he meticulously crafted each aspect of the app. This was not a straightforward task; Ashish faced numerous challenges and design issues along the way. However, his determination and dedication saw him through these hurdles, and he consistently contributed his expertise to refine and perfect the app ,,The journey was not without its trials, but Ashish’s perseverance paid off. By the grace of God, he succeeded in completing the app, a feat that filled him with immense pride and a sense of accomplishment. This experience instilled in him a profound sense of purpose and commitment. Ashish took a vow that day, a promise to himself and to the world, that he would work tirelessly to promote Sanatan Dharma and bring a renewed perspective on astrology. He observed how astrology, once revered and respected, had been reduced to a mere joke in contemporary society. Ashish was determined to change this perception and showcase the true potential and transformative power of astrology ,,Ashish's dedication to this cause is unwavering. He envisions a world where astrology is understood and appreciated for its depth and significance. His mission is to educate and enlighten people, demonstrating how astrology can profoundly impact their lives in positive ways. He dreams of bringing a resurgence of respect and interest in astrology, not just within India, but across the globe ,,Throughout his journey, Ashish has relied on his technical skills and his ability to adapt and learn. His work on the app, from its initial design to its final execution, is a testament to his commitment and skill. He utilized his knowledge of JavaScript to bring the app to life, ensuring it was both functional and user-friendly. His attention to detail in design and editing ensured that the app was aesthetically pleasing and intuitive for users ,,Ashish's story is one of inspiration and dedication. It highlights the importance of mentorship and guidance, as well as the power of perseverance and hard work. His father’s faith in him, Guruji’s guidance, and his own relentless efforts culminated in the successful creation of an app that stands as a symbol of his capabilities and aspirations ,,Ashish’s journey is far from over. With his vow to promote Sanatan Dharma and astrology, he continues to work towards his goal, striving to make a meaningful impact. His story serves as a beacon of hope and motivation for others, demonstrating that with determination, support, and a clear vision, one can overcome challenges and achieve great success ,,In conclusion, Ashish Vyas’s journey from a coding student to a successful app developer is a remarkable tale of perseverance, dedication, and a deep-seated commitment to his beliefs. His work and aspirations reflect a blend of technical prowess and cultural dedication, aiming to bring about a positive change in the perception of astrology and promote the rich heritage of Sanatan Dharma to the world ,,",
      "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh8HF3MI20SnVNHN1uVo07V6LjhocPuXowxu0cGItvWxw_n8iNUw0PVKjZYzdMjwbcbyhCv3LX5RNRhHQOqw6jPmp4vH_iszpqqv9lcsHzYwkPS7Zb5Rf9NBCwwpu26XKXEemFaW_NcvYrSYDgrfEhD8Z3Bce5qJk0MX4th9_vZ1sZpoRXSbtcu5_Wq9Tg_/s320/1699611895261.jpg"
    },
    {
      "id": 4,
      "name": "Shrija Sharma",
      "description": "Shrija Sharma, aged 18, is currently in her third year pursuing a BCA degree. As an adept in web design, she serves as a founder and investor in an innovative app project. Hailing from Jaipur, Rajasthan, Shrija's journey into this venture is intertwined with a compelling story of chance encounters and mutual aspirations. ,,The narrative began when Mahesh Pandit Ji's son, Vaidhurya, was attending a coding institute in Jaipur, where Shrija was also studying. Their paths crossed unexpectedly during one of Vaidhurya's routine visits for water. What started as casual meetings eventually led to a deeper conversation about Vaidhurya's ambitious app project. Although Shrija was deeply engrossed in her studies at the time and couldn't contribute directly to the app's development, she offered invaluable guidance on its design. Her insights helped shape the app's aesthetic and functional framework ,,As time passed, Shrija's involvement evolved from a mere advisor to a significant investor and funder of the project. She recognized the app's potential and the dedication of its creators, prompting her to support the venture financially. However, Shrija's connection with Vaidhurya transcended professional boundaries. She sensed that Vaidhurya, driven by his father Mahesh Ji's dreams, sought to inspire and support her career. His encouragement left a lasting impression on her, making him an integral part of her journey ,,Vaidhurya's influence on Shrija was profound, but she also acknowledges the crucial role of Ashish, another key figure in the project. Ashish played a significant part in helping Shrija understand Vaidhurya's vision and ambitions. His support was instrumental in bridging the gap between Shrija's aspirations and the app's development. Both Vaidhurya and Ashish became pivotal figures in Shrija's life, contributing to her growth and success ,,Reflecting on her journey, Shrija sees herself as an icon of success, thanks to the collaborative efforts and unwavering support from Vaidhurya and Ashish. Their dedication and encouragement propelled her forward, transforming her into a key player in the project's success. Shrija's story is a testament to the power of collaboration, mentorship, and the significant impact of supportive relationships in achieving one's dreams. The experiences and bonds formed during this journey have not only contributed to the app's success but have also left an indelible mark on Shrija's life, shaping her into the accomplished individual she is toda ,,",
      "image": "https://pics.craiyon.com/2023-06-04/50f169348eb24ce0919dba8133c08ddc.webp"
    }
    
  ]
  