[
    {
      "id": 1,
      "name": "दी फूल",
      "description" : "संतोष से बड़ा कोई धन नहीं। महलों के दिवास्वप्न न देखें। अपने कर्तव्यों का पालन करें।",
      "image": "1.jpg",

      "positiveEvent": "इसके प्रभाव से आपको नए-नए जोखिम उठाने की प्रेरणा मिलेगी। किसी किसी अप्रत्याशित घटना या खबर की सूचना मिलेगी जो आपकी निर्णय क्षमता एवं रुचियों को प्रभावित करेगी। अपने विवेक के अनुसार ही कार्य करें तो लाभान्वित होंगे। अपने दिल तथा दिमाग को खुला रख, उन्मुक्त बहाव में छोड़ देने से भयों और चिंताओं का निकास होगा। स्वयं के प्रति ईमानदार होकर तथा अपनी आकांक्षा पर भरोसा कर अपने स्वप्नों को मूर्त रूप देने का प्रयास करेंगे तो अच्छा होगा। हर स्थिति में एक अप्रत्याशित व नया आयाम जुड़ेगा।",
      "negativeEvent": "संकोची स्वभाव होने के कारण क्षति होगी अपरिपक्वता तथा विचारहीनता के कारण आवेशपूर्ण हालातों की उत्पत्ति होगी। दिखावे से बचें, अधिक वासना से दूर रहें।"
    },
    {
      "id": 2,
      "name": "दी मैजिशियन",
      "description" : "जो दूसरों के लिए कुआं खोदता है, उसके लिए खाई पहले से ही खुदी रहती है। अपनों के साथ धोखा करके सुखी नहीं रह सकते।",
      "image": "2.jpg",

      "positiveEvent": "स्वयं तथा अपनी योग्यताओं पर भरोसा कर अवसरों का लाभ उठाएंगे तो नए अवसरों की प्राप्ति होगी तथा सफलता हासिल होगी। दूसरों पर विश्वास सोच-समझकर करें तो अच्छा होगा। अपनी सृजनशीलता, उत्साह तथा ऊर्जा के कारण आप लोगों से अपना काम करवा पाएंगे तथा मनचाही इच्छाओं को साकार रूप दे पाने में सक्षम हो पाएंगे। अपनी प्रतिभा का पूर्ण उपयोग कर जागरूकता के साथ कार्य करेंगे तो आपकी सभी योजनाएं पूर्ण होंगी। अपनी पूरी इच्छाशक्ति का प्रयोग कर, सारे भटकावों से परे होकर स्वयं को एक ही लक्ष्य पर केंद्रित करेंगे तो उद्देश्य की प्राप्ति कर पाएंगे। कपटी लोगों से सावधान रहें तो अच्छा होगा।",
      "negativeEvent": "चालाक और धोखेबाज होने के कारण आप भरोसे के लायक नहीं होंगे।"
     },
    {
      "id": 3,
      "name": "दी हाई प्रीस्टेस",
      "description" : "यह समय आपकी सुख-समृद्धि की ओर संकेत करता है।",
      "image": "3.jpg",

      "positiveEvent": "इसके प्रभाव से किसी राज का पर्दाफाश होगा। आंतरिक आभास तथा अंतर्प्रज्ञा शक्ति को अपना मार्गदर्शक बनाएं तो सुखी जीवन का भोग कर पाएंगे। अपनी छिपी प्रतिभाओं को पहचानकर तथा अपनी योग्यताओं का पूर्ण उपयोग कर सही क्षेत्र में प्रयोग करेंगे तो लाभ होगा। शांति से प्रतीक्षा करने पर ध्येय की प्राप्ति होगी।",
      "negativeEvent": "साहस व विश्वास की कमी के कारण अरुचिकर स्थितियों से भी समझौता कर लेंगे।"
    },
    {
      "id": 4,
      "name": "दी एम्प्रेस ",
      "description" : "आप दोराहे पर खड़े हैं। मन में कोई उलझन है जो सुलझ नहीं रही है, ऐसे में किसी अच्छे व बुद्धिमान पथ प्रदर्शक की आवश्यकता है।",
      "image": "4.jpg",

      "positiveEvent": "इसके प्रभाव से आप प्रकृति से संबंधित किसी नए कार्य की शुरुआत करेंगे। अपनी वित्तीय स्थिति को सुधारने की ओर ध्यान देंगे तो अच्छा होगा। घर में किसी नए मेहमान का आगमन होगा। प्रेम में कामना के अनुरूप परिणाम तथा प्रतिफल मिलेगा। अपनी सृजनशीलता को प्रोत्साहित करेंगे तो समृद्धि व सफलता की प्राप्ति होगी। सफलता, उर्वरता, मातृत्व, भावनात्मक सहयोग, सुरक्षा तथा हर्ष की प्राप्ति होगी। इंद्रिय सुख तथा भौतिक आनंद की प्राप्ति भी होगी।",
      "negativeEvent": "किसी के द्वारा आपको भावनात्मक रूप से ब्लैकमेल किया जा सकता है। धन संबंधी चिंताएं रहेंगी।"
     },
     {
      "id": 5,
      "name": "दी एम्परर",
      "description" : "अपना पक्ष स्वयं स्पष्ट करें। अपना धन, प्रसन्नता, अमन, चैन को दांव पर न लगाएं। यह मूर्खता है।",
      "image": "5.jpg",

      "positiveEvent": "इसके प्रभाव से उपलब्धि एवं सम्मान प्राप्त होगा। किसी पुरुष का आपके जीवन पर प्रभाव पड़ेगा तथा वह व्यक्तिगत तथा व्यापारिक मामलों में आपकी सहायता करेगा।",
      "negativeEvent": "अपने दकियानूसी विचारों को न बदल पाने के कारण जीवन में क्लेश रहेगा। संशय, निष्ठाहीनता तथा आत्मविश्वास की कमी के कारण उल्टा-सीधा बर्ताव करेंगे।"
     },
     {
      "id": 6,
      "name": "दी हायरोफेन्ट ",
      "description" : "व्यर्थ की लिप्साओं, इच्छाओं, आकांक्षाओं में अमरत्व प्राप्त करने का झूठा ख्याल छोड़ दें तो अच्छा है।",
      "image": "6.jpg",

      "positiveEvent": "इसके प्रभाव से आप सही और गलत की पृष्ठभूमि को पहचानने में सक्षम हो सकेंगे तथा मानसिक क्लेश का अंत होगा। कोई शिक्षक, गुरु या परामर्शदाता तथा परम्पराएं आपका मार्गदर्शन करेंगी तथा संशय दूर होंगे। आपमें विवाह की कामना जागृत होगी। ज्ञानार्जन कर समझदारी में विकास होगा, परिणामस्वरूप जागरूक होंगे। स्वयं को नियमों के साथ समायोजित करते हुए रीति-रिवाजों के भीतर ही कार्य करेंगे। किसी संगठन या समूह से के प्रति निष्ठावान रहेंगे। आपके प्रभाव और रुतबे में वृद्धि होगी। आप साहसी व उत्साही व्यक्ति हैं जो अपनी समस्याओं का समाधान स्वयं कर सकते हैं। आप एक शक्तिकेंद्रित व्यक्ति हैं जो अन्य लोगों पर अपना प्रभाव डाल सकता है। अपना हक प्राप्त करने के लिए आगे बढ़ेंगे तो सफल होंगे। मजबूत सिद्धांतों के अनुसार कार्य करते हुए नियम और मार्गनिर्देश लागू करेंगे तथा सुनिश्चित व्यवस्था का संचालन करेंगे।",
      "negativeEvent": "कोई व्यक्ति आप पर जबरदस्ती अपनी हुकूमत चलाकर आपको दबाने की कोशिश करेगा।"
     },
     {
      "id": 7,
      "name": "दी लवर्स ",
      "description" : "आपका भविष्य कैसा होगा, यह आप पर निर्भर है।",
      "image": "7.jpg",

      "positiveEvent": "इसके प्रभाव से आपके जीवन में नए प्रेम संबंध का प्रवेश होगा जिसके कारण आपका जीवन प्रभावित होगा। जोखिम उठाने के कारण आप आनंद तथा भावनात्मक संतोष की प्राप्ति कर सकेंगे। स्वयं के प्रति ईमानदार होकर प्रलोभनों से ऊपर उठकर दिल की बात सुनेंगे तो सुखमय जीवन का लाभ उठा सकेंगे। दूसरों के साथ सहानुभूति रख आत्मीय संबंध कायम करेंगे। आंतरिक ऊर्जा का इस्तेमाल कर सही व गलत का चुनाव करेंगे तो अच्छा होगा।",
      "negativeEvent": "जोखिम उठाने के भय के कारण आप कर्त्तव्यों के बंधन में जकड़े रहेंगे। किसी प्रलोभन में आकर अपने नैतिक मूल्यों से बेईमानी करेंगे। यौनाकर्षण के कारण विवाह संबंधों में हानि होगी, आपके निर्णय मस्तिष्क की अपेक्षा हृदय से अधिक प्रभावित होंगे जिसके कारण क्षति होगी।"
     },
     {
      "id": 8,
      "name": "दी चैरियट ",
      "description" : "तन-मन से अपने कार्य में लग जाएं, सफलता कदम चूमेगी। आपके भाग्य की लोग सराहना करेंगे।",
      "image": "8.jpg",

      "positiveEvent": "इसके प्रभाव से आप संशयों से उबर पाएंगे तथा किसी शुभ समाचार की प्राप्ति होगी। अपनी योग्यताओं तथा क्षमताओं पर विश्वास करके प्रयत्न जारी रखेंगे तो सफलता निश्चित मिलेगी। चुनौतियों और समस्याओं का पूरी दृढ़ता, साहस और आत्मविश्वास से सामना करेंगे तो लाभान्वित होंगे, यात्रा के योग बनेंगे तथा मनोवांछित वाहन की प्राप्ति होगी। अपने जीवन को बेहतर बनाने के लिए परिवर्तन का निर्णय अपनाएंगे तो अपनी महत्वाकांक्षाओं तथा सपनों को साकार रूप दे पाएंगे। संघर्ष तथा टकरावों के पश्चात विजय की प्राप्ति होगी। प्रतिस्पर्धा में आगे निकलकर सर्वोच्च स्थिति प्राप्त करेंगे।",
      "negativeEvent": "कोई प्रभावशाली व्यक्ति अपने स्वार्थ के लिए बलपूर्वक आपसे बात मनवाने की कोशिश करेगा। यात्राओं में विलंब व देरी होने के कारण निराशा का सामना करना पड़ेगा। हठ, घमंड तथा अहम् के कारण महत्वाकांक्षाएं अपूर्ण ही रह जाएंगी तथा हताशा का सामना करना पड़ेगा।"
     },
     {
      "id": 9,
      "name": "दी जस्टिस ",
      "description" : "ईश्वरीय न्याय से डरिए। आकस्मिक घटनाओं के होने से सतर्क रहें।",
      "image": "12.jpg",

      "positiveEvent": "इसके प्रभाव से किसी भी मुकदमे में आपके पक्ष में न्याय होगा। अतीत में किए हुए प्रयत्नों का लाभ प्राप्त होगा। सावधानी तथा सतर्कता से कार्य करें तथा सही परामर्श प्राप्त करने का प्रयास करेंगे तो लाभान्वित होंगे। ईमानदारी, निष्ठा तथा आदर्शवादिता के साथ कार्य करेंगे तो अच्छा होगा।",
      "negativeEvent": "अपनी गलतियों को पहचानकर उन्हें दूर करने का प्रयास करेंगे। नैतिक सिद्धांतों के आधार पर कार्य करते हुए निष्पक्ष बने रहेंगे तो आपके अनुकूल होगा।"
     },
     {
      "id": 10,
      "name": "दी हरमिट ",
      "description" : "यदि आप अपव्यय का त्याग कर दें तो एक न एक दिन आप भी धनवान होंगे।",
      "image": "10.jpg",

      "positiveEvent": "किसी भरोसेमंद व्यक्ति से सलाह लेकर आत्मविश्लेषण करके निर्णय लें तो लाभान्वित होंगे। अपने विकल्पों को धैर्य के साथ परखें तथा अधीरता का त्याग करना उचित होगा। स्वयं में उत्साह का सृजन करें तथा परिस्थितियों से लड़ने के लिए तत्पर रहें।",
      "negativeEvent": "संशयों के कारण आप किसी की सलाह न मानकर घमंडीपन तथा हठधर्मिता में रहेंगे और हानि उठाएंगे। उत्तेजना तथा उतावलेपन के साथ निर्णय लेने के कारण परेशानियां आएंगी।"
     },
     {
      "id": 11,
      "name": "दी व्हील ऑफ फॉरच्यून ",
      "description" : "आपका व्यवहार और अच्छे कार्य ही आपको ऊंचा उठा देंगे। अतः अपने कार्य में लगे रहें।",
      "image": "11.jpg",

      "positiveEvent": "इसके प्रभाव से आपके जीवन में सौभाग्य का उदय होगा। वर्तमान में चल रही समस्याओं का अंत होगा और अतीत में किए प्रयत्नों व प्रयासों का प्रतिफल प्राप्त होगा। अचानक धन या अप्रत्याशित पदोन्नति प्राप्त होगी। विकट स्थिति का सामना शांति से करेंगे तो अच्छा होगा। अंतरात्मा की आवाज आपको उच्च स्तरों तक उठने के लिए प्रोत्साहित करेगी।",
      "negativeEvent": "आपके सारे काम उल्टे होने लगेंगे जिसके कारण परेशानियों का सामना करना पड़ेगा।"
     },
     {
      "id": 12,
      "name": "दी स्ट्रेन्थ",
      "description" : "ऐसा कार्य भूलकर भी न करें जिसमें व्यर्थ का जोखिम उठाना पड़े। अंधे बनकर कुएं में छलांग लगा देना बुद्धिमानी नहीं है।",
      "image": "9.jpg",

      "positiveEvent": "इसके प्रभाव से स्वास्थ्य में लाभ होगा। विकट परिस्थितियों में सहनशक्ति से काम लेंगे तो विजय आपकी होगी। साहस, ताकत और ईमानदारी से सभी चुनौतियों पर हावी हो सकेंगे तथा ईर्ष्या पर काबू पा सकेंगे। खोए हुए अवसरों की पुनः प्राप्ति होगी। अपने भय से ऊपर उठकर कठिनाइयों का सामना करेंगे तथा हताशा से शांतिपूर्वक निबटेंगे तो अच्छा होगा। आंतरिक इच्छाशक्ति तथा आत्मबल का प्रयोग करेंगे तो अपने लक्ष्य की प्राप्ति कर पाएंगे। दूसरों को खुले दिल से स्वीकार कर उनकी गलतियों को क्षमा करेंगे तो अच्छा होगा। कमजोरी, पराजय, कायरता, असुरक्षा आदि को त्यागकर अपनी अभिलाषाओं की पूर्ति में जुट जाएं।",
      "negativeEvent": "भय के कारण विपरीत परिस्थितियों के सामने समर्पण कर देंगे। ताकत और साहस के अभाव में अन्याय को भी स्वीकार कर लेंगे।"
     },
     {
      "id": 13,
      "name": "दी हैंग्ड मैन",
      "description" : "सुख-दुख का जोड़ा है, अतः छोटी-मोटी बातें होती रहती हैं। व्यर्थ परेशान न हों।",
      "image": "13.jpg",

      "positiveEvent": "इसके प्रभाव से आप अधिक लाभ अर्जित करेंगे। अपने अंतर्मन की आवाज सुनेंगे तो लाभान्वित होंगे। परीक्षा की घड़ी में धैर्य से काम लेंगे तो अच्छा होगा। शीघ्रता के भाव तथा जल्दबाजी को त्यागेंगे तो लाभ होगा।",
      "negativeEvent": "इच्छाशक्ति के अभाव में अपने मार्ग से भटक सकते हैं। शीघ्रता तथा जल्दबाजी में निर्णय लेने के कारण हानि होगी।"
     },
     {
      "id": 14,
      "name": "दी डैथ ",
      "description" : "आपका व्यवहार व शुभ कार्य ही आपको प्रगति प्रदान करेंगे।",
      "image": "14.jpg",

      "positiveEvent": "इसके प्रभाव से नए कामों की शुरुआत होगी तथा पुराने कार्य समाप्त होंगे। अपनी पूरी योग्यता तथा क्षमता से काम करेंगे तो सफल होंगे।",
      "negativeEvent": "परिवर्तन का प्रतिरोध करने पर अवसरों को खो देंगे। आपके भय की तीव्रता ज्यादा हो सकती है।"
     },
     {
      "id": 15,
      "name": "दी टैम्परेन्स ",
      "description" : "आप जो निर्णय लेने जा रहे हैं, जिस कार्य पर कृतसंकल्प हैं, उस पर एक बार फिर पुनर्विचार कर लें।",
      "image": "15.jpg",

      "positiveEvent": "इसके प्रभाव से आपमें आंतरिक संतुलन उत्पन्न होगा। विवादित मुद्दों को धैर्य व ठंडे दिमाग से सुलझाएं तो लाभ होगा। किसी अपने का मार्गदर्शन मिलेगा। सहकारिता के भाव का उदय होगा तथा स्वास्थ्य अच्छा रहेगा।",
      "negativeEvent": "जल्दबाजी में निर्णय लेने के कारण प्रगति कुंठित होगी। भोग विलास की प्रवृत्ति होने के कारण घरेलू झगड़े आरंभ हो जाएंगे।"
     },
     {
      "id": 16,
      "name": "दी डेविल ",
      "description" : "आपकी धारणा दोषपूर्ण है। आपके दिन इतने बुरे नहीं हैं, जितना आप सोच रहे हैं।",
      "image": "16.jpg",

      "positiveEvent": "इसका प्रकटीकरण विवाह संबंधी मामलों की अभिव्यक्ति और अखंड रिश्तों को अभिव्यक्त करता है। इसके प्रभाव से आपको सभी प्रकार के आनंद तथा शारीरिक संतुष्टि की प्राप्ति होगी। अपनी कमजोरियों को पहचानकर उनसे उबरने का प्रयास करेंगे तो अच्छा होगा।",
      "negativeEvent": "अधिक खर्चीला होने के कारण वित्तीय समस्याओं का सामना करना पड़ेगा। गलत व्यसनों के कारण स्वास्थ्य खराब रहेगा।"
     },
     {
      "id": 17,
      "name": "दी टॉवर ",
      "description" : "सतर्क हो जाएं तो अच्छा होगा। भाग्य पर भरोसा न करें। कर्म का वातावरण बनाएं।",
      "image": "17.jpg",

      "positiveEvent": "इसके प्रभाव से अहितकारी घटनाएं समाप्त होंगी तथा आप अधिक दृढ़ तथा मजबूत होंगे। चुनौतियों का डटकर सामना करेंगे तो जीत आपकी होगी। अतीत को भूलकर आगे बढ़ें तथा पिछली गलतियों को पुनः न दोहराएं।",
      "negativeEvent": "इसका प्रकटीकरण आने वाले किसी बड़े विध्वंस का सूचक है। अप्रत्याशित सदमे तथा अहितकर घटनाओं के चलते असुविधा का सामना करना पड़ेगा। आपकी विद्रोही प्रकृति के कारण घर में समस्याएं उत्पन्न होंगी तथा आपको अलगाव का सामना करना पड़ सकता है। आप पर बेवजह लांछन लग सकता है। आपके द्वारा किए गए निर्णयों द्वारा भौतिक तथा भावनात्मक रूप से क्षति होगी जिसके कारण जीवन में खलबली मच जाएगी।"
     },
     {
      "id": 18,
      "name": "दी स्टार ",
      "description" : "आपने जो कुछ सोचा-विचारा है, जो आशाएं बांधी हैं, वह सभी समय पर पूर्ण होंगी। विवेक से कार्य करें।",
      "image": "18.jpg",

      "positiveEvent": "इसके प्रभाव से आपमें उम्मीद तथा निष्ठा का दृढ़ीकरण होगा। नए संबंध बनेंगे तथा नए उद्यम के योग बनेंगे। आपकी सभी इच्छाओं की पूर्ति होगी तथा अप्रत्याशित उपहारों की प्राप्ति होगी। दुख की समाप्ति होकर एक नई आशा और संतुष्टि की प्राप्ति होगी। अपने भयों से मुक्ति पाकर संशय के परे हो जाएंगे।",
      "negativeEvent": "स्वयं के प्रति अविश्वासी तथा अपनी योग्यताओं पर विश्वास न होने के कारण कई अच्छे अवसरों से हाथ धोना पड़ेगा।"
     },
     {
      "id": 19,
      "name": "दी मून",
      "description" : "पत्र माध्यम से शीघ्र ही महत्वपूर्ण समाचार प्राप्त होगा।",
      "image": "19.jpg",

      "positiveEvent": "इसके प्रभाव से आपके सभी संशयों का नाश होगा तथा आपको सही मार्ग की प्राप्ति होगी। मजबूती, धैर्य, स्पष्ट मस्तिष्क तथा तर्कपूर्णता से निर्णय लेकर कार्य करेंगे तो सफलता हासिल करेंगे। किसी कलात्मक अभिव्यक्ति के कारण अप्रत्याशित अवसर प्राप्त होंगे।",
      "negativeEvent": "मन में झूठ तथा मक्कारी होने के कारण हमेशा चिंता से ग्रस्त रहेंगे। भय और चिंताएं प्रगति की राह में बाधा बनेंगी। संशय के कारण आपका जीवन अस्त- व्यस्त हो सकता है।"
     },
     {
      "id": 20,
      "name": "दी सन ",
      "description" : "जलन, कुढ़न, राग, द्वेष, ईर्ष्या, मानसिक शांति भंग कर देतहै। अभी समय है, संभल जाएं।",
      "image": "20.jpg",

      "positiveEvent": "इसका प्रकटीकरण हर्षदायक, प्रसन्नतावर्द्धक, किसी शुभ समाचार का प्रतीक है। इसके प्रभाव से मित्रों व परिवार के साथ सौहार्दपूर्ण संबंध बनेंगे। स्वास्थ्य अच्छा रहेगा।",
      "negativeEvent": "घमंड तथा अहम् के कारण गलत समायोजन करेंगे जिसके कारण हानि होगी। योजनाओं में विलंब होगा और उपलब्धियां भी देरी से प्राप्त होंगी।"
     },
     {
      "id": 21,
      "name": "दी जजमेन्ट",
      "description" : "अत्यधिक लोभ संकट ही पैदा करता है। दोष भी पैदा करता है। अतः लोभी भावनाओं से दूर रहें।",
      "image": "21.jpg",

      "positiveEvent": "इसके प्रभाव से आपको विगत के प्रयत्नों के लिए प्रतिफल की प्राप्ति होगी। स्वास्थ्य अच्छा रहेगा। जीवन के प्रति नए उत्साह की प्राप्ति होगी। परिवर्तन को स्वीकार कर आगे बढ़ेंगे तो नई दिशा की प्राप्ति होगी। अतीत की गलतियों को भूलकर खुले दिल और दिमाग से निर्द्वद्व होकर निर्णय लेंगे तो अच्छा होगा। नए अवसरों को ग्रहण करेंगे तो लाभ की प्राप्ति होगी।",
      "negativeEvent": "विलंब तथा व्यवधान से घबराकर कार्यों को बिगाड़ लेंगे, परिणामस्वरूप अच्छे अवसर खो देंगे। स्वयं पर अविश्वास तथा पुरानी गलतियों की आत्मग्लानि के कारण हानि उठानी पड़ेगी। आपके हित में होने वाली घटनाएं विपरीत रूप ले सकती हैं अथवा विलंबित हो सकती हैं।"
     },
     {
      "id": 22,
      "name": "दी वर्ल्ड ",
      "description" : "ऐसा कार्य करें जो उचित हो। जो कुछ है, पर्याप्त है, यही प्रसन्नता का मूल-मंत्र है।",
      "image": "22.jpg",

      "positiveEvent": "इसके प्रभाव से आपकी इच्छाओं की पूर्ति होगी। उपलब्धियों की प्राप्ति, सफलता तथा विजय की प्राप्ति होगी। प्रयत्न करते रहें, जीत आपकी होगी। लंबे संघर्ष के बाद सफलता, पूर्णता, संतोष तथा तृप्ति की प्राप्ति होगी। अपने मस्तिष्क को खुला और सुग्राह्य रखें।",
      "negativeEvent": "कार्य का प्रतिफल मिलने में देरी होगी। मंजिल की प्राप्ति के लिए संघर्ष करना पड़ेगा।"
     },
     {
      "id": 23,
      "name": "ऐस ऑफ बैंड्स ",
      "description" : "आप परिवर्तन चाहते हैं तो देर क्यों! कर दीजिए परिवर्तन, परिणाम सुखद, शुभ व अनुकूल होंगे।",
      "image": "23.jpg",

      "positiveEvent": "इसके प्रभाव से आपके लिए वृहद् संभावनाओं के द्वार खुलेंगे। कल्पनाशक्ति जीवंत होगी तथा छिपी हुई प्रतिभा का प्रकटीकरण होगा। समस्याओं के समाधान प्राप्त होंगे। आप एक नए व्यवसाय की प्राप्ति करेंगे। अपनी मूल प्रवृत्ति की आवाज सुनेंगे तो सफल होंगे। जोखिम लेकर कार्य करने पर अपनी इच्छाओं की प्राप्ति कर पाएंगे। भावनात्मक और व्यक्तिगत इच्छाशक्ति का प्रयोग करें तो अच्छा होगा। नए रचनात्मक अवसरों की ओर अपनी ऊर्जा का प्रयोग करने से बल मिलेगा। साहस व जोश से कार्य करने पर नवजीवन का अंकुरण होगा जो आपके अनुकूल होगा। आशावाद को कायम रखकर दूसरों के लिए प्रेरणा का स्रोत बनेंगे। स्वयं पर विश्वास, अपनी योग्यताओं तथा पथ के सही होने पर भरोसा कर तथा सफलता के प्रति आश्वस्त होकर स्थितियों के अनुकूल होने का इंतजार करें तो अच्छा होगा। चुनौतीपूर्ण कार्यों से जूझने के लिए अपनी सीमाओं के परे जाकर भय का सामना करेंगे तो लाभान्वित होंगे। अपनी योग्यताओं को पूरा विस्तार देंगे तो एक नए मार्ग का सूत्रपात करेंगे। ",
      "negativeEvent": "नए कार्यों में हानि होगी। नई परियोजनाओं और व्यवसायों से संबंधित कार्य न करें। स्वार्थपरता तथा दृढ़ निश्चय में कमी के कारण व्यवसाय संबंधी कार्यों में सफलता नहीं मिलेगी।"
     },
     {
      "id": 24,
      "name": "टू ऑफ बैंड्स ",
      "description" : "धीरे-धीरे अपना विश्वास देते हुए परिवार के लोगों को ईश्वर-भक्ति की ओर उन्मुख करें, वही सबसे बड़ा रक्षक है।",
      "image": "24.jpg",

      "positiveEvent": "इसके प्रभाव से जोश से कार्य करने पर आप स्वयं को दुनिया के सम्मुख प्रस्तुत करने में सफल होंगे। प्रतीक्षा करने पर अप्रत्याशित आश्चर्यों की प्राप्ति होगी। आपकी सहायता करने को तत्पर किसी समझदार व्यक्ति की सहायता लेंगे तो अच्छा होगा। अच्छी शुरुआत आपके विरुद्ध हो सकती है परन्तु अधीरता का त्याग करना उचित होगा। कार्य को पूर्ण प्रयत्न के साथ करने पर उन्नति सुनिश्चित है, धैर्यपूर्वक प्रतीक्षा करेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "निराशा, उत्तेजना, कमजोर आत्मरक्षा, विश्वास की कमी, उपेक्षा, हताशा और कुंठा के समय में सावधानी से कार्य करें, तो अच्छा होगा। असंतुष्ट होकर नए कार्य को करने का जोखिम न उठाएं। अधीरता के कारण अच्छी शुरुआत भी आपके विरुद्ध हो सकती है।"
     },
     {
      "id": 25,
      "name": "थ्री ऑफ बैंड्स ",
      "description" : "अपना इरादा बदल दें, इसी में सबका भला है, अन्यथा पछताएंगे।",
      "image": "25.jpg",

      "positiveEvent": "इसके प्रभाव से अपने आस-पास घटित होने वाली घटनाओं पर नियन्त्रण रख पाएंगे। निर्भीक होकर नए क्षेत्रों में प्रविष्ट होंगे तो निःसंदेह सफलता आपकी होगी। संयुक्त उपक्रम के माध्यम से आपकी वित्तीय स्थिति मजबूत होगी। नई शुरुआत में परिवर्तन और चुनौतियों का सामना करने से लाभ प्राप्त होंगे। संदेहों से मुक्त होकर कार्य करने पर सफल होंगे। अपने विचारों को मान्यता दिलवाकर नेतृत्व की प्राप्ति कर पाएंगे। सीमाओं के परे देखकर दीर्घ दृष्टिकोण का परिचय देंगे तो अच्छा होगा। उत्तेजना को त्यागकर गंभीरता से सोच-समझकर निर्णय लेकर कार्य करना उचित होगा। हिम्मत और धैर्य से कार्य करते रहें। व्यवसाय में वाक्चातुर्य का प्रयोग करेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "उत्तेजना, घमंड और अक्खड़ता से कार्य करने पर हानि होगी। सहयोग के अभाव में प्रयत्न निष्फल होंगे तथा व्यवसाय में हानि का सामना करना पड़ेगा। कार्यों के पूर्ण होने में विलम्ब होगा। नई शुरुआत में चुनौतियों का सामना करना पड़ेगा।"
     },
     {
      "id": 26,
      "name": "फोर ऑफ बैंड्स ",
      "description" : "शत्रु अपना कार्य करते हैं, करने दें। आप अपना कार्य करें। उनका षड्यंत्र उन्हें स्वतः ले डूबेगा।",
      "image": "26.jpg",

      "positiveEvent": "इसके प्रभाव से शारीरिक, मानसिक तथा भावनात्मक स मस्याओं से उबरकर कार्य करने पर विकास और समृद्ध ि आपकी होगी। हताशा और निराशा को छोड़, कार्य को पूर्ण करें तो चमत्कारी परिणाम प्राप्त होंगे। आपकी मनोवांछित इच्छाएं पूर्ण होंगी।",
      "negativeEvent": "अधीरता, उत्तेजना तथा भागीदारी में भेदभाव के का रण परियोजना/व्यवसाय में असफलता का सामना करना प ड़ेगा। प्रतिबद्धता के अभाव तथा विचारों में भिन्नता क े कारण प्रेम में हताशा और निराशा होगी। अस्थिर संबंधों के कारण मन में बेचैनी तथा असंतु ष्टि रहेगी। शारीरिक, मानसिक तथा भावनात्मक समस्याओं का साम ना करना पड़ेगा।"
     },
     {
      "id": 27,
      "name": "फाइव ऑफ बैंड्स",
      "description" : "आप उतावले न हों, थोड़ा धैर्य रखें जो कुछ वास्तविकता है, वह सामने आ जाएगी और तब आप सोचें।",
      "image": "27.jpg",

      "positiveEvent": "इसके प्रभाव से विरोध और संघर्ष समाप्त होंगे। धैर्य के साथ परिस्थितियों का सामना करने पर सभी उपलब्धियों की प्राप्ति होगी। जोश व साहस से कार्य करने पर महत्वाकांक्षाओं को प्राप्त करने में सफल होंगे। क्रोध व हताशा का दमन करने पर प्रगति की राह प्राप्त कर पाएंगे। व्यवसाय के लाभ के लिए अतीत में किए सभी कार्यों व प्रयासों का फल प्राप्त होगा। अपने विरोधी का सम्मान कर अपने दृष्टिकोण पर डटे रहेंगे तो अच्छा होगा। अपनी सामान्य क्षमता से कुछ अतिरिक्त परिश्रम व प्रयास करेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "जुए व रेस जैसे कार्यों में संलग्न रहना खतरनाक साबित हो सकता है। क्रोध, हताशा, घृणा व पूर्वाग्रहों के कारण हानि का सामना करना पड़ेगा। व्यक्तिगत संघर्ष के कारण सभी के स्वयं के प्रति विरोधी होने का आभास होगा। कड़ी स्पर्धा होने के कारण कई बार हताशा का सामना करना पड़ेगा।"
     },
     {
      "id": 28,
      "name": "सिक्स ऑफ बैंड्स ",
      "description" : "चिंता छोड़ो, सुख से जियो। किसी शुभ, अनुकूल और अच्छे परिवर्तन से आपको विपुल मात्रा में धन मिलने का योग है।",
      "image": "28.jpg",

      "positiveEvent": "इसका प्रकटीकरण आपके जीवन का सर्वोच्च सुखद समय है, अतः आपकी महत्वाकांक्षाओं की पूर्ति होगी व अत्यधिक सफलता की प्राप्ति होगी। अच्छे लोगों का सान्निध्य प्राप्त होगा। घमंड और अक्खड़ता के शिकार न हों तो अच्छा होगा।",
      "negativeEvent": "श्रम का प्रतिफल देर से मिलेगा। घमंड और अक्खड़ता के कारण राह में कठिनाइयां आएंगी व बुरी खबरें मिलेंगी। शत्रुओं की सफलता से हानि होगी।"
     },
     {
      "id": 29,
      "name": "सेवन ऑफ बैंड्स ",
      "description" : "जो कुछ हुआ, वह अपने प्रयासों से और दुर्भाग्य का सारा दोष ईश्वर पर मढ़कर आप अच्छा नहीं कर रहे हैं। अच्छा हो, यदि उत्साह से काम करें और दुर्भाग्य दोष दूर करें, समृद्धिशाली बनेंगे।",
      "image": "29.jpg",

      "positiveEvent": "इसके प्रभाव से धैर्य और आत्मविश्वास से चुनौतियों का सामना करने में सफल होंगे। ऊर्जा और साहस से कार्य करेंगे तो जीत हासिल कर पाएंगे। स्वयं को एकाग्र बनाए रखेंगे तो अच्छा होगा। इच्छाशक्ति का प्रयोग करेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "यह कार्ड चुनौती और संघर्ष का कार्ड है, अतः चलते हुए सफल व्यवसाय में चुनौतियां और बाधाएं आएंगी। प्रतियोगी परिस्थितियों में बहाव के विरुद्ध संघर्ष करना पड़ेगा। इच्छाशक्ति के अभाव में हिम्मत खो देंगे।"
     },
     {
      "id": 30,
      "name": "ऐट ऑफ बैंड्स ",
      "description" : "सत्यता का व्यवहार कभी न त्यागें। निकट भविष्य में कई महत्वपूर्ण कार्य मिलेंगे।",
      "image": "30.jpg",

      "positiveEvent": "इसके प्रभाव से आपमें ऊर्जा का प्रादुर्भाव होगा। आत्मिक, मानसिक व शारीरिक उन्नति प्राप्त होगी। कार्य करने के लिए लोगों का सान्निध्य प्राप्त होगा। किसी अच्छी खबर की प्राप्ति होगी। समस्याओं के हल तुरंत स्वयं ही प्राप्त होंगे। संचार, आपातकालीन स्वास्थ्य सेवा, वायु यातायात नियन्त्रण, सेना, वित्त/निवेश, राजनीति, कानून आदि पेशा या व्यवसाय अपनाएंगे तो अच्छा होगा। योजनाओं को मूर्त रूप प्रदान करने के लिए यह अच्छा समय है।",
      "negativeEvent": "आपसे ईर्ष्या करने वालों की संख्या में वृद्धि होगी। अच्छी खबरों के आने में देरी होगी। व्यवसाय में मंदी रहेगी। आपके व्यक्तिगत जीवन में प्रेम में ठहराव की स्थिति बनेगी। हमेशा की तरह पुनः साहस या खतरों से खेलने का जोखिम उठाएंगे तो हानि होगी।"
     },
     {
      "id": 31,
      "name": "नाइन ऑफ बैंड्स ",
      "description" : "लोभ के वशीभूत किया गया कार्य कभी भी फलीभूत नहीं होता।",
      "image": "31.jpg",

      "positiveEvent": "इसके प्रभाव से आपको शारीरिक व मानसिक स्वास्थ्य को बनाए रखने के लिए आत्मसंयम और संतुलन की प्राप्ति होगी। ऊर्जा का सदुपयोग करने से आपको चमत्कारिक शक्ति प्राप्त होगी। धैर्यवान और सावधान रहेंगे तो सफल होंगे। अति श्रम से बचकर स्वयं को तनावमुक्त रखें तो अच्छा होगा। बुरे वक्त में अपने प्रियजनों या शुभचिंतकों से सहायता लेंगे तो आपके अनुकूल रहेगा।",
      "negativeEvent": "गुप्त शत्रुओं के विरोध से हानि होगी। अप्रत्याशित समस्याएं उत्पन्न होंगी। कार्य के प्रति अरुचि होने तथा ऊर्जा का दुरुपयोग करने से व्यवसाय में हानि होगी। अत्यधिक श्रम के कारण तनाव उत्पन्न होगा, परिणामस्वरूप स्वास्थ्य खराब रहेगा।"
     },
     {
      "id": 32,
      "name": "टेन ऑफ बैंड्स ",
      "description" : "विपत्ति से क्या घबराना। हर संभव प्रयास कर विपत्ति की पाठशाला में उत्तीर्ण हो जाएंगे।",
      "image": "32.jpg",

      "positiveEvent": "इसके प्रभाव से आप उच्च पद पर आसीन होंगे। जीवन में कठिन समय आने पर रक्षात्मक उपाय करें। दुनियादारी की तरफ गंभीर दृष्टिकोण अपनाएंगे तो अच्छा होगा। चुनौतियों के विरुद्ध तथा समस्याओं से छुटकारा पाने के लिए दृढ़ और मजबूत बने रहें तो सफल होंगे। आवास तथा रोजगार में परिवर्तन का योग बनेगा। सावधानी से कार्य करते रहें।",
      "negativeEvent": "चिंता, तनाव, सिरदर्द, नजर की कमजोरी जैसी बीमारियों के कारण स्वास्थ्य खराब रहेगा। कार्य का आधिक्य रहेगा। लंबित पड़े अथवा शुरू हुए किसी भी मुकदमे में हार का सामना करना पड़ेगा। खुशियों के अभाव में दूसरों की खुशी को बर्बाद करने की इच्छा जागृत होगी। ताकत और ऊर्जा का प्रयोग केवल स्वार्थसिद्धि के लिए होगा। स्वयं को अस्वीकार्यता, मजाक बनने एवं जलालत के भय से दबाकर रखने से ऊर्जा अभिव्यक्ति ऋणात्मक गुणों से पूरित होगी जिसके कारण स्वयं की हानि होगी। आपके द्वारा बनाए गए नियम आप ही के लिए बंधन बनेंगे। अधिक व्यापारिक विकास होने के कारण आप उसका उचित प्रबंधन नहीं कर नाएंगे, परिणामस्वरूप सामाजिक जीवन असंतुष्ट रहेगा।"
     },
     {
      "id": 33,
      "name": "पेज ऑफ बैंड्स ",
      "description" : "जैसे व्यवहार की आप दूसरों से अपेक्षा करते हैं, ठीक वैसा ही व्यवहार आपको भी उनके प्रति करना चाहिए। ऐसा करने से धन, समय व श्रम की बचत होगी।",
      "image": "33.jpg",

      "positiveEvent": "इसके प्रभाव से रचनात्मक ढंग से आपका जीवन बदल जाएगा। अवसरों का लाभ उठाएंगे तो अपना भाग्य बदल पाने में समर्थ हो सकेंगे। प्रेम संबंधों की अभिव्यक्ति व अपनी बात मनवाने के लिए यह समय अति अनुकूल है। सकारात्मक रहें तथा जोश से कार्य करें। स्वयं को अभिव्यक्त कर अपनी रचनात्मक और व्यक्तिगत शक्ति का प्रयोग करें तो अच्छा होगा।",
      "negativeEvent": "किसी बुरी खबर की प्राप्ति होगी जो आपके अस्तित्व तथा व्यक्तिगत लक्ष्य को प्रभावित करेगी। निराशावादिता घर कर लेगी तथा आप दूसरों को नीचा दिखाकर स्वयं को आनन्दित महसूस करने लगेंगे। नीच भावनाओं से ग्रस्त होकर आक्रामक प्रवृत्ति के बन जाएंगे जिससे समाज में आदर एवं प्रशंसा के पात्र नहीं बन सकेंगे। आपके आवेग तथा तुनकमिजाजी के कारण कार्य बिगड़ जाएंगे, जिससे हानि होगी।"
     },
     {
      "id": 34,
      "name": "नाइट ऑफ बैंड्स",
      "description" : "ईश्वर पर भरोसा करें, उसकी दया से दुर्दिन के बादल छंटने वाले हैं।",
      "image": "34.jpg",

      "positiveEvent": "यह विकास का कार्ड है। इसके प्रभाव से यात्रा का योग बनेगा। अपनी आत्मिक वृद्धि के लिए जोखिम लेना अच्छा होगा। आप सभी कार्य जोशपूर्ण ढंग से करेंगे। क्रोध और ईर्ष्या से बचेंगे तो आपके अनुकूल होगा।",
      "negativeEvent": "क्रोध, ईर्ष्या तथा आवेग में आकर कार्य बिगाड़ देंगे। कार्य में विलम्ब तथा अवरोधों के कारण निराशा और क्रोध की उत्पत्ति होगी। कार्य को पूर्ण करने के लिए अपनी शक्ति का नकारात्मक उपयोग करेंगे।"
     },
     {
      "id": 35,
      "name": "क्वीन ऑफ बैंड्स ",
      "description" : "आप जब लक्ष्य प्राप्त कर लें तो शांति धारण कर लें। निन्यानवे का चक्कर कभी पूरा नहीं होता। लोभ का कहीं अंत नहीं है।",
      "image": "35.jpg",

      "positiveEvent": "इसके प्रभाव से चारों दिशाओं में आपके लिए उन्नति के द्वार खुलेंगे। तीव्र आंतरिक शक्ति व उद्देश्य केंद्रित होने से आप अपनी स्थिति को अपने अनुकूल और उच्चता के स्तर पर लाने में सफल होंगे। अपने पथ पर ईमानदारी व निष्ठा के साथ आगे बढ़ेंगे तो अच्छा होगा।",
      "negativeEvent": "आपके क्रुद्ध स्वभाव के कारण शत्रुओं की संख्या बढ़ेगी। आप स्वयं ही स्थितियों को अपने विपरीत बना लेंगे तथा शत्रुओं को हमले के लिए आमन्त्रण देंगे। आत्मकेंद्रित स्वभाव होने के कारण द्वेष व ईर्ष्या मन में घर कर लेगी।"
     },
     {
      "id": 36,
      "name": "किंग ऑफ बैंड्स",
      "description" : "आत्मनिर्णय से बड़ा निर्णय कोई नहीं, स्वयं सोचें कि आपको क्या करना है।",
      "image": "36.jpg",

      "positiveEvent": "इसके प्रभाव से आप ऊर्जा, जोश और आत्मविश्वास से कार्य करते हुए अपने साथ बहुत से लोगों को जोड़ने में सफल होंगे। आप परम्पराओं से अलग अपने मानदंड स्वयं स्थापित करेंगे। शक्ति और सत्ता को हासिल करने का यही उचित समय है। अपनी ताकत और साहस का परिचय देकर खतरों से खेलते हुए अपने उद्देश्य की प्राप्ति करेंगे। निर्माणात्मक तथा मजबूत व्यक्तित्व के कारण दूसरों के लिए प्रेरणा का स्रोत बनेंगे।",
      "negativeEvent": "बिना सोचे-समझे, केवल दूसरों के आदेशों के अनुरूप कार्य करेंगे। स्वार्थ, काम, क्रोध और ईर्ष्या से ग्रस्त रहेंगे।"
     },
     {
      "id": 37,
      "name": "ऐस ऑफ कप्स ",
      "description" : "समय सर्वथा अनुकूल व शुभ है, समय आपका अपना है, लाभ उठा सकते हैं।",
      "image": "37.jpg",

      "positiveEvent": "इसके प्रभाव से आपकी सभी इच्छाओं और अभिलाषाओं की पूर्ति होगी। आध्यात्मिकता की उत्पत्ति होगी तथा जीवन के प्रति भावनात्मक रूप से जागरूक होंगे। प्रेम के द्वारा आप विपरीत स्थिति को भी अपने पक्ष में कर सकने में सक्षम होंगे। अनेक मित्रवत मागर्गों की खोज कर दूसरों से मधुर संबंध स्थापित करेंगे। अपनी अंतरात्मा की आवाज पर विश्वास करेंगे तो अच्छा होगा। अपने क्रोध को स्वयं से पृथक करने में सफल होंगे, परिणामस्वरूप आनंद का अनुभव करेंगे।",
      "negativeEvent": "प्रेम में क्षति होगी, परिणामस्वरूप जीवन में अलगाव, अकेलापन, उदासी तथा दुख की प्राप्ति होगी। झूठ तथा स्वार्थपरता के कारण विरोध का सामना करना पड़ेगा।"
     },
     {
      "id": 38,
      "name": "टू ऑफ कप्स ",
      "description" : "- दिखावा, प्रदर्शनप्रियता, झूठी महत्वाकांक्षा के फेर में पड़कर अपना ही अहित करेंगे। जो हैं, वही बने रहें। वर्तमान में संतुष्ट रहना सीखें।",
      "image": "38.jpg",

      "positiveEvent": "इसके प्रभाव से आपको प्रेम में सफलता मिलेगी, जीवनसाथी के चयन के लिए निश्चय ही यह उचित समय है। आपका जुड़ाव विभिन्न समूहों, लोगों, विचारों तथा प्रतिभाओं के साथ होने से एक नई ताकत का सृजन होगा। भागीदारी में कार्य करने के इच्छुक लोगों के लिए यह उपयुक्त समय होता है। शत्रुओं से संधि कर अपने मित्र बढ़ाने के अवसर का लाभ उठाएंगे तो आपके अनुकूल होगा। परिस्थितियों के मध्य सामंजस्य स्थापित करने का प्रयास करेंगे तो अच्छा होगा।",
      "negativeEvent": "आनंद का पीड़ा में रूपांतरण होगा, परिणामस्वरूप मदिरापान में अधिक संलग्न रहेंगे जो खतरनाक हो सकता है। अर्जित लाभ लुट जाने का भय बना रहेगा।"
     },
     {
      "id": 39,
      "name": "थ्री ऑफ कप्स ",
      "description" : "यह आपने कैसे सोच लिया कि केवल धन से ही सुखव संतोष मिलता है।",
      "image": "39.jpg",

      "positiveEvent": "इसके प्रभाव से अतित की समस्याओं का निवारण होने से पूर्णता और संतुष्टि की प्राप्ति होती है। किसी भी नई परियोजना या उपक्रम की शुरूआत अच्छी साबित होगी। सभी के सुख-दुख मे मदद तथा समाज सेवा करके लोगों की सहायता करेंगे। ",
      "negativeEvent": "नये उपक्रमों व यात्राओं में खतरों का सामना करना पड सकता है। भ्रष्टाचार के कारण मित्रता तथा रिश्तों में दरार आ सकती है। आरा मतलब स्वभाव होने के कारण निराशा का सामना करना पड़ेगा।"
     },
     {
      "id": 40,
      "name": "फोर ऑफ कप्स ",
      "description" : "यदि समृद्धि, यश, मान-प्रतिष्ठा चाहते हैं तो सच्चाई व ईमानदारी का अवलंब न छोड़ें। सत्य की सदैव जीत होती है। ऐसा अवसर न आने दें जो अवनति की ओर ले जाए।",
      "image": "40.jpg",

      "positiveEvent": "इसके प्रभाव से अपने क्रियाकलापों में हुई गलतियों का निराकरण करने तथा अनुत्तरित सवालों के जवाब ढूंढने में सफल होंगे। बिगड़ी हुई परिस्थितियों पर अपना दृष्टिकोण सकारात्मक रखेंगे तो लाभान्वित होंगे। व्यवसाय में लाभ होगा तथा नए रोजगार के अवसर भी प्राप्त होंगे। लाभान्वित होने के लिए विभिन्न अवसरों में से विवेक द्वारा उचित अवसर चुनकर श्रम करने से उद्देश्य व सफलता की प्राप्ति होगी। नए संबंधों से आनंद मिलेगा।",
      "negativeEvent": "अपने क्रियाकलापों में हुई गलतियों का निराकरण करने में अथाह श्रम करना पड़ सकता है। उदासीनता के कारण आप उपयुक्त अवसर गंवा सकते हैं। परिश्रम करने के बाद भी सवालों के जवाबों की खोज में बेचैन रहेंगे।"
     },
     {
      "id": 41,
      "name": "फाइव ऑफ कप्स ",
      "description" : "भाग्योदय का समय आ गया है। हर प्रयत्न सफल होगा।",
      "image": "41.jpg",

      "positiveEvent": "इसके प्रभाव से नवनिर्माण की नई संभावनाओं का उदय होगा तथा विकास और समृद्धि होगी। प्रतिफल की इच्छा किए बिना लोगों के लिए कार्य करेंगे तो निराशा से बचे रहेंगे। सचेत होकर हानि के खतरे को समाप्त करने के लिए उपाय खोजें तो उससे होने वाले दुख, अपमान व प्रतिवाद से बच पाने में समर्थ होंगे। अतीत में हुए नुकसान को भूलकर सकारात्मक दृष्टिकोण के साथ आगे बढ़ेंगे तो लाभ होगा।",
      "negativeEvent": "भारी हानि के कारण दुख, अपमान तथा प्रतिवाद का सामना करना पड़ सकता है। अपेक्षित परिणामों की अप्राप्ति तथा उचित प्रतिफल न मिलने के कारण उदास रहेंगे।"
     },
     {
      "id": 42,
      "name": ". सिक्स ऑफ कप्स",
      "description" : "जो कार्य करने जा रहे हैं वह कठिन अवश्य है, परन्तु साहस, धैर्य व आत्मविश्वास के साथ प्रयत्नशील रहें। कार्य कुछ दिन में हो जाएगा।",
      "image": "42.jpg",

      "positiveEvent": "इसके प्रभाव से नए संबंध बनेंगे। अपने अंदर के शिशु को स्वयं पर हावी न होने दें अपितु अधिक समय बच्चों के साथ खेलकर, हंसी-मजाक कर व्यतीत करें। खुद को सकारात्मक रखेंगे तो लाभ होगा। अतीत को भूलकर वर्तमान में जीने की कोशिश करेंगे तो अच्छा होगा।",
      "negativeEvent": "आप अपने उद्देश्यों से भटक सकते हैं। आपमें भ्रष्टता, कड़वाहट और क्रूरता घर बना लेंगी जिसके कारण पुरानी मित्रता से हाथ धोना पड़ेगा तथा दुख का सामना करना पड़ेगा। घरेलू जीवन दुखमय होगा। बच्चों की मृत्यु तक हो सकती है। अतीत में ही खोए रहने के कारण भावनात्मक रूप से क्षति का सामना करना पड़ेगा।"
     },
     {
      "id": 43,
      "name": "सेवन ऑफ कप्स ",
      "description" : "आप अपने भाग्य के स्वयं निर्माता हैं। स्वभाव पर नियंत्रण रखें।",
      "image": "43.jpg",

      "positiveEvent": "इसके प्रभाव से परिस्थितियों व चीजों में संतुलन बनेगा। अच्छे स्वप्न देखें तथा उनको वास्तविक रूप देने के लिए अपनी रचनात्मक ऊर्जा का प्रयोग करें तो अच्छा होगा। एक निश्चित परियोजना का चयन करेंगे तो लाभान्वित होंगे।",
      "negativeEvent": "सपनों और कल्पनाओं में ही जकड़े रहने के कारण आपकी स्थिति स्थिर हो जाएगी, जीवन की सच्चाइयों के प्रति लापरवाही बरतने से मुसीबतों और परेशानियों का सामना करना पड़ेगा।"
     },
     {
      "id": 44,
      "name": "ऐट ऑफ कप्स ",
      "description" : "बार-बार भाग्य से ऊंचे उठते जाएंगे एवं उत्तरकाल में सुख व समृद्धि पाएंगे।",
      "image": "44.jpg",

      "positiveEvent": "विपरीत स्थितियों में धैर्य रखें तो अच्छा होगा। भौतिक, मानसिक व भावनात्मक बलिदानों के लिए जागरूक रहेंगे तो संतुष्टि की प्राप्ति होगी।",
      "negativeEvent": "प्रेम तथा व्यवसाय में अपेक्षित परिणामों की अप्राप्ति के कारण असफलता का सामना करना पड़ेगा।"
     },
     {
      "id": 45,
      "name": "नाइन ऑफ कप्स",
      "description" : "आत्मा से, मन से, निजी अनुभव से बड़ा कोई सलाहकार नहीं है।",
      "image": "45.jpg",

      "positiveEvent": "इसके प्रभाव से आप शारीरिक व मानसिक दोनों स्तरों पर सुखों का उपभोग करेंगे। आपका स्वास्थ्य अच्छा रहेगा। अपेक्षित सफलता तथा भौतिक सुख की प्राप्ति होगी। अभिलाषाओं के पूर्ण होने पर संतुष्टि तथा समृद्धि की प्राप्ति होगी।",
      "negativeEvent": "सांसारिक इच्छाएं अधूरी रहने से निराशा का सामना करना पड़ेगा।"
     },
     {
      "id": 46,
      "name": "टेन ऑफ कप्स ",
      "description" : "वह कार्य जो आप स्वयं कर सकते हैं, दूसरों से करवाने के लिए प्रयास क्यों कर रहे हैं।",
      "image": "46.jpg",

      "positiveEvent": "इसके प्रभाव से आप कुछ नए रिश्तों के संपर्क में आएंगे जो भविष्य में लंबे समय तक साथ देंगे व संतुष्टि प्रदान करेंगे। खुशी, आनंद और संतोष से जीवन समृद्ध होगा। मित्र, शुभचिंतक और रिश्तेदारों के साथ होने से समय आनंदपूर्वक व्यतीत होगा। पारिवारिक जीवन अच्छा रहेगा।",
      "negativeEvent": "परिवार में झगड़ा होने से माता-पिता से विमुखता हो सकती है। मित्रों के साथ संबंध खराब हो सकते हैं।"
     },
     {
      "id": 47,
      "name": "पेज ऑफ कप्स ",
      "description" : "व्यर्थ का जोखिम उठाना ठीक नहीं।",
      "image": "47.jpg",

      "positiveEvent": "इसके प्रभाव से आप कठिन स्थिति से उबरकर सुखद जीवन व्यतीत कर सकेंगे। व्यवसाय में किसी नई परियोजना जीवन में नए संबंध की तथा परिवार में नए जन्म का योग बनेगा। आध्यात्मिक यात्रा पर भी जाना हो सकता है।",
      "negativeEvent": "अपरिपक्वता के कारण भावनात्मक कठिनाइयों का सामना करना पड़ेगा। भावनात्मक रूप से असुरक्षित तथा स्वस्थ संबंध कायम करने में असमर्थ होंगे। रिश्तों में उचित प्रतिफल न मिलने के कारण अपनी ही दुनिया में रहेंगे।"
     },
     {
      "id": 48,
      "name": "नाइट ऑफ कप्स ",
      "description" : "दुर्दिनों का अंत आ चुका है। अब शंका का कोई स्थान नहीं है। जीवन में सबकुछ प्राप्त कर लेंगे।",
      "image": "48.jpg",

      "positiveEvent": "इसके प्रभाव से आप अपनी भावनाओं पर पूर्णतया नियंत्रण रखने में सक्षम होंगे। किसी नई वस्तु का आगमन होगा तथा नए-नए निमंत्रण प्राप्त होंगे। दिमाग से अधिक तथा दिल से कम काम लें तो अच्छा होगा। मिलनसार होने के कारण नए लोगों का जीवन में आगमन होगा। जीवन में सकारात्मक परिवर्तन होने से अपने उद्देश्य की प्राप्ति कर सकेंगे।",
      "negativeEvent": "दिल से अधिक तथा दिमाग से कम सोचने के कारण हानि होगी। तथ्यों को एकत्र किए बिना निर्णय करने के कारण वे गलत साबित होंगे।"
     },
     {
      "id": 49,
      "name": "क्वीन ऑफ कप्स ",
      "description" : "अपने विचारों पर दृढ़ रहें, बार-बार धारणा बदलें नहीं, इसी से आप सफल होंगे।",
      "image": "49.jpg",

      "positiveEvent": "आपका व्यक्तित्व आकर्षक है और ईमानदारी और निष्कपटता के लिए आपकी प्रशंसा होगी। मित्रतापूर्ण व्यवहार होने के कारण मित्रों का आधिक्य रहेगा। इसके प्रभाव से आप अपनी भावनाओं के प्रति जागरूक होंगे तथा आपमें प्रेमभाव का उदय होने से प्रेम का वातावरण बनेगा। अपनी विशेष ऊर्जा का उपयोग करेंगे तो लाभान्वित होंगे। अपने अंतर्मन की आवाज सुनेंगे तो लाभ होगा। लोगों के कल्याण के लिए प्रयासरत रहेंगे।",
      "negativeEvent": "संदेहपूर्ण व्यक्तित्व, चिड़चिड़ा स्वभाव, स्वार्थपरता, क्रोधी तथा स्वभाव में कठोरता होने के कारण मित्र नहीं बनेंगे। दूसरों को चोट पहुंचाने से आपको आनंद की प्राप्ति होगी। दुर्गा मंत्र- या देवी सर्वभूतेषु शक्ति-रूपेण संस्थिता। नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः॥ "
     },
     {
      "id": 50,
      "name": "किंग ऑफ कप्स ",
      "description" : "उद्यमी बनें, माया-कल्पना लोक में विचरण करने से जीवन नहीं चलता।",
      "image": "50.jpg",

      "positiveEvent": "इसके प्रभाव से आप आने वाली समस्याओं का मजबूती, तीव्रता, निष्ठा और समग्रता से सामना करेंगे। संकट में शांति तथा धैर्य व ताकत की जगत नीति से काम लेंगे तो अच्छा होगा। दूसरों की सहायता को तत्पर रहेंगे। अपनी विशेष ऊर्जा का उपयोग करेंगे तो लाभान्वित होंगे। अपनी भावनाओं और विवेक के बीच संतुलन स्थापित करने में सक्षम होंगे।",
      "negativeEvent": "संवेदनहीन, कल्पनारहित, चालबाज तथा आक्रामक प्रवृत्ति होने के कारण दूसरों की भावनाओं को खेलने में आनंद का अनुभव होगा। संकट में ताकत से काम लेने के कारण क्षति होगी।"
     },
     {
      "id": 51,
      "name": "ऐस ऑफ पैन्टाकल्स ",
      "description" : "किसी काम में या बात में हस्तक्षेप करने से पूर्व अपने आधार को ठीक बना लें।",
      "image": "65.jpg",

      "positiveEvent": "इसके प्रभाव से आप अपनी ऊर्जा का प्रयोग कर सपनों को पूर्ण करने में सफल होंगे। नए उपक्रम की की शुरुआत के लिए यह उपयुक्त समय है। अंतर्मन केन्द्रित होने के कारण सफलता, संपदा तथा सुख प्राप्त होगा।",
      "negativeEvent": "भ्रष्टाचार और लालच के कारण हानि का सामना करना पड़ेगा।"
     },
     {
      "id": 52,
      "name": "टू ऑफ पैन्टाकल्स ",
      "description" : "ईमानदारी का दामन छोड़ा नहीं कि पतन के अंधकूप में गिरे नहीं, ईमानदार बने रहिए।",
      "image": "66.jpg",

      "positiveEvent": "इसके प्रभाव से आप एक नई ऊर्जा तथा जीवंतता का अनुभव करेंगे। स्वयं पर भरोसा कर चुनौतियों को स्वीकार करेंगे तो उद्देश्य की प्राप्ति होगी। अपने स्वभाव को कोमल, मृदु व लचीला बनाएं तो सफलता आपके कदम चूमेगी। एक ही काम पर केंद्रित होकर कार्य करेंगे तो सफल होंगे।",
      "negativeEvent": "बलपूवूर्वक बात को मनवाने में असफल होंगे। आत्मविश्वास की कमी के कारण परेशानियों और कठिनाइयों का सामना करना पड़ेगा तथा असफलता मिलेगी"
     },
     {
      "id": 53,
      "name": "श्री ऑफ पैन्टाकल्स ",
      "description" : "कुछ समय के लिए क्रांति का तूफान उठखड़ा होगा पर अंत में आप ही सफल होंगे। शांति व वैभव फिर लौट आएगा।",
      "image": "67.jpg",

      "positiveEvent": "इसके प्रभाव से नई योजना का प्रारंभ अच्छा रहेगा। लगातार परिश्रम, दृढ़ता, निश्चय और प्रयत्न करने से अपने सपनों को पूर्ण करने में सफल होंगे। भागीदारी में व्यवसाय करने से लाभ प्राप्त होगा। आवश्यकता पड़ने पर किसी विवेकशील व्यक्ति की सहायता लें तो अच्छा होगा। संतुष्टि प्रदान करने वाले कार्य करेंगे तो आपके अनुकूल होगा।",
      "negativeEvent": "अनुशासनहीनता के कारण हानि होगी तथा उपहास के पात्र बनेंगे। पहला मंत्र : क्लेशनाशक मंत्र : कृष्णाय वासुदेवाय हरये परमात्मने। प्रणत क्लेशनाशाय गोविन्दाय नमो नम:॥  मंत्र प्रभाव : इस मंत्र का नित्य जप करने से कलह और क्लेशों का अंत होकर परिवार में खुशियां वापस लौट आती हैं। "
     },
     {
      "id": 54,
      "name": "फोर ऑफ पैन्टाकल्स ",
      "description" : "ऐसे कार्य को चुनें जो केवल आपके ऊपर निर्भर हो।",
      "image": "68.jpg",

      "positiveEvent": "इसके प्रभाव से निवेश किए हुए स्थानों से लाभ प्राप्त होने के कारण आपकी वित्तीय स्थिति सुदृढ़ रहेगी। स्थितियों पर नियन्त्रण करने की कोशिश न करके उनके अनुसार ही चलें तो अच्छा होगा। अपने संकुचित दायरे को बढ़ाकर दूसरों से सुख-दुख बांटेंगे तो आपके अनुकूल होगा।",
      "negativeEvent": "दूसरों से ईर्ष्या भाव के कारण परेशानी का सामना करना पड़ेगा। कंजूस, लालची तथा अपने ही विकास को अहमियत देने के कारण मित्रों की संख्या कम होगी।"
     },
     {
      "id": 55,
      "name": "फाइव ऑफ पैन्टाकल्स ",
      "description" : "अभी समय प्रतिकूल है। हताश होने कीआवश्यकता नहीं, भाग्य को पलटते समय नहीं लगता। अभीष्ट कार्य में जुटे रहें।",
      "image": "69.jpg",

      "positiveEvent": "इसके प्रभाव से कठिन समय का अंत होगा तथा आपको आत्मविश्वास की प्राप्ति होगी। धन के प्रति अपना संकुचित दृष्टिकोण बदलेंगे तो अच्छा होगा। अपनी आत्मिक शक्ति का उपयोग करें तो समस्याओं से निपटकर सफलता प्राप्त करेंगे।",
      "negativeEvent": "कठिनाइयों तथा मतभेदों के कारण कैरियर में क्षति हो सकती है। व्यक्तिगत, भौतिक व मानसिक क्षति का सामना करना पड़ेगा। वित्तीय संकटों के कारण परेशानियों का सामना करना पड़ेगा। स्वास्थ्य खराब रहेगा।"
     },
     {
      "id": 56,
      "name": "सिक्स ऑफ पैन्टाकल्स ",
      "description" : "भूलकर भी बुरे व अशुभ कार्य में पैसा न फंसाएं अन्यथा पछताएंगे।",
      "image": "70.jpg",

      "positiveEvent": "इसके प्रभाव से आपको वह सब प्राप्त होगा जिसके आप अधिकारी हैं। निवेश किए हुए धन से लाभ की प्राप्ति होगी।",
      "negativeEvent": "धन का अधिक लेन-देन अधिक करने के कारण धन संबंधी समस्याएं आएंगी।"
     },
     {
      "id": 57,
      "name": "सेवन ऑफ पैन्टाकल्स ",
      "description" : "आपने जो स्वप्न सोचा है, उचित एवं शुभ है। जिस कार्य में लगे हैं या प्रयत्न कर रहे हैं वह फलेगा फूलेगा। फिर भी सतर्क रहना अनिवार्य है।",
      "image": "71.jpg",

      "positiveEvent": "इसके प्रभाव से आपमें एक नई शक्ति का संचार होगा तथा आप कठिनाइयों से लड़ने के लिए पुनः तैयार हो जाएंगे। समय का सदुपयोग तथा प्रयास करके उद्यम में सफलता मिलेगी। अपनी इच्छाओं और निराशा पर काबू रखें तो अच्छा होगा। अपने विरोधियों का दमन करने में सफल होंगे। वर्तमान पर केंद्रित रहेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "व्यवसाय, वित्तीय स्थिति तथा इच्छाओं की पूर्ति न हो पाने के कारण निराशा का सामना करना पड़ेगा। कार्यों में विलंब के कारण असफलता का मुंह देखना पड़ेगा।"
     },
     {
      "id": 58,
      "name": "ऐट ऑफ पैन्टाकल्स",
      "description" : "आप छोटी-छोटी बातों को तूल न दें, कुंठा नहीं पालें।",
      "image": "72.jpg",

      "positiveEvent": "इसके प्रभाव से शिक्षा या वित्तीय क्षेत्र में एक नया अनुभव होगा तथा निवेशित ऊर्जा का प्रतिफल मिलेगा। व्यक्तिगत निवेश से लाभ की प्राप्ति होगी। दूसरों के सहयोग व उदारता से सफलता की प्राप्ति होगी। अपने उद्देश्यों को प्राप्त करने के लिए यह सबसे उपयुक्त समय है। एक ही कार्य पर केंद्रित होकर कार्य करें तो लाभान्वित होंगे। अपनी क्षमता के अनुसार ही कार्य करेंगे तो अच्छा होगा।",
      "negativeEvent": "अधिक जोखिम उठाने से हानि का सामना करना पड़ सकता है। अपनी क्षमता से अधिक कार्य घातक सिद्ध हो सकता है।"
     },
     {
      "id": 59,
      "name": "नाइन ऑफ पैन्टाकल्स ",
      "description" : "उसे अभागा ही कहेंगे, जो दूसरों का आश्रय ढूंढ़ता है या दूसरों की मैत्री या सहायता की याचना करता है।",
      "image": "73.jpg",

      "positiveEvent": "इसके प्रभाव से आपमें आत्मविश्वास और आत्मनिर्भरता का विकास होगा, जिससे सुखी जीवन की प्राप्ति होगी। आत्म अनुशासन और धैर्यपूर्वक कार्य करेंगे तो सभी कार्यों को पूर्ण कर सकेंगे।",
      "negativeEvent": "बुद्धिहीन निर्णय तथा मूर्खतापूर्ण कार्यों के कारण वित्तीय संकटों का सामना करना पड़ेगा।"
     },
     {
      "id": 60,
      "name": "टेन ऑफ पैन्टाकल्स ",
      "description" : "मनुष्य को पहचानने की क्षमता रखें, जो समय-समय पर धोखा देते हैं, षडयंत्र रचते हैं, उनसे सावधान रहें।",
      "image": "74.jpg",

      "positiveEvent": "इसके प्रभाव से संपन्नता और संरक्षणता के द्वारा आप अपना भाग्य स्वयं बनाने में सक्षम होंगे। पारिवारिक जीवन में खुशी की प्राप्ति होगी। अच्छी जगहों पर निवेश करेंगे तो लाभान्वित होंगे।",
      "negativeEvent": "संसाधनों के अभाव के कारण वित्तीय स्तर पर असफलता तथा क्षति का सामना करना पड़ेगा। निवेश में समस्याओं से सामना होगा। परिवार में धन के अभाव को लेकर मनमुटाव होगा। गलत तरीकों से धन कमाने की चेष्टा करेंगे"
     },
     {
      "id": 61,
      "name": "पेज ऑफ पैन्टाकल्स ",
      "description" : "भावुकता को छोड़कर दूरदृष्टि से काम लें। सूझ-बूझ से व अपनी अंतरात्मा की आवाज पर कार्य करें, अवश्य सफल होंगे।",
      "image": "75.jpg",

      "positiveEvent": "इसके प्रभाव से आप सभी कार्य पूर्ण समर्पण के साथ करेंगे तथा सफलता हासिल करेंगे। व्यावसायिक उपक्रम या शिक्षा संबंधी नई शुरुआत के योग बनेंगे। ज्ञान प्राप्त करने के लिए सदा समर्पित रहेंगे। अपने हितों के प्रति केंद्रित होने के कारण लाभान्वित होंगे। स्वप्नों को छोड़ वर्तमान में जीना सीखें तो आपके अनुकूल होगा। ",
      "negativeEvent": "स्वप्नों की दुनिया में रहने के कारण वर्तमान में समस्याएं आएंगी।"
     },
     {
      "id": 62,
      "name": "नाइन ऑफ पैन्टाकल्स",
      "description" : "आप दृढ़ निश्चयी बनें। निराश व्यक्ति तो यों भी मरा हुआ होता है। निराशावादी की सहायता ईश्वर भी नहीं करते।",
      "image": "76.jpg",

      "positiveEvent": "दूसरों के प्रभाव से आप शुरू किए कार्यों को पूर्ण करके ही दम लेंगे। दूसरों की सहायता के लिए हमेशा तत्पर रहेंगे। आप परिश्रमी, कार्य के प्रति समर्पित, विवेक तथा समय का सदुपयोग करने वाले व्यक्ति हैं। धैर्य के साथ कार्यों को पूर्ण करेंगे तो अच्छा होगा।",
      "negativeEvent": "कठोर, सनकी तथा अड़ियल होने के कारण आपका दृष्टिकोण हमेशा अंधकारपूर्ण रहेगा। परिवर्तन और खतरों का सामना न करने के कारण क्षति का सामना करना पड़ेगा।"
     },
     {
      "id": 63,
      "name": "क्वीन ऑफ पैन्टाकल्स",
      "description" : "आप अपने आपमें आदर्श गुण पैदा करें, धन-वैभव खुद चलकर आएगा।",
      "image": "77.jpg",

      "positiveEvent": "इसके प्रभाव से आपको वित्तीय तथा भौतिक संरक्षण की प्राप्ति होगी। नई उदित ऊर्जा से आपका संपूर्ण विकास, उन्नति और महत्वाकांक्षाओं की पूर्ति होगी। संवेदनशील तथा व्यावहारिक व्यक्तित्व होने के कारण मित्रों की अधिकता होगी। आप वफादार, दृढ़ निश्चयी तथा भरोसोमंद व्यक्ति हैं तथा लोग आप पर विश्वास करेंगे। सुख-दुख में कष्ट बांटने वालों की अधिकता रहेगी। आप एक जोशीले तथा बहुमुखी प्रतिभाओं वाले व्यक्ति हैं।",
      "negativeEvent": "नकारात्मक घटनाएं आस-पास के वातावरण से सामंजस्य बैठाने में आपको कठिनाई होगी। आत्मविश्वास की कमी तथा लोगों से मिलने के संकोच के कारण मित्रों का अभाव रहेगा।"
     },
     {
      "id": 64,
      "name": "किंग ऑफ पैन्टाकल्स ",
      "description" : "अब आपके अच्छे दिन आने वाले हैं।",
      "image": "78.jpg",

      "positiveEvent": "इसके प्रभाव से आपकी वित्तीय स्थिति मजबूत होगी तथा सभी इच्छाओं की पूर्ति होगी। नए व्यवसाय के द्वारा धन अर्जित करेंगे। सभी कार्यों को निष्ठा, पूर्णता, समर्पण, एकाग्रता तथा जिम्मेदारी से करेंगे तभी सफलता हासिल होगी। आप धैर्यशील, लोगों को प्रोत्साहित करने वाले व उनकी सहायता करने वाले, मेहनती तथा ईमानदार व्यक्ति हैं जिसके कारण आपको सभी उद्यमों में सफलता की प्राप्ति होगी।",
      "negativeEvent": "आप पैसों के लिए नीच से नीच काम करने को भी तत्पर रहेंगे। हमेशा दूसरों को ठगने की सोच रखेंगे। हमेशा घमंड में रहेंगे तथा लोगों से सहायता की अपेक्षा करेंगे।"
     },
     {
      "id": 65,
      "name": "ऐस ऑफ सोर्ड्स",
      "description" : "सफलता कुछ देर से मिलेगी परन्तु अवश्य प्राप्त होगी। अपना कार्य करते रहें, अवश्य पूर्ण होगा।",
      "image": "51.jpg",

      "positiveEvent": "प्रत्येक चुनौती एक अवसर लिए हुए होगी, अतः चुनौती का डटकर और पूरी ईमानदारी से सामना करें। समस्या पर गंभीर विचार-विमर्श करके उसके समाधान में अपनी आंतरिक शक्तियों का इस्तेमाल करेंगे तो लाभ होगा। तथ्यों को ढूंढ़कर, स्थिति का विश्लेषण कर, अपनी बुद्धिमत्ता और तर्क का प्रयोग कर मार्ग को अंत तक कायम रखेंगे तो सफलता की प्राप्ति होगी। ",
      "negativeEvent": "स्वास्थ्य खराब होने के कारण ऑपरेशन हो सकता है। समस्याओं का समाधान करने में ताकत का इस्तेमाल करने से हानि होगी। विचारों को मूर्त रूप प्रदान करने के लिए संघर्ष करना पड़ेगा। "
     },
     {
      "id": 66,
      "name": "टू ऑफ सोर्ड्स ",
      "description" : "बुरे दिन हैं, तो घबराना कैसा ! रात के बाद दिनआता ही है। आशावादी बनें।",
      "image": "52.jpg",

      "positiveEvent": "इसके प्रभाव से आपको जीवन में संतुलन की प्राप्ति होगी। शांतिपूर्वक समस्याओं का समाधान करेंगे तो अच्छा फल मिलेगा। स्थितियों से समझौता करेंगे तो अच्छा होगा।",
      "negativeEvent": "सत्य से विमुख होकर कार्य करने पर अवरोध उत्पन्न होंगे।"
     },
     {
      "id": 67,
      "name": "थ्री ऑफ सोर्ड्स",
      "description" : "अकस्मात संपत्ति आने का योग है।",
      "image": "53.jpg",

      "positiveEvent": "धैर्य और विवेक स्थितियों के सुधरने में सहायक होंगे। अंतर्मन की आवाज सुनेंगे तो समस्याओं के समाधान खोज पाने में सफल होंगे। दूसरों को चोट पहुंचाने की आदत को त्यागने से लाभ मिलेगा। नई परियोजनाओं को स्थगित करेंगे तो लाभ होगा।",
      "negativeEvent": "आपकी लापरवाही के कारण विरोध और विलंब उत्पन्न होंगे। दूसरों को दुख देने के कारण स्वयं भी गहरे दुख, हानि व शोक का सामना करना पड़ेगा।"
     },
     {
      "id": 68,
      "name": "फोर ऑफ सोर्ड्स",
      "description" : "परिश्रम करें, सफलता चलकर पास आएगी। यही प्रसन्नता का मूल-मंत्र है।",
      "image": "54.jpg",

      "positiveEvent": "कार्य में सामंजस्य स्थापित करके आराम की ओर ध्यान देंगे तो स्वास्थ्य बेहतर होगा। दर्द, संघर्ष और घबराहट से मुक्त होकर, स्वयं को ऊर्जावान बनाकर जीवन की लड़ाई लड़ेंगे तो जीत आपकी होगी। तनाव और चिंताओं से दूर रहने तथा अपने मन को मजबूत बनाने के लिए साधना या मेडीटेशन करना अच्छा फल देगा। स्वास्थ्य को बनाए रखने के लिए खाने-पीने की ओर ध्यान देना लाभकारी होगा।",
      "negativeEvent": "अधिक कार्य करने के कारण बीमारी से ग्रस्त हो सकते हैं।"
     },
     {
      "id": 69,
      "name": "फाइव ऑफ सोर्ड्स ",
      "description" : "अपने आपको धोखा देना उचित नहीं है। अन्यायपूर्ण कार्य करके अपनी प्रतिष्ठा को क्यों दांव पर लगा रहे हैं।",
      "image": "55.jpg",

      "positiveEvent": "शत्रु आप पर भारी होंगे परन्तु जीत आपकी होगी अपने संघर्ष के प्रति आक्रमक रहेगे तो उददेश्य को शीघ्र प्राप्त कर लेगे। महत्वकांक्षाओं को सीमित रूप देंगे तो अच्छा होगा लोगों को अपना लाभ उठाने न दे तथा उनका मुकाबला करे।",
      "negativeEvent": "घमंड के कारण हानि होगी। महत्वाकांक्षाएं अधिक होने के कारण अपूर्ण हेंगी, परिणामस्वरूप हताशा होगी। संकुचित दृष्टिकोण होने के कारण अकेले, एकाकी रूप से ही आगे बढ़ने के प्रयास में निराशा होगी।"
     },
     {
      "id": 70,
      "name": "सिक्स ऑफ सोर्ड्स",
      "description" : "आशा का अवलंब छोड़ना कहां की बुद्धिमानी है। जो कुछ अशुभ या प्रतिकूल हो रहा है, उसे सहन करने का प्रयत्न करें। आगे के लिए सावधान हो जाएं।",
      "image": "56.jpg",

      "positiveEvent": "इसके प्रभाव से लंबे संघर्ष के बाद शांति और आराम प्राप्त होगा। यात्राओं के अवसर प्राप्त होंगे। अपनी ऊर्जा को सकारात्मक कार्यों में व्यय करें तो अच्छा फल मिलेगा। संबंधों, भागीदारी तथा संपत्ति से संबंधित समस्याओं को हल करने का यह उचित अवसर है। सभी कुछ आपके अनुकूल होगा तथा आप सुरक्षा का अनुभव करेंगे।",
      "negativeEvent": "जीवन में बार-बार उदासीनता तथा निरुत्साह का सामना करना पड़ेगा। जीवन में छोटे-मोटे अवसादों से सामना होता रहेगा। समस्याओं के समाधान मिलने में विलंब होगा।"
     },
     {
      "id": 71,
      "name": "सेवन ऑफ सोर्ड्स ",
      "description" : "बिना सोचे-विचारे कोई परिवर्तन न करें, वर्तमान परिस्थितियों में जो उचित है, देखभाल कर वही करें।",
      "image": "57.jpg",

      "positiveEvent": "इसके प्रभाव से आपको आवश्यकता से अधिक प्रतिफल की प्राप्ति होगी। आपकी खोई हुई या चोरी हुई वस्तु वापस मिल सकती है। मनोवांछित इच्छाओं की पूर्ति होगी। आप अकेले ही खोज, अनुसंधान व समस्याओं को अपनी समझ से प्राप्त करने में सफल होंगे। विफलताओं के आने पर भी आत्मविश्वास को कायम रखकर आगे बढ़ेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "बेईमानी का सहारा लेकर अपने लालच की प्रतिपूर्ति करेंगे।"
     },
     {
      "id": 72,
      "name": "ऐट ऑफ सोर्ड्स ",
      "description" : "वह समय शीघ्र आने वाला है, जब आपके आचरण की यत्र-तत्र आलोचना होगी। समय रहते संभल जाएं तो अच्छा होगा।",
      "image": "58.jpg",

      "positiveEvent": "समस्याओं में धैर्य और साहस से काम लेंगे तो अच्छा होगा। अवरोध उत्पन्न होने पर स्थितियों का दमन करेंगे तो अच्छा फल मिलेगा।",
      "negativeEvent": "दूसरे लोगों के द्वारा आपके उद्देश्य के मार्ग में अवरोध उत्पन्न करने से सफलता नहीं मिलेगी तथा निराशा का सामना करना पड़ेगा। घमंड के कारण हानि होगी।"
     },
     {
      "id": 73,
      "name": "नाइन ऑफ सोर्ड्स ",
      "description" : "अपने मन के भ्रम को दूर करके ईश्वर के आशीर्वाद से संपन्नता प्राप्त करने वाले हैं।",
      "image": "59.jpg",

      "positiveEvent": "इसके प्रभाव से लंबे अवसाद के बाद आपकी सभी इच्छाएं पूर्ण होंगी। अपने दिल को मजबूत कर स्थाई रूप से घर किए हुए डर और भय का सामना कर पाएंगे। जीवन की बदलती हुई परिस्थितियों में नकारात्मक भावनाओं को स्वयं पर हावी न होने दें तथा अपने उद्देश्य की ओर बढ़ते रहें तो अच्छा होगा।",
      "negativeEvent": "अशक्तता, संघर्ष, दूसरों के काम में हस्तक्षेप, झूठ, धोखाधड़ी, बेईमानी, भय, डरावने स्वप्न, अवसाद, अप्रसन्नता, शत्रुओं द्वारा हानि ।                                                                                                                                                                                      "
     },
     {
      "id": 74,
      "name": "टेन ऑफ सोर्ड्स ",
      "description" : "असंभव को संभव बनाने का प्रयास न करें। असाध्य को साधने का प्रयास व्यर्थ है।",
      "image": "60.jpg",

      "positiveEvent": "इसके प्रभाव से कोई पुराना मुद्दा समाप्त होगा जिससे निपटना कठिन था। अतीत को भूलकर वर्तमान में जीने की कोशिश करेंगे तो अच्छा होगा। अपने भय को पहचानकर उसका शमन करेंगे तो अच्छा होगा।",
      "negativeEvent": "सही निर्णय लेने के लिए संघर्ष का सामना करना होगा। विपरीत परिस्थितियों के चलते क्षति उठानी पड़ सकती है।"
     },
     {
      "id":75,                                                                                                                          
      "name": "पेज ऑफ सोर्ड्स ",                                                      
      "description" : "कहीं यश व धन की भूख मिटाने के लिए आप निर्दयतापूर्वक कार्य करना प्रारंभ न कर दें, इसका ध्यान रखें।",
      "image": "61.jpg",

      "positiveEvent": "इसके प्रभाव से आपकी निराशाएं आनंद में बदल जाएंगी। व्यवसाय और प्रेम संबंधों में सहयोग की प्राप्ति होगी। चुनौती के रूप में आने वाले अवसर को स्वीकार करेंगे तो जीत की प्राप्ति होगी। अपनी अधीरता पर नियन्त्रण रखेंगे तो अच्छा फल प्राप्त होगा।",
      "negativeEvent": "अपनी अधीरता के कारण कई आश्चर्यजनक परिस्थितियों का सामना करना पड़ेगा। कोई भी अच्छी शुरुआत बाद में कष्टकारी हो सकती है।"
     },
     {
      "id": 76,
      "name": "नाइट ऑफ सोर्ड्स",
      "description" : "मन की चंचलता के कारण आप अपनी बातें सोचते रहते हैं। चंचलता व व्यग्रता त्यागकर एक-एक कार्य करने का प्रयास करें, अपेक्षित सफलता मिलेगी।",
      "image": "62.jpg",

      "positiveEvent": "इसके प्रभाव से आपकी दिमागी, शारीरिक, भावनात्मक व आध्यात्मिक सभी प्रकार की समस्याओं का अंत होगा। आप ज्ञानी, स्पष्टवक्ता तथा अनंत संभावनाओं वाले व्यक्तित्व के स्वामी हैं, अतः समस्याओं के समाधान आप शीघ्र ही खोज लेंगे। अपने तर्क, विवेक और ज्ञान के कारण आप सभी पर हावी रहेंगे। साहसी होने के कारण अपने सभी उपक्रम सफलतापूर्वक चलाने में सक्षम होंगे। कोई भी नई परियोजना शुरू करने के लिए यह अच्छा समय है।",
      "negativeEvent": "आप कड़वे सच को भी स्पष्ट तथा अधिकारपूर्ण तरीके से कहते हैं जिसके कारण शत्रु अधिक होंगे। ताकत और ऊर्जा का दुरुपयोग करने के कारण क्षति होगी। स्वार्थपरता के कारण दूसरों की खुशी को बर्बाद करने की इच्छा जागृत होगी।"
     },
     {
      "id": 77,
      "name": "क्वीन ऑफ सोर्ड्स ",
      "description" : "धैर्य धारण किए रहें। आपकी चीज आपको मिल जाएगी।",
      "image": "63.jpg",

      "positiveEvent": "ईमानदार और जिम्मेदार होने के कारण सभी आप पर भरोसा करेंगे। आपको कोई आसानी से मूर्ख नहीं बना सकता। आप स्पष्टवादी तथा मजाकिया किस्म के व्यक्ति हैं। परन्तु किसी को आपके शब्दों से चोट नहीं पहुंचती। मिलनसार होने के कारण मित्रों की अधिकता होगी। आपको बहुमुखी प्रतिभा का लाभ मिलेगा।",
      "negativeEvent": "आपकी प्रकृति सख्त होगी तथा आप भावनाओं और संवेदनाओं से रिक्त व्यक्ति हैं।"
     },
     {
      "id": 78,
      "name": "किंग ऑफ सोर्ड्स",
      "description" : "आपने अत्यधिक कष्ट सहे हैं। अब भाग्योदय का समय आ गया है। सुख-शांति का वातावरण बनेगा। लक्ष्मी की प्राप्ति होगी।",
      "image": "64.jpg",

      "positiveEvent": "इसके प्रभाव से अपनी शक्ति और साहस से सभी इच्छाओं की प्राप्ति कर सकेंगे। तर्क और बुद्धि से सभी समस्याओं का समाधान प्राप्त करने में सफल होंगे तथा आगे बढ़ेंगे। ईमानदारी और न्याय के मार्ग पर चलने के कारण जन-संपर्क पर्याप्त रहेगा।",
      "negativeEvent": "अविश्वास, झगड़ों, कड़वाहट तथा संवेदनहीनता के कारण भावनात्मक कष्ट का सामना करना पड़ेगा।"
     }
  ]
  