import React, { useState } from 'react';
import { View, Text, TouchableOpacity, StyleSheet, Image, ScrollView } from 'react-native';
import { Picker } from '@react-native-picker/picker'; // Updated import
import * as Speech from 'expo-speech'; // Importing expo-speech
import CustomBottomNavbar from '@/components/BottomNavbar';

// Sample JSON data
const data = {
    "गणेश जी "  :{
        "title" : "श्री गणेश जी ",
        "image" : "https://img.freepik.com/free-photo/image-3d-ganesha-dark-background-diwali_125540-3629.jpg",
        "story" : "जय गणेश, जय गणेश, जय गणेश देवा।  माता जाकी पार्वती, पिता महादेवा ।। जय गणेश एकदन्त दयावन्त, चार भुजा धारी। माथे सिन्दूर सोहे, मूसे की सवारी ।। जय गणेश अन्धन को आँख देत, कोढ़िन को काया।  बाँझन को पुत्र देत, निर्धन को माया ।। जय गणेश हार चढ़े, फूल चढ़े और चढ़े मेवा। लड्डुवन का भोग लगे, सन्त करे सेवा ।। जय गणेश जय गणेश जय गणेश जय गणेश देवा। माता जाकी पार्वती, पिता महादेवा ।। "
    },
     " श्री लक्ष्मी जी " : {
     "title" : " श्री लक्ष्मी जी ",
     "image" : "https://static.vecteezy.com/system/resources/previews/023/141/162/large_2x/maha-lakshmi-images-download-mah-laxmi-goddess-on-lotus-images-generative-ai-photo.jpeg",
     "story" : "ॐ जय लक्ष्मी माता, मैया जय लक्ष्मी माता। तुमको निसिदिन सेवत, हर-विष्णु-धाता ।। ऊँ जय.. उमा, रमा, ब्रह्माणी, तुम ही जग-माता। सूर्य-चन्द्रमा ध्यावत, नारद ऋषि गाता ।। ऊँ जय.... दुर्गारूप निरंजनि सुख-सम्पत्ति-दाता। जो कोई तुमको ध्याता, ऋद्धि-सिद्धि-धन पाता।। ऊँ जय...... तुम पाताल-निवासिनि, तुम ही शुभ दाता। कर्म प्रभाव-प्रकाशिनी, भवनिधि की त्राता ।। ऊँ जय...... जिस घर में तुम रहतीं, तहँ सब सद्‌गुण आता। सब सम्भव हो जाता, मन नहीं घबराता ।। ॐ जय...... तुम बिन यज्ञ न होते, वस्त्र न कोई पाता। खान-पान का वैभव, सब तुम से आता ।। ऊँ जय.... शुभ-गुण-मन्दिर सुन्दर, क्षीरोदधि-जाता। रत्न चतुर्दश तुम बिन, कोई नहिं पाता।। ॐ जय महालक्ष्मीजी की आरती, जो कोई नर गाता। उर आनन्द समाता, पाप उतर जाता।। ऊँ जय... "
     },
     " माँ भगवती जी" : {
        "title" : "माँ भगवती जी ",
        "image" : "https://img.freepik.com/premium-photo/illustration-bhagwati-mata-colour-full-image-real_756405-51404.jpg",
        "story" : "आरति माँ दुर्गे की गावें। चरण कमल में शीश नवावें। दिव्य प्रभा माँ जग की माया, यह सब जग तेरी द्युतिछाया, कण-कण में माँ की छवि पावें। आरति माँ दुर्गे की गावें। माँ के मस्तक मुकुट विराजे, माँग सिंदुर भाल शशि साजे, रक्ताम्बर पट पर बलि जावें। आरति माँ दुर्गे की गावें। कर त्रिशूल केहरि पर सोहें, दुष्ट डरें मुनिजन मन मोहें, मात उमा के चरण गहावें। आरति माँ दुर्गे की गावें। अष्टभुजा माँ खप्पर वाली, दुर्गा जया त्रिनेत्रा काली, कितने माँ के नाम गिनावें। आरति माँ दुर्गे की गावें। ब्रह्माणी रुद्राणी कमला, आगम निगम बखानी विमला, सरस्वती माँ को सिर नावें। आरति माँ दुर्गे की गावें। शुभ-निशुंभ-महिष को मारा, चण्ड-मुण्ड धूम्राक्ष सँहारा, कितने माँ के सुयश सुनावें। आरति माँ दुर्गे की गावें। पट्टाम्बर परिधान निराले, गल मोतियन की माला डाले। नूपुर धुनि सुन-सुन हर्षावें। आरति माँ दुर्गे की गावें।  भैरव योगिनी गुण-गण गावें, डमरू ताल मृदंग बजावें। हम भी उस धुन में रम जावें। आरति माँ दुर्गे की गावें। शाकम्भरी वैष्णवी माता, उत्पादक पालक गति दाता, धूप दीप गन्धादि चढ़ावें। आरति माँ दुर्गे की गावें। भव बाधा से त्राण करो माँ, मंगलमय 'कल्याण' करो माँ, करें आरती ध्यान लगावें। आरति माँ दुर्गे की गावें। "
      },
      "श्री संतोषी माताजी " : {
        "title" : "श्री संतोषी माताजी ",
        "image" : "https://5.imimg.com/data5/SELLER/Default/2022/1/CU/VR/DY/63727036/marble-santoshi-maa-statue-santoshi-mata-murti-size-2-5fit.jpg",
        "story" : "जय सन्तोषी माता, मैया जय सन्तोषी माता अपने सेवक जन की सुख सम्पत्ति दाता ।। जय.. सुन्दर चीर सुनहरी, माँ धारण कीन्हों हीरा पन्ना दमके, मन शृंगार लीन्हों ।। जय..  गेरू लाल छटा छवि, बदन कमल सोहे मंद हँसत करुणामयी, त्रिभुवन मन मोहे ।। जय. स्वर्ण सिंहासन बैठी, चॅवर दुरें प्यारे धूप, दीप, मधु मेवा, भोग धरें न्यारे ।। जय..  गुड़ अरु चना परम प्रिय, तामें सन्तोष कियो सन्तोषी कहलाई, भक्तन वैभव दियो ।। जय..... शुक्रवार प्रिय मानत, आज दिवस सोही भक्त मण्डली छाई, कथा सुनत मोही ।। जय........ मन्दिर जगमग ज्योति, मंगल ध्वनि छाई विनय करें हम बालक चनन सिर नाई ।। जय.... भक्ति भावमय पूजा, अंगीकृत कीजै जो मन बसै हमारे, इच्छित फल दीजै ।। जय.  दुःखी, दरिद्री, रोगी, संकट मुक्त किये। बहु धन-धान्य भरे घर, सुख सौभाग्य दिये ।। जय. ध्यान धर्यो जिस जन ने, मनवांछित फल पायो। पूजा कथा श्रवण कर, घर आनन्द आयो ।। जय. शरण गहे की लज्जा, राखियो जगदम्बे  संकट तूही निवारे, दयामयी अम्बे ।। जय.. सन्तोषी माँ की आरती, जो कोई नर गावे ऋद्धि-सिद्धि, सुख-सम्पत्ति, जी भर के पावे ।। जय "
      },
      "श्री सरस्वतीजी की" : {
        "title" : "श्री सरस्वतीजी की",
        "image" : "https://i.pinimg.com/236x/53/fb/25/53fb25b8f8e2a0a24a4ee5b10eea2ec9.jpg",
        "story" : "जय सरस्वती माता, मैया जय सरस्वती माता। सद्‌गुण वैभव शालिनि, त्रिभुवन विख्याता ।। चन्द्रवदनि प‌द्मासिनि, द्युति मंगलकारी। सोहे शुभ हंस सवारी, अतुल तेजधारी ।। मैया ज बाएं कर में वीणा, दाएं कर माला शीश मुकुट मणि सोहे, गल मोतियन माला ।। मैया जय... देवि शरण जो आए, उनका उद्धार किया पैठि मंथरा दासी, रावण संहार किया।। मैया ज विद्या ज्ञान प्रदायिनि ज्ञान प्रकाश भरो मोह, अज्ञान और तिमिर का, जग से नाश करो।। मैया ज धूप दीप फल मेवा, माँ स्वीकार करो  ज्ञानचक्षु दे माता, जग निस्तार करो।। मैया ज माँ सरस्वती की आरती, जो कोई नर गावे ।  हितकारी सुखकारी, ज्ञान भक्ति पावे।। मैया ज "
      },
      "श्रीसत्यनारायण जी " : {
        "title" : "श्रीसत्यनारायण जी ",
        "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTO1km4JdWbatNHPrV2OhY0ZySIE-1Vux34uA&s",
        "story" : "ॐ जय लक्ष्मी रमणा, श्री जय लक्ष्मी रमणा। सत्यनारायण स्वामी, जन-पातक हरणा ।। रत्न जड़ित सिंहासन, अद्भुत छवि राजे। नारद करत निराजन, घण्टा ध्वनि बाजे ।। प्रगट भए कलि कारण द्विज को दरश दियो। बूढ़ो ब्राह्मण बनकर, कंचन महल कियो।। दुर्बल भील कबरो, इन पर कृपा करी। चन्द्रचूड़ एक राजा, जिनकी विपति हरी।। वैश्य मनोरथ पायो, श्रद्धा तज दीन्हीं। सो फल भोग्यो प्रभु जी, फिर स्तुति कीन्हीं।। भावभक्ति के कारण, छिन छिन रूप धरयो। श्रद्धा धारण कीन्हीं, तिनको काज सर्यो ।। ग्वाल-बाल संग राजा, वन में भक्ति करी। मनवांछित फल दीन्हों, दीनदयाल हरी।। चढ़त प्रसाद सवाया, कदली फल मेवा। धूप दीप तुलसी से, राजी सत्यदेवा ।।  श्री सत्यनारायण जी की आरती जो कोई नर गावे। ऋद्धि-सिद्धि सुख-सम्पत्ति मनोवांछित पावे ।। "
      },
      "श्री विष्णु जी " : {
        "title" : "श्री विष्णु जी ",
        "image" : "https://c4.wallpaperflare.com/wallpaper/390/663/648/god-lord-vishnu-wallpaper-preview.jpg",
        "story" : "ॐ जय जगदीश हरे, स्वामी जय जगदीश हरे। भक्तजनों के संकट, क्षण में दूर करे।।जो ध्यावे फल पावे, दुःख बिनसे मन का।सुख सम्पत्ति घर आवे, कष्ट मिटे तन का।। ऊँ जय..... मातपिता तुम मेरे शरण गहूँ किसकी। तुम बिन और न दूजा, आश करूँ जिसकी ।। ऊँ जय.....तुम पूरण परमात्मा, तुम अन्तर्यामी।पार ब्रह्म परमेश्वर, तुम सबके स्वामी ।। ऊँ जय.... तुम करुणा के सागर, तुम पालनकर्त्ता। मैं मूरख खल कामी, कृपा करो भर्ता ।। ऊँ जय......तुम हो एक अगोचर, सबके प्राणपति।किस विधि मिलूँ दयामय, तुमको मैं कुमति ।। ऊँ जय.....दीन बन्धु दुःख हर्ता, तुम रक्षक मेरे। करुणा हस्त उठाओ, द्वार पड़ा तेरे ।। ॐ जय.....विषय-विकार मिटाओ, पाप हरो देवा।श्रद्धा भक्ति बढ़ाओ, सन्तन की सेवा ।। ऊँ जय......तन-मन-धन सब कुछ है तेरा।तेरा तुझको अर्पण क्या लागे मेरा ।। ऊँ जय.....जय जगदीश हरे, स्वामी जय जगदीश हरे।भक्तजनों के संकट, क्षण में दूर करे ।। ऊँ जय....."
      },
      "श्री शिवजी " : {
        "title" : "श्री शिवजी ",
        "image" : "https://www.bhaktiwallpapers.com/uploads/2024/01/hindu-god-shiva-angry-pashupatinatha-mobile-meditation-god-of-destruction-lord-shiva-family-hd-phone-wallpaper-ajld-1706349671.jpg",
        "story" : "ॐ जय शिव ओंकारा, प्रभु जय शिव ओंकारा। ब्रह्मा, विष्णु, सदाशिव, अर्द्धर्धांगनी धारा ।। ॐ हर हर हर महादे एकानन चतुरानन, पंचानन राजे हँसानन गरुड़ासन, वृषवाहन साजे ।। ऊँ ह दो भुज चार चतुर्भुज, दशमुख अति सोहै। तीनहु रूप निरखता, त्रिभुवन जन मोहे।। ऊँ ह अक्षमाला वनमाला, मुण्डमाला धारी चन्दन मृग मद सोहे, भोले शशिधारी ।। ऊँ ह श्वेताम्बर पीताम्बर, बाघाम्बर अंगे  ब्रह्मादिक सनकादिक, भूतादिक संगे ।। ऊँ ह कर के मध्य कमण्डल चक्र त्रिशूलधारी सुखकारी, दुःखहारी जग पालनकारी ।। ऊँ ह ब्रह्मा, विष्णु, सदाशिव, जानत अविवेका। प्रणवाक्षर के मध्ये, ये तीनों एका ।। ऊँ ह त्रिगुण स्वामी जी की आरती जो कोई नर गावे कहत शिवानन्द स्वामी, मनवांछित फल पावे ।। ऊँ हर .. "
      },
      "श्री हनुमान जी " : {
        "title" : "श्री हनुमान जी ",
        "image" : "https://w0.peakpx.com/wallpaper/367/724/HD-wallpaper-jai-shri-ram-ram-bhakt-hanuman.jpg",
        "story" : "आरती कीजै हनुमान लला की। दुष्ट दलन रघुनाथ कला की ।। जाके बल से गिरिवर काँपै। रोग-दोष जाके निकट न झांकै ।। अंजनी पुत्र महा बलदाई। संतन के प्रभु सदा सहाई ।। दे बीरा रघुनाथ पठाये। लंका जारि सिया सुधि लाये ।। लंका सो कोट समुद्र सी खाई। जात पवनसुत बार न लाई ।। लंका जारि असुर संहारे। सियाराम जी के काज संवारे ।। लक्ष्मण मूर्छित पड़े सकारे। आनि संजीवन प्राण उबारे ।। पैठि पताल तोरि जम-कारे। अहिरावण की भुजा उखारे ।। बायें भुजा असुर दल मारे। दाहिने भुजा संतजन तारे।। सुर नर मुनि आरती उतारे। जै जै जै हनुमान उचारे ।। कंचन थार कपूर लौ छाई। आरती करत अंजना माई ।। जो हनुमान जी की आरती गावै। बसि बैकुण्ठ परमपद पावै।। "
      },
      "श्री शनिदेव जी " : {
        "title" : "श्री शनिदेव जी ",
        "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPxOBEHxIfjG8Gx60SLlEv53XgbORy0xLcLQ&s",
        "story" : "जय जय श्री शनिदेव भक्तन हितकारी । सूरज के पुत्र प्रभु छाया महतारी ।। जय. । श्याम अंक वक्र दृष्ट चतुर्भुजा धारी  नीलाम्बर धार नाथ गज की असवारी ।। जय. । क्रीट मुकुट शीश रजित दिपत है लिलारी। मुक्तन की माला गले शोभित बलिहारी ।। जय. । मोदक मिष्ठान पान चढ़त हैं सुपारी  लोहा तिल तेल उड़द महिषी अति प्यारी।। जय. । देव दनुज ऋषि मुनि सुमरिन नर नारी। विश्वनाथ धरत ध्यान शरण हैं तुम्हारी ।। जय. । "
      },
      "श्री दुर्गा जी " : {
        "title" : "श्री दुर्गा जी ",
        "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTRWZoUxrL1_D0Aw6draDSU6JUa9sQZOPeCzA&s",
        "story" : "जय अम्बे गौरी, मैया जय श्यामा गौरी। तुमको निशिदिन ध्यावत, हरि ब्रह्मा शिवरी ।। ऊँ जय..... माँग सिन्दूर विराजत, टीको मृगमद को। उज्ज्वल से दोऊ नैना, चन्द्र वदन नीको ।। ऊँ जय....... कनक समान कलेवर, रक्ताम्बर राजे।  रक्त-पुष्प गंड माला, कण्ठन पर साजे ।। ऊँ जय...... केहरि वाहन राजत, खड्ग खप्पर धारी। सुर-नर-मुनि-जन सेवत, तिनके दुःखहारी ।। ऊँ जय.... कानन कुण्डल शोभित, नासाग्रे मोती।  कोटिक चन्द्र दिवाकर, सम राजत ज्योति ।। ऊँ जय....... शुम्भ निशुम्भ बिदारे, महिषासुर घाती। धूम्र विलोचन नैना, निशिदिन मदमाती ।। ऊँ जय......  चण्ड मुण्ड संहारे, शोणित बीज हरे। मधु कैटभ दोऊ मारे, सुर भय हीन करे।। ॐ जय...... ब्रह्माणी रुद्राणी, तुम कमला रानी। आगम निगम बखानी, तुम शिव पटरानी ।। ऊँ जय...... चौंसठ योगिनी मंगल गावत, नृत्य करत भैरों। बाजत ताल मृदंगा, अरु बाजत डमरू ।। ऊँ जय......  तुम ही जग की माता, तुम हीं हो भरता। भक्तन की दुःखहर्ता, सुख सम्पत्ति करता।। ऊँ जय......  भुजा चार अति शोभित, वर मुद्राधारी। मनवांछित फल पावत, सेवत नर नारी ।। ऊँ जय....... कंचन थाल विराजत, अगर कपूर बाती। श्री मालकेतु में राजत, कोटि रतन ज्योति ।।  ऊँ जय श्री अम्बा जी की आरती जो कोई नर गाबे। कहत शिवानंद स्वामी, सुख सम्पति पावे ।। ऊँ जय "
      }
};

const Aarti = () => {
    const [selectedItem, setSelectedItem] = useState(Object.keys(data)[0]);

    // Handle dropdown change
    const handleChange = (itemValue) => {
        setSelectedItem(itemValue);
    };

    // Get selected data
    const selectedData = data[selectedItem];

    const storyLines = selectedData.story.split('।।').map(line => line.trim());

    // Function to handle speech
    const speakText = () => {
        Speech.speak(selectedData.story, {
            language: 'hi', // Set language to Hindi
            pitch: 1,
            rate: 1,
        });
    };

    return (
        <>
        <View style={styles.container}>
            <Picker
                selectedValue={selectedItem}
                onValueChange={handleChange}
                style={styles.picker}
            >
                {Object.keys(data).map((key) => (
                    <Picker.Item key={key} label={key} value={key} />
                ))}
            </Picker>
        <ScrollView style={styles.scrollView}>
                <Image source={{ uri: selectedData.image }} style={styles.image} />
                <Text style={styles.subtitle}>{selectedData.title}</Text>
                <TouchableOpacity onPress={speakText} >
                {storyLines.map((line, index) => (
                <Text key={index} style={styles.storyText}>{line}</Text>
                ))}
                </TouchableOpacity>
              </ScrollView>
                </View>
            <CustomBottomNavbar />
            </>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        padding: 16,
        backgroundColor: 'white',
        paddingBottom: 60,
    },
    scrollView: {
        flex: 1,
    },
    picker: {
        height: 50,
        width: '100%',
        marginBottom: 16,
    },
    contentContainer: {
        padding: 16,
        backgroundColor: '#f0f0f0',
        borderRadius: 8,
        borderWidth: 1,
        borderColor: '#ddd',
        flexGrow: 1,
    },
    image: {
        width: '100%',
        height: 300,
        borderRadius: 8,
        marginBottom: 10,
    },
    subtitle: {
        fontSize: 20,
        fontWeight: '600',
        textAlign: 'center',
        marginBottom: 10,
    },
    storyText: {
        marginTop: 10,
        fontSize: 16,
        color: '#333',
        marginBottom: 10,
    },
    button: {
        backgroundColor: '#4CAF50',
        padding: 10,
        borderRadius: 5,
        alignItems: 'center',
    },
    buttonText: {
        color: 'white',
        fontSize: 16,
    },
});

export default Aarti;
