import React, { useState } from 'react';
import { View, Text, TouchableOpacity, StyleSheet, Image, ScrollView } from 'react-native';
import { Picker } from '@react-native-picker/picker'; // Updated import
import * as Speech from 'expo-speech'; // Importing expo-speech
import CustomBottomNavbar from '@/components/BottomNavbar';

// Sample JSON data
const data = {
    "अच्युतम केशवम ": {
        "image" : "https://5.imimg.com/data5/SELLER/Default/2023/12/365695850/BT/JU/RO/20619026/lord-krishna-playing-flute-canvas-painting.jpg",
        "title": "अच्युतम केशवम ",
        "story": "अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,बिन बुलाये आएंगे,,श्याम रेह ना पायेंगे,,तेरी पीड़ा तेरे दुःख,,श्याम सेह ना पायेंगे,,बिन बुलाये आएंगे,,श्याम रेह ना पायेंगे,,तेरी पीड़ा तेरे दुःख,,श्याम सेह ना पायेंगे,,आस्था से पूरी,,बंद करके आँखों को,,दिल से तुम बुलाओ तो सही,,कौन कहते हैं भगवान आते नहीं,,लोग मीरा के जैसे बुलाते नहीं,,कौन कहते हैं भगवान आते नहीं,,लोग मीरा के जैसे बुलाते नहीं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,कोई छोटा ना बड़ा,,सब बराबर है यहाँ,,राम के हैं हम सभी,,राम सबके हैं यहाँ,,मन में श्रद्धा हो अगर,,तो मना वो ना करे,,चाहे झूठा ही सही,,भोग वो स्वीकार लें,,भाव जिसका मन में,,राम के लिए पूरा,,वो मना करेंगे ही नहीं,,कौन कहते हैं भगवान आते नहीं,,लोग मीरा के जैसे बुलाते नहीं,,कौन कहते हैं भगवान आते नहीं,,लोग मीरा के जैसे बुलाते नहीं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,कौन कहते हैं भगवान सोते नहीं,,माँ यशोदा के जैसे सुलाते नहीं,,कौन कहते हैं भगवान सोते नहीं,,माँ यशोदा के जैसे सुलाते नहीं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,कौन कहते हैं भगवान नाचते नहीं,,गोपियों की तरह तुम नचाते नहीं,,कौन कहते हैं भगवान नाचते नहीं,,गोपियों की तरह तुम नचाते नहीं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं,,अच्युतम केशवं कृष्ण दामोदरं,,राम नारायणं जानकी वल्लभं"
    },
    "नमो - नमो": {
        "image" : "https://images.nightcafe.studio/jobs/bcqd0FFkih1xQo5MYlLo/bcqd0FFkih1xQo5MYlLo-I2kH0.jpeg?tr=w-1600,c-at_max",
        "title": "नमो - नमो",
        "story": "जय हो जय हो शंकरा,,(भोलेनाथ शंकर),,आदि देव शंकर,,(हे शिवाय शंकर),,तेरे जाप के बिना,,(भोलेनाथ शंकर),,चले ये सांस किस तरह,,(हे शिवाय शंकर),,मेरा कर्म तू ही जाने,,क्या बुरा है क्या भला?,,तेरे रास्ते पे मैं तो,,आंख मूंद के चला,,तेरे नाम की जोत ने,,सारा हर लिया तमस मेरा,,(तमस: अंधकार),,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,हे त्रिलोकनाथ शम्भू!,,हे शिवाय शंकराय,,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,रुद्रदेव हे महेश्वरः,,सृष्टि के जन्म से भी,,(ओ ओ),,पहले तेरा वास था,,(ओ ओ),,ये जग रहे या ना रहे,,(ओ ओ),,रहेगी तेरी आस्था,,(ओ ओ),,क्या समय, क्या प्रलय,,दोनों में तेरी महानता,,महन्ताऽ महन्ताऽ,,सीपियों की ऑन्ट मेन,,(भोलेनाथ शंकर),,मोतियाँ हो जिस तरह,,(हे शिवाय शंकर),,मेरे मन में शंकरा,,(भोलेनाथ शंकर),,तू बसा है उस तरह,,(हे शिवाय शंकर),,मुझे भरोसा था जो है मेरा,,था नहीं कभी मेरा,,अर्थ क्या निरर्थ क्या,,जो भी है सभी तेरा,,तेरे सामने है झुका,,मेरे सर पे हाथ रख तेरा,,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,हे त्रिलोकनाथ शम्भू!,,हे शिवाय शंकराय,,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,रुद्रदेव हे महेश्वर!,,चंद्रमा ललाट पे (ओ ओ),,भस्म है भुजाओं में (ओ ओ),,वस्त्र बाघ छल का (ओ ओ),,है खड़ाऊ पांव में (ओ ओ),,प्यास क्या हो तुझे,,गंगा है तेरी जटाओं में,,जटाओं में, जटाओं में,,दूसरो के वास्ते,,(भोलेनाथ शंकर),,तू सदैव है जिया,,(हे शिवाय शंकर),,मांगा कुछ कभी नहीं,,(भोलेनाथ शंकर),,तूने सिर्फ है दिया,,(हे शिवाय शंकर),,समुद्र मंथन का समय जो आ पड़ा,,द्वंद दोनो लोक में विष-अमृत पे था छिपा,,अमृत ​​सभी मैं बांट के,,प्याला विष का तूने खुद पिया,,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,हे त्रिलोकनाथ शम्भू!,,हे शिवाय शंकराय,,नमो नमो जी शंकरा,,भोलेनाथ शंकर,,रुद्रदेव हे महेश्वर!,,रुद्रदेव हे महेश्वर!,,रुद्रदेव हे महेश्वर!"
    },
    "मेरी किशाोरी राधे ": {
        "image" : "https://cdn.lazyshop.com/files/84d84f33-5cbd-4cd2-8c63-4a3789e49cfc/product/5a2960f31f56ac1d46be815a33b8d1e9.jpg?x-oss-process=style%2Fthumb",
        "title": "मेरी किशाोरी राधे ",
        "story": "किशोरी कुछ ऐसा इंतजाम हो जाए,,किशोरी कुछ ऐसा इंतजाम हो जाए।,, जुबा पे राधा राधा राधा नाम हो जाए॥,, जब गिरते हुए मैंने तेरे नाम लिया है।,, तो गिरने ना दिया तूने, मुझे थाम लिया है॥,, तुम अपने भक्तो पे कृपा करती हो, श्री राधे।,, उनको अपने चरणों में जगह देती  हो श्री राधे।,, तुम्हारे चरणों में मेरा मुकाम हो जाए॥,, मांगने वाले खाली ना लौटे, कितनी मिली खैरात ना पूछो।,, उनकी कृपा तो उनकी कृपा है, उनकी कृपा की बात ना पूछो॥,, ब्रज की रज में लोट कर, यमुना जल कर पान।,, श्री राधा राधा रटते, या तन सों निकले प्राण॥,, गर तुम ना करोगी तो कृपा कौन करेगा।,, गर तुम ना सुनोगी तो मेरी कौन सुनेगा॥,, डोलत फिरत मुख बोलत मैं राधे राधे, और जग जालन  के ख्यालन से हट रे।,, जागत, सोवत, पग जोवत में राधे राधे, रट राधे राधे त्याग उरते कपट रे॥,, लाल बलबीर धर धीर रट राधे राधे, हरे कोटि बाधे रट राधे झटपट रे।,, ऐ रे मन मेरे तू छोड़ के झमेले सब, रट राधे रट राधे राधे रट रे॥,, श्री राधे इतनी कृपा तुम्हारी हम पे हो जाए।,, किसी का नाम लूँ जुबा पे तुम्हारा नाम आये॥,, वो दिन भी आये तेरे वृन्दावन आयें हम, तुम्हारे चरणों में अपने सर को झुकाएं हम।,, ब्रज गलिओं में झूमे नाचे गायें हम, मेरी सारी उम्र वृन्दावन में तमाम हो जाए॥,, वृन्दावन के वृक्ष को, मर्म ना जाने कोई।,, डार डार और पात पात में, श्री श्री राधे राधे होए॥,, अरमान मेरे दिल का मिटा क्यूँ नहीं देती, सरकार वृन्दावन में बुला क्यूँ नहीं लेती।,, दीदार भी होता रहे हर वक्त बार बार, चरणों में अपने हमको बिठा क्यूँ नहीं लेती॥,, श्री वृन्दावन वास मिले, अब यही हमारी आशा है।,, यमुना तट छाव कुंजन की जहाँ रसिकों का वासा है॥,, सेवा कुञ्ज मनोहर निधि वन, जहाँ इक रस बारो मासा है।,, ललिता किशोर अब यह दिल बस, उस युगल रूप का प्यासा है॥,, मैं तो आई वृन्दावन धाम किशोरी तेरे चरनन में।,, किशोरी तेरे चरनन में, श्री राधे तेरे चरनन में॥,, ब्रिज वृन्दावन की महारानी, मुक्ति भी यहाँ भारती पानी।,, तेरे चन पड़े चारो धाम, किशोरी तेरे चरनन में॥,, करो कृपा की कोर श्री राधे, दीन जजन की ओर श्री राधे।,, मेरी विनती है आठो याम, किशोरी तेरे चरनन में॥,, बांके ठाकुर की ठकुरानी, वृन्दावन जिन की रजधानी।,, तेरे चरण दबवात श्याम, किशोरी तेरे चरनन में॥,, मुझे बनो लो अपनी दासी, चाहत नित ही महल खवासी।,, मुझे और ना जग से काम, किशोरी तेरे चरण में ॥,, किशोरी इस से बड कर आरजू -ए-दिल नहीं कोई।,, तुम्हारा नाम है बस दूसरा साहिल नहीं कोई।,, तुम्हारी याद में मेरी सुबहो श्याम हो जाए॥,, यह तो बता दो बरसाने वाली मैं कैसे तुम्हारी लगन छोड़ दूंगा।,, तेरी दया पर यह जीवन है मेरा, मैं कैसे तुम्हारी शरण छोड़ दूंगा॥,, ना पूछो किये मैंने अपराध क्या क्या, कही यह जमीन आसमा हिल ना जाये।,, जब तक श्री राधा रानी शमा ना करोगी, मैं कैसे तुम्हारे चरण छोड़ दूंगा॥,, बहुत ठोकरे खा चूका ज़िन्दगी में, तमन्ना तुम्हारे दीदार की है।,, जब तक श्री राधा रानी दर्शा ना दोगी, मैं कैसे तुम्हारा भजन छोड़ दूंगा॥,, तारो ना तारो मर्जी तुम्हारी, लेकिन मेरी आखरी बात सुन लो।,, मुझ को श्री राधा रानी जो दर से हटाया, तुम्हारे ही दर पे मैं दम तोड़ दूंगा॥,, मरना हो तो मैं मरू, श्री राधे के द्वार,,, कभी तो लाडली पूछेगी, यह कौन पदीओ दरबार॥,, आते बोलो, राधे राधे, जाते बोलो, राधे राधे।,, उठते बोलो, राधे राधे, सोते बोलो, राधे राधे।,, हस्ते बोलो, राधे राधे, रोते बोलो, राधे राधे॥"
    },
    "पार्वती बोली शंकर से ": {
        "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRp0Ltsd1JdUOPHTHpvXQDPk9_qtTAZFe3ygg&s",
        "title": "पार्वती बोली शंकर से ",
        "story": "पार्वती बोली शंकर से,,पार्वती बोली शंकर से,,पार्वती बोली शंकर से,,सुनिये भोलेनाथ जी,,रहना है हर इक जन्म में,,मुझे तुम्हारे साथ जी,,वचन दिजिये ना छोड़ेंगे,,कभी हमारा हाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,ओ भोलेनाथ जी,,ओ शंकरनाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,ओ भोलेनाथ जी,,ओ शंकरनाथ जी,,जैसे मस्तक पे चंदा है,,गंगा बसी जटाओं में,,वैसे रखना हे अभिनाशी,,मुझे प्रेम की छाँव में,,जैसे मस्तक पे चंदा है,,गंगा बसी जटाओं में,,वैसे रखना हे अभिनाशी,,मुझे प्रेम की छाँव में,,कोई नहीं तुमसा तीनों,,लोको में दसों दिशाओ में,,महलों से ज्यादा सुख है,,कैलाश की खुली हवाओ में,,तुम हो जहाँ वहाँ होती है,,तुम हो जहाँ वहाँ होती है,,अमृत की बरसात जी,,रहना है हर इक जन्म में,,मुझे तुम्हारे साथ जी,,वचन दिजिये ना छोड़ेंगे,,कभी हमारा हाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,ओ भोलेनाथ जी,,ओ शंकरनाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,ओ भोलेनाथ जी,,ओ शंकरनाथ जी,,देव हो तुम देवों के भोले,,अमर हो अंतरयामी हो,,भाग्यवान है हम त्रिपुरारी,,आप हमारे स्वामी हो,,देव हो तुम देवों के भोले,,अमर हो अंतरयामी हो,,भाग्यवान है हम त्रिपुरारी,,आप हमारे स्वामी हो,,पुष्प विमानो से प्यारी,,हमको नंदी की सवारी जी,,युगो युगो से पार्वती,,भोले तुमपे बलिहारी जी,,जब लाओ तुम ही लाना,,जब लाओ तुम ही लाना,,द्वारे मेरे बारात जी,,ओ भोलेनाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,ओ भोलेनाथ जी,,ओ शम्भू नाथ जी,,प्राण मेरे बस्तें हैं तुममें,,तुम बिन मेरी नहीं गति,,अग्नि कुण्ड में होके भस्म,,तुम हुई थी मेरे लिए सती,,शिव बिन जैसे शक्ति अधूरी,,शक्ति बिन शिव आधें है,,जन्मों तक ना टूटेंगे ये,,जनम जनम के नातें हैं,,तुम ही मेरी संध्या हो गौरी,,तुम ही मेरी प्रभात जी,,वचन है मेरा ना छोडूंगा,,कभी तुम्हारा हाथ जी,,सदा रहे हैं सदा रहेंगे,,गौरी शंकर साथ जी,,हे गोरा पार्वती,,हे गोरा पार्वती,,जी भोलेनाथ जी,,ओ शंकरनाथ जी,,ओ भोलेनाथ जी,,ओ शंभूनाथ जी,,ओ भोलेनाथ जी,,ओ शंकरनाथ जी,,ओ मेरा भोला है,,मेरे साथ साथ,,मैं झूम झूम के नाचूँ,,मेरा भोला है,,मेरे साथ साथ,,मैं झूम झूम के नाचूँ,,मैं झूम झूम के नाचूँ,,अर्रे घूम घुम के नाचूँ,,मेरा भोला, हो मेरा भोला,,मेरा भोला है,,मेरे साथ साथ,,मैं झूम झूम के नाचूँ,,मेरा भोला है,,मेरे साथ साथ,,मैं घुम घुम के नाचूँ,,हो भोलेनाथ जी,,हो शम्भू नाथ जी"
    },
    "श्री कृष्ण गोविंद हरे मुरारी": {
        "image" : "https://preview.redd.it/this-time-i-created-some-epic-scenes-with-ai-v0-x0qgqjf3eojc1.png?width=640&crop=smart&auto=webp&s=a52c90923a1c2283d15c984e82e3896672fed975",
        "title": "श्री कृष्ण गोविंद हरे मुरारी",
        "story": "श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,पितु-मात स्वामी सख़ा हमारे,,पितु-मात स्वामी सख़ा हमारे,,हे नाथ नारायण वासुदेवा,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,ठाकुर हमारे प्राणों से प्यारे,,तुम हो हमारे, हम हैं तुम्हारे,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,गैयाँ चरैया, माख़न चुरैया,,गैयाँ चरैया, माख़न चुरैया,,दीनों की नैया के तुम ही ख़िवैया,,हे नाथ नारायण वासुदेव,,गोविंद मेरो है, गोपाल मेरो है,,गोविंद मेरो है, गोपाल मेरो है,,श्री बाँके-बिहारी नंदलाल मेरो है,,गोविंद मेरो है, गोपाल मेरो है,,श्री बाँके-बिहारी नंदलाल मेरो है,,गोविंद मेरो है, गोपाल मेरो है,,गोविंद मेरो है, गोपाल मेरो है,,श्री बाँके-बिहारी नंदलाल मेरो है,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,तुमसे है धरती, तुमसे है अंबर,,अग्नि-पवन और सातों समंदर,,हे नाथ नारायण वासुदेव,,श्री कृष्ण गोविंद हरे मुरारी,,हे नाथ नारायण वासुदेव,,गोविंद बोलो हरी गोपाल बोलो,,गोविंद बोलो हरी गोपाल बोलो,,राधारमण हरी गोविंद बोलो,,गोविंद बोलो हरी गोपाल बोलो,,गोविंद बोलो हरी गोपाल बोलो,,राधारमण हरी गोविंद बोलो,,गोविंद बोलो हरी गोपाल बोलो"
    },
    "सांवली सूरत पे मोहन, दिल दीवाना हो गया ।": {
        "image" : "https://i.pinimg.com/736x/4a/e3/8f/4ae38f5f0dc46d84376608e841a432a6.jpg",
        "title": "सांवली सूरत पे मोहन, दिल दीवाना हो गया ।",
        "story": "सांवली सूरत पे मोहन, दिल दीवाना हो गया ।,,दिल दीवाना हो गया, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया ।,,दिल दीवाना हो गया, दिल दीवाना हो गया ॥,,एक तो तेरे नैन तिरछे, दूसरा काजल लगा ।,,तीसरा नज़रें मिलाना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तेरे होंठ पतले, दूसरा लाली लगी ।,,तीसरा तेरा मुस्कुराना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तेरे हाथ कोमल, दूसरा मेहँदी लगी ।,,तीसरा मुरली बजाना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तेरे पाँव नाज़ुक, दूसरा पायल बंधी ।,,तीसरा घुंगरू बजाना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तेरे भोग छप्पन, दूसरा माखन धरा ।,,तीसरा खिचडे का खाना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तेरे साथ राधा दूसरा रुक्मण खड़ी ।,,तीसरा मीरा का आना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,एक तो तुम देवता हो, दूसरा प्रियतम मेरे ।,,तीसरा सपनों में आना, दिल दीवाना हो गया ॥,,सांवली सूरत पे मोहन, दिल दीवाना हो गया....,,सांवली सूरत पे मोहन, दिल दीवाना हो गया ।,,दिल दीवाना हो गया, दिल दीवाना हो गया ॥"
    },
    "श्री राधे राधे राधे बरसाने वाली राधे": {
        "image" : "https://photosnow.org/wp-content/uploads/2024/04/radha-krishna-images-hd_18.jpg",
        "title": "श्री राधे राधे राधे बरसाने वाली राधे",
        "story": " श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,नाम महा धन है अपनो,,नहीं दूसरी सम्पत्ति और कमानी,,छोड़ अटारी अटा जग के,,हम गोकुटिया ब्रिज माही बनानी,,हम गोकुटिया ब्रिज माही बनानी,,हम गोकुटिया ब्रिज माही बनानी,,टूक मिले रसिकों के सदा,,और पिवन को यमुना जल पानी,,हमें औरन की परवाह नहीं,,अपनी ठकुरानी श्री राधिका रानी,,अपनी ठकुरानी श्री राधिका रानी,,अपनी ठकुरानी श्री राधिका रानी,,जय राधे राधे राधे राधे,,जय राधे राधे राधे राधे,,बृशभान दुलरी राधे राधे,,भक्तों की प्यारी राधे राधे,,वो श्यामा प्यारी राधे राधे,,हरिदास दुलारी राधे राधे,,रशिकों की प्यारी राधे राधे,,हमारी प्यारी राधे राधे,,तुम्हारी प्यारी राधे राधे,,हम सबकी प्यारी राधे राधे,,हो प्यारी प्यारी राधे राधे,,हो प्यारी प्यारी राधे राधे,,जय राधे राधे राधे राधे,,जय राधे राधे राधे राधे,,जय राधे राधे राधे राधे,,जय राधे राधे राधे राधे,,ब्रिंदावन में राधे राधे,,सुनरक गाँव में राधे राधे,,काली दह पर राधे राधे,,अद्वेक बट में राधे राधे,,तान गली में राधे राधे,,पान गली में राधे राधे,,गुमान गली में राधे राधे,,हो कुंज गली में राधे राधे,,शिवा कुंज में राधे राधे,,प्रेम गली में राधे राधे,,श्रिंगार बट पे राधे राधे,,चिर घाट पे राधे राधे,,किशी घाट पे राधे राधे,,हो निविबनजी में राधे राधे,,बंशी बट पे राधे राधे,,ज्ञान गुदड़ी राधे राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,श्री राधे राधे राधे बरसाने वाली राधे,,राधे राधे राधे बरसाने वाली राधे,,ब्रह्म कुंड पे राधे राधे,,वो किशोर महादेव राधे राधे,,श्री बाँके बिहारी राधे राधे,,श्री नेह बिहारी राधे राधे,,मदन मोहन जी राधे राधे,,गोपीनाथ जी राधे राधे,,राधा दामोदर राधे राधे,,राधा बिनोद जी राधे राधे,,साक्षी गोपाल जी राधे राधे,,राधा माधव जी राधे राधे,,श्री राधा बल्लव जी राधे राधे,,श्री युगल किशोर जी राधे राधे,,श्री राधा रमन जी राधे राधे,,अस्ट सखी जी राधे राधे,,अटल बन में राधे राधे,,बिहार बन में राधे राधे,,गौ चारण बन में राधे राधे,,गोपाल बन में राधे राधे,,ब्रिंदाबन का कण कण बोले श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री यमुना जी की लहरें बोले, श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्याम सुंदर की बंसी बोले श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,यमुना जी की लहरें बोले श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,निधिजी बन जी में बंदर बोले श्री राधा राधा,,श्री राधा राधा श्री राधा राधा,,ब्रज की लता पता भी बोले श्री राधा राधा,,श्री राधा राधा श्री राधा राधा"
    },
    "किशोरी कुछ ऐसा इंतजाम हो जाए": {
        "image" : "https://i.pinimg.com/originals/29/b2/38/29b23817f0156bae5a8204948a27663e.jpg",
        "title": "किशोरी कुछ ऐसा इंतजाम हो जाए",
        "story": "किशोरी कुछ ऐसा इंतजाम हो जाए,,किशोरी कुछ ऐसा इंतजाम हो जाए।,,जुबा पे राधा राधा राधा नाम हो जाए॥,,जब गिरते हुए मैंने तेरे नाम लिया है।,,तो गिरने ना दिया तूने, मुझे थाम लिया है॥,,तुम अपने भक्तो पे कृपा करती हो, श्री राधे।,,उनको अपने चरणों में जगह देती  हो श्री राधे।,,तुम्हारे चरणों में मेरा मुकाम हो जाए॥,,मांगने वाले खाली ना लौटे, कितनी मिली खैरात ना पूछो।,,उनकी कृपा तो उनकी कृपा है, उनकी कृपा की बात ना पूछो॥,,ब्रज की रज में लोट कर, यमुना जल कर पान।,,श्री राधा राधा रटते, या तन सों निकले प्राण॥,,गर तुम ना करोगी तो कृपा कौन करेगा।,,गर तुम ना सुनोगी तो मेरी कौन सुनेगा॥,,डोलत फिरत मुख बोलत मैं राधे राधे, और जग जालन  के ख्यालन से हट रे।,,जागत, सोवत, पग जोवत में राधे राधे, रट राधे राधे त्याग उरते कपट रे॥,,लाल बलबीर धर धीर रट राधे राधे, हरे कोटि बाधे रट राधे झटपट रे।,,ऐ रे मन मेरे तू छोड़ के झमेले सब, रट राधे रट राधे राधे रट रे॥,,श्री राधे इतनी कृपा तुम्हारी हम पे हो जाए।,,किसी का नाम लूँ जुबा पे तुम्हारा नाम आये॥,,वो दिन भी आये तेरे वृन्दावन आयें हम, तुम्हारे चरणों में अपने सर को झुकाएं हम।,,ब्रज गलिओं में झूमे नाचे गायें हम, मेरी सारी उम्र वृन्दावन में तमाम हो जाए॥,,वृन्दावन के वृक्ष को, मर्म ना जाने कोई।,,डार डार और पात पात में, श्री श्री राधे राधे होए॥,,अरमान मेरे दिल का मिटा क्यूँ नहीं देती, सरकार वृन्दावन में बुला क्यूँ नहीं लेती।,,दीदार भी होता रहे हर वक्त बार बार, चरणों में अपने हमको बिठा क्यूँ नहीं लेती॥,,श्री वृन्दावन वास मिले, अब यही हमारी आशा है।,,यमुना तट छाव कुंजन की जहाँ रसिकों का वासा है॥,,सेवा कुञ्ज मनोहर निधि वन, जहाँ इक रस बारो मासा है।,,ललिता किशोर अब यह दिल बस, उस युगल रूप का प्यासा है॥,,मैं तो आई वृन्दावन धाम किशोरी तेरे चरनन में।,,किशोरी तेरे चरनन में, श्री राधे तेरे चरनन में॥,,ब्रिज वृन्दावन की महारानी, मुक्ति भी यहाँ भारती पानी।,,तेरे चन पड़े चारो धाम, किशोरी तेरे चरनन में॥,,करो कृपा की कोर श्री राधे, दीन जजन की ओर श्री राधे।,,मेरी विनती है आठो याम, किशोरी तेरे चरनन में॥,,बांके ठाकुर की ठकुरानी, वृन्दावन जिन की रजधानी।,,तेरे चरण दबवात श्याम, किशोरी तेरे चरनन में॥,,मुझे बनो लो अपनी दासी, चाहत नित ही महल खवासी।,,मुझे और ना जग से काम, किशोरी तेरे चरण में ॥,,किशोरी इस से बड कर आरजू -ए-दिल नहीं कोई।,,तुम्हारा नाम है बस दूसरा साहिल नहीं कोई।,,तुम्हारी याद में मेरी सुबहो श्याम हो जाए॥,,यह तो बता दो बरसाने वाली मैं कैसे तुम्हारी लगन छोड़ दूंगा।,,तेरी दया पर यह जीवन है मेरा, मैं कैसे तुम्हारी शरण छोड़ दूंगा॥,,ना पूछो किये मैंने अपराध क्या क्या, कही यह जमीन आसमा हिल ना जाये।,,जब तक श्री राधा रानी शमा ना करोगी, मैं कैसे तुम्हारे चरण छोड़ दूंगा॥,,बहुत ठोकरे खा चूका ज़िन्दगी में, तमन्ना तुम्हारे दीदार की है।,,जब तक श्री राधा रानी दर्शा ना दोगी, मैं कैसे तुम्हारा भजन छोड़ दूंगा॥,,तारो ना तारो मर्जी तुम्हारी, लेकिन मेरी आखरी बात सुन लो।,,मुझ को श्री राधा रानी जो दर से हटाया, तुम्हारे ही दर पे मैं दम तोड़ दूंगा॥,,मरना हो तो मैं मरू, श्री राधे के द्वार,,,कभी तो लाडली पूछेगी, यह कौन पदीओ दरबार॥,,आते बोलो, राधे राधे, जाते बोलो, राधे राधे।,,उठते बोलो, राधे राधे, सोते बोलो, राधे राधे।,,हस्ते बोलो, राधे राधे, रोते बोलो, राधे राधे॥"
    },
    "काली कमली वाला मेरा यार है": {
        "image" : "https://5.imimg.com/data5/SELLER/Default/2023/12/365695965/VM/NG/GI/20619026/krishna2424c-500x500.jpg",
        "title": "काली कमली वाला मेरा यार है",
        "story": "ओ गिरिधर,,ओ काहना,,ओ ग्वाला,,नंदलाला,,मेरे मोहन, मेरे काहना, तू आ ना, तरसा ना ।,काली कमली वाला मेरा यार है,,मेरे मन का मोहन तू दिलदार है ।,तू मेरा यार है, मेरा दिलदार है ॥,मन मोहन मैं तेरा दीवाना, गाउँ बस अब यही तराना ।,श्याम सलोने तू मेरा रिजवार है, मेरे मन का मोहन तू दिलदार है ॥,तू मेरा मैं तेरा प्यारे, यह जीवन अब तेरे सहारे ।,तेरे हाथ इस जीवन की पतवार है, मेरे मन का मोहन तू दिलदार है ॥,पागल प्रीत की एक ही आशा, दर्दे दिल दर्शन का प्यासा ।,तेरे हर वादे पे मुझे ऐतबार है, मेरे मन का मोहन तू दिलदार है ॥,तुझको अपना मान लिया है, यह जीवन तेरे नाम किया है ।,चित्र विचित्र को बस तुमसे ही प्यार है, मेरे मन का मोहन तू दिलदार है ॥"
    },
    "सांवरे को दिल में बसा के तो देखो": {
        "image" : "https://cdn.pixabay.com/photo/2023/06/23/08/51/lord-krishna-8083043_1280.png",
        "title": "सांवरे को दिल में बसा के तो देखो",
        "story": "सांवरे को दिल में बसा के तो देखो,,दुनिया से मन को हटा के देखो,,बड़ा ही दयालु है बांके बिहारी,,इक बार वृन्दावन आ करके तो देखो,,बांके बिहारी भक्तों के दिलदार,,सदा लुटाते हैं कृपा के भण्डार,,मीरा ने जैसे गिरिधर की पाया,,प्याला ज़हर का अमृत बनाया,,मीरा सी हस्ती मिटा कर तो देखो,,इक बार वृन्दावन आ कर के देखो,,   कोई तन दुखी कोई मन दुखी,,   कोई धन बिन रहे उदास,,   थोड़े थोड़े सब दुखी,,,   सुखी राम के दास,,तेरी पल में झोली वो भर देगा,,दुःख दर्द जिंदगी के वो हर लेगा,,चौखट पे दामन फैला कर तो देखो,,बस, इक बार वृन्दावन आ कर तो देखो,,‘चित्र विचित्र’ का तो बस यही कहना,,प्रभु चरणो से कही दूर नहीं रहना,,जिंदगी यह बंदगी में मिटा कर तो देखो,,इक बार वृन्दावन आ कर के देखो"
    },
    "जय देव जय देव": {
        "image" : "https://img.freepik.com/premium-photo/illustration-lord-ganesha-ganesh-chaturthi-generative-ai_756405-11014.jpg",
        "title": "जय देव जय देव",
        "story": "सुखकर्ता दुखहर्ता वार्ता विघ्नाची,,नूर्वी पूर्वी प्रेम कृपा जयाची,,सर्वांगी सुन्दर उटी शेंदु राची,,कंठी झळके माल मुकताफळांची,,जय देव जय देव जय मंगल मूर्ति,,दर्शनमात्रे मनःकमाना पूर्ति,,जय देव जय देव,,रत्नखचित फरा तुझ गौरीकुमरा,,चंदनाची उटी कुमकुम केशरा,,हीरे जडित मुकुट शोभतो बरा,,रुन्झुनती नूपुरे चरनी घागरिया,,जय देव जय देव जय मंगल मूर्ति,,दर्शनमात्रे मनःकमाना पूर्ति,,जय देव जय देव,,लम्बोदर पीताम्बर फनिवर वंदना,,सरल सोंड वक्रतुंडा त्रिनयना,,दास रामाचा वाट पाहे सदना,,संकटी पावावे निर्वाणी रक्षावे सुरवर वंदना,,जय देव जय देव जय मंगल मूर्ति,,दर्शनमात्रे मनःकमाना पूर्ति,,जय देव जय देव,,शेंदुर लाल चढ़ायो अच्छा गजमुखको,,दोंदिल लाल बिराजे सुत गौरिहरको,,हाथ लिए गुडलद्दु सांई सुरवरको,,महिमा कहे न जाय लागत हूं पादको,,जय जय श्री गणराज विद्या सुखदाता,,धन्य तुम्हारा दर्शन मेरा मन रमता,,जय देव जय देव,,अष्टौ सिद्धि दासी संकटको बैरि,,विघ्नविनाशन मंगल मूरत अधिकारी,,कोटीसूरजप्रकाश ऐबी छबि तेरी,,गंडस्थलमदमस्तक झूले शशिबिहारि,,जय जय श्री गणराज विद्या सुखदाता,,धन्य तुम्हारा दर्शन मेरा मन रमता,,जय देव जय देव,,भावभगत से कोई शरणागत आवे,,संतत संपत सबही भरपूर पावे,,ऐसे तुम महाराज मोको अति भावे,,गोसावीनंदन निशिदिन गुन गावे,,जय जय श्री गणराज विद्या सुखदाता,,धन्य तुम्हारा दर्शन मेरा मन रमता,,जय देव जय देव,,सुखकर्ता दुखहर्ता वार्ता विघ्नाची,,नूर्वी पूर्वी प्रेम कृपा जयाची,,सर्वांगी सुन्दर उटी शेंदु राची,,कंठी झलके माल मुकताफळांची,,जय देव जय देव जय मंगल मूर्ति,,दर्शनमात्रे मनःकमाना पूर्ति,,जय देव जय देव,,दर्शनमात्रे मनःकमाना पूर्ति,,जय देव जय देव"
    },
    "शेंदुर लाल चढायो ": {
        "image" : "https://img.freepik.com/premium-photo/illustration-lord-ganesha-ganesh-chaturthi-with-background-ai-generated_852336-12730.jpg",
        "title": "शेंदुर लाल चढायो ",
        "story": "शेंदुर लाल चढ़ायो अच्छा गजमुखको,,दोंदिल लाल बिराजे सुत गौरि हरको,,हाथ लिए गुडलडू सांई सुरवरको,,महिमा कहे न जाये लागत हूं पदको,,जय जय जी गणराज विद्या सुखदाता,,धन्य तुम्हारो दर्शन मेरा मन रमता,,जय देव जय देव,,अष्टौ सिद्धि दासी संकटको बैरि,,विघ्नविनाशक मंगल मूरत अधिकारी,,कोटीसूरजप्रकाश ऐसी छबि तेरी,,गंडस्थलमदमस्तक झूले शशिबिहारि,,जय जय जी गणराज विद्या सुखदाता,,धन्य तुम्हारो दर्शन मेरा मन रमता,,जय देव जय देव,,भावभगत से कोई शरणागत आवे,,संतत संपत सबही भरपूर पावे,,ऐसे तुम महाराज मोको अति भावे,,गोसावीनंदन निशिदिन गुन गावे,,शेंदुर लाल चढ़ायो अच्छा गजमुखको,,दोंदिल लाल बिराजे सुत गौरि हरको,,हाथ लिए गुडलडू सांई सुरवरको,,महिमा कहे न जाये लागत हूं पदको,,जय जय जी गणराज विद्या सुखदाता,,धन्य तुम्हारो दर्शन मेरा मन रमता,,जय देव जय देव,,जय जय जी गणराज विद्या सुखदाता,,धन्य तुम्हारो दर्शन मेरा मन रमता,,जय देव जय देव,,जय जय जी गणराज विद्या सुखदाता,,धन्य तुम्हारो दर्शन मेरा मन रमता,,जय देव जय देव"
    }
};

const Bhajan = () => {
    const [selectedItem, setSelectedItem] = useState(Object.keys(data)[0]);

    // Handle dropdown change
    const handleChange = (itemValue) => {
        setSelectedItem(itemValue);
    };

    // Get selected data
    const selectedData = data[selectedItem];

    const storyLines = selectedData.story.split(',,').map(line => line.trim());

    // Function to handle speech
    const speakText = () => {
        Speech.speak(selectedData.story, {
            language: 'hi', // Set language to Hindi
            pitch: 1,
            rate: 1,
        });
    };

    return (
        <>
        <View style={styles.container}>
            <Picker
                selectedValue={selectedItem}
                onValueChange={handleChange}
                style={styles.picker}
            >
                {Object.keys(data).map((key) => (
                    <Picker.Item key={key} label={key} value={key} />
                ))}
            </Picker>
        <ScrollView style={styles.scrollView}>
                <Image source={{ uri: selectedData.image }} style={styles.image} />
                <Text style={styles.subtitle}>{selectedData.title}</Text>
                <TouchableOpacity onPress={speakText} >
                {storyLines.map((line, index) => (
                <Text key={index} style={styles.storyText}>{line}</Text>
                ))}
                </TouchableOpacity>
              </ScrollView>
                </View>
            <CustomBottomNavbar />
            </>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        padding: 16,
        backgroundColor: 'white',
        paddingBottom: 60,
    },
    scrollView: {
        flex: 1,
    },
    picker: {
        height: 50,
        width: '100%',
        marginBottom: 16,
    },
    contentContainer: {
        padding: 16,
        backgroundColor: '#f0f0f0',
        borderRadius: 8,
        borderWidth: 1,
        borderColor: '#ddd',
        flexGrow: 1,
    },
    image: {
        width: '100%',
        height: 300,
        borderRadius: 8,
        marginBottom: 10,
    },
    subtitle: {
        fontSize: 20,
        fontWeight: '600',
        textAlign: 'center',
        marginBottom: 10,
    },
    storyText: {
        marginTop: 10,
        fontSize: 16,
        color: '#333',
        marginBottom: 10,
    },
    button: {
        backgroundColor: '#4CAF50',
        padding: 10,
        borderRadius: 5,
        alignItems: 'center',
    },
    buttonText: {
        color: 'white',
        fontSize: 16,
    },
});

export default Bhajan;
