import React, { useState } from 'react';
import { View, Text, TouchableOpacity, StyleSheet, Image, ScrollView } from 'react-native';
import { Picker } from '@react-native-picker/picker'; // Updated import
import * as Speech from 'expo-speech'; // Importing expo-speech
import CustomBottomNavbar from '@/components/BottomNavbar';

// Sample JSON data
const data = {
  "दुर्गा कवच" : {
    "title" : "दुर्गा कवच",
    "image" : "https://w0.peakpx.com/wallpaper/405/133/HD-wallpaper-navratri-maa-durga-devotional-hindu-goddess-bhakti.jpg",
    "story" : "ॐ अस्य श्रीचण्डीकवचस्य ब्रह्मा ऋषिः अनुष्टुप् छन्दः, चामुण्डा देवता,  अंगन्यासोक्त्तमातरो बीजम्ए दिग्बन्धदेवतास्तत्त्वम्, स्तित्त्वम्, श्री जगदम्बाप्रीत्यर्थे  सप्तशतीपाठांगत्वेन जपे विनियोगः । मार्कण्डेय उवाच ॐ यद्गुह्यं परमं लोके सर्वरक्षाकरं नृणाम् । यन्न कस्यचिदाख्यातं तन्मे ब्रूहि पितामह ।। 1 ।। ब्रह्मोवाच अस्ति गुह्यतमं विप्र सर्वभूतोपकारकम् । देव्यास्तु कवचं पुण्यं तच्छृणुष्व महामुने।।2।। प्रथमं शैलपुत्री च द्वितीयं ब्रह्मचारिणी ।  तृतीयं चन्द्रघण्टेति कूष्माण्डेति चतुर्थकम् ।। 3 ।। पंचमं स्कन्दमातेति षष्ठं कात्यायनीति च । सप्तमं कालरात्रीति महागौरीति चाष्टमम् ।। 4 ।। नवमं सिद्धिदात्री च नवदुर्गाः प्रकीर्तिताः ।  उक्तान्येतानि नामानि ब्रह्मणैव महात्मना । ।5।। अग्निना दह्यमानस्तु शत्रुमध्ये गतो रणे। विषमे दुर्गमे चैव भयार्ताः शरणं गताः ।।6।। न तेषां जायते किंचिदशुभं रणसंकटे ।  नापदं तस्य पश्यामि शोकदुःखभयं न हि ।।7।। यैस्तु भक्त्या स्मृता नूनं तेषां वृद्धिः प्रजायते । ये त्वां स्मरन्ति देवेशि रक्षसे तान्न संशयः ।। 8 ।। प्रेतसंस्था तु चामुण्डा वाराही महिषासना।  ऐन्द्री गजसमारूढा वैष्णवी गरूडासना । ।9।। माहेश्वरी वृषारूढा कौमारी शिखिवाहना। लक्ष्मीः प‌द्मासना देवी पद्महस्ता हरिप्रिया।। 10 ।। श्वेतरूपधरा देवी ईश्वरी वृषवाहन ।  ब्राह्मी हंससमारूढा सर्वाभरणभूषिता । ।11 ।। इत्येता मातरः सर्वाः सर्वयोगसमन्विताः। नानाभरणशोभाढ्या नानारत्नोपशोभिताः । ।12।। दृश्यन्ते रथमारूढा देव्यः क्रोधसमाकुलाः ।  शंख चक्रं गदां शक्तिं हलं च मुसलायुधम् ।।13 ।। खेटकं तोमरं चैव परशुं पाशमेव च। कुन्तायुधं त्रिशूलं च शांर्गमायुधमुत्तमम् । ।14 ।। दैत्यानां देहनाशाय भक्तानामभयाय च।  घारयन्त्यायुधानीत्थं देवानां च हिताय वै।।15।। नमस्तेऽस्तु महारौद्रे महाघोरपराक्रमे । महाबले महोत्साहे महाभयविनाशिनि। | |16|| त्राहि मां देवि दुष्प्रेक्ष्ये शत्रुणां भयवर्धिनि ।  प्राच्यां रक्षतु मामैन्द्री आग्नेय्यामग्निदेवता । ।17 ।। दक्षिणेऽवतु वाराही नैर्ऋत्यां खड्गधारिणी। प्रतीच्यां वारुणी रक्षेद् वायव्यां मृगवाहिनी ।।18 ।। उदीच्यां पातु कौमारी ऐशान्यां शूलधारिणी।  ऊर्ध्वं ब्रह्माणि मे रक्षेदधस्ताद् वैष्णवी तथा।।19 ।। एवं दश दिशो रक्षेच्चामुण्डा शववाहना। जया मे चाग्रतः पातु विजया पातु पृष्ठतः । ।20 ।। अजिता वामपार्श्वे तु दक्षिणे चापराजिता।  शिखामुद्योतिनी रक्षेदुमा मूर्ध्नि व्यवस्थिता ।।21 || मालाधरी ललाटे च भ्रुवौ रक्षेद् यशस्विनी। त्रिनेत्रा च भ्रुवोर्मध्ये यमघण्टा च नासिके । | 22 || शखिनी चक्षुषोर्मध्ये श्रोत्रयोर्द्धारवासिनी । कपोलौ कालिका रक्षेत्कर्णमूले तु शांकरी।।23 ।। नासिकायां सुगन्धा च उत्तरोष्ठे च चर्चिका। अधरे चामृतकला जिह्वायां च सरस्वती ।।24 ।। दन्तान् रक्षतु कौमारी कण्ठदेशे तु चण्डिका । घण्टिकां चित्रघण्टा च महामाया च तालुके ।।25 ।। कामाक्षी चिबुकं रक्षेद् वाचं मे सर्वमंगला। ग्रीवायां भद्रकाली च पृष्ठवंशे धनुर्धरी ।।26 ।।  नीलग्रीवा बहिःकण्ठे नलिकां नलकूबरी।  स्कन्धयोः खड्गिनी रक्षेद् बाहू मे वज्रधारिणी । ।27 ।। हस्तयोर्दण्डिनी रक्षेदम्बिका चांगुलीषु च। नखाञ्छ्रुलेश्वरी रक्षेत्कुक्षौ रक्षेत्केश्वरी । ।28 || स्तनौ रक्षेन्महादेवी मनः शोकविनाशिनी। हृदये ललिता देवी उदरे शूलधारिणी।।29 ।।  नाभौ च कामिनी रक्षेद् गुह्यं गुह्येश्वरी तथा। पूतना कामिका मेद्रं गुदे महिषवाहिनी।।30 ।। कट्यां भगवती रक्षेज्जानुनी विन्ध्यवासिनी।  जंघे महाबला रक्षेत्सर्वकामप्रदायिनी।।31 ।। गुल्फयोर्नारसिंही च पादपृष्ठे तु तैजसी पादांगुलीषु श्री रक्षेत्पादाधस्तलवासिनी । । 32 || । नखान् दंष्ट्राकराली च केशांश्चैवोर्ध्वकेशिनी  रामकूपेषु कौबेरी त्वचं वागीश्वरी तथा । ।33 ।। रक्तमज्जावसामांसान्यस्थिमेदांसि पार्वती । अन्त्राणि कालरात्रिश्च पित्तं च मुकुटेश्वरी।।34 ।। प‌द्मावती पद्मकोशे कफे चूडामणिस्तथा ।  ज्वालामुखी नखज्वालामभेद्या सर्वसंधिषु ।।35 ।। शुक्रं ब्रह्माणि मे रक्षेच्छायां छत्रेश्वरी तथा। अहंकारं मनो बुद्धिं रक्षेन्मे धर्मधारिणी ।।36 || प्राणापानौ तथा व्यानमुदानं च समानकम्। वज्रहस्ता च मे रक्षेत्प्राणं कल्याणशोभना । ।37 ।। रसे रूपे च गन्धे च शब्दे स्पर्शे च योगिनी। सत्त्वं रजस्तमश्चैव रक्षेन्नारायणी सदा । ।38 ।। आयू रक्षतु वाराही धर्म रक्षतु वैष्णवी ।  यशः कीर्ति च लक्ष्मीं च धनं विद्यां च चक्रिणी।।39 ।। गोत्रमिन्द्राणि मे रक्षेत्पशून्मे रक्ष चण्डिके। पुत्रान् रक्षेन्महालक्ष्मीर्भार्या रक्षतु भैरवी । । 40 ।। पन्थानं सुपथा रक्षेन्मार्ग क्षेमकरी तथा। राजद्वारे महालक्ष्मीविर्जया सर्वतः स्थिता । ।41 ।। रक्षाहीनं तु यत्स्थानं वर्जितं कवचेन तु। तत्सर्वं रक्ष मे देवि जयन्ती पापनाशिनी ।।42 ।। पदमेकं न गच्छेत्तु यदीच्छेच्छुभमात्मनः ।  कवचेनावृतो नित्यं यत्र यत्रैव गच्छति । ||43 तत्र तत्रार्थलाभश्च विजयः सार्वकामिकः । यं यं चिन्तयते कामं तं तं प्राप्नोति निश्चितम्। परमेश्वर्यमतुलं प्राप्स्यते भूतले पुमान्।।44।। निर्भयो जायते मर्त्यः संग्रामेष्वपराजितः ।  त्रैलोक्ये तु भवेत्पूज्यः कवचेनावृतः पुमान् । ।45 || इदं तु देव्याः कवचं देवानामपि दुर्लभम्। यः पठेत्प्रयतो नित्यं त्रिसन्ध्यं श्रद्धयान्वितः । ।46 ।। दैवी कला भवेत्तस्य त्रैलोक्येष्वपराजितः ।  जीवेद् वर्षशतं साग्रमपमृत्युविवर्जितः । ।47 ।। नश्यन्ति व्याधयः सर्वे लूताविस्फोटकदयः । स्थावरं जंगमं चैव कृत्रिमं चापि यद्विषम् ।।48।। अभिचारिणि सर्वाणि मन्त्रयन्त्राणि भूतले ।  भूचराः खेचराश्चैव जलजाश्चोपदेशिकाः । ।49 || सहजा कुलजा माला डाकिनी शाकिनी तथा। अन्तरिक्षचा घोरा डाकिन्यश्च महाबलाः । ।50 ।। ग्रहभूतपिशाचाश्च यक्षगन्धर्वराक्षसाः ।  ब्रह्मराक्षसवेतालाः कूष्माण्डा भैरवादयः । ।51 ।। नश्यन्ति दर्शनात्तस्य कवचे हृदि संस्थिते । मानोन्नतिर्भवेद् राज्ञस्तेजोवृद्धिकरं परम् ।।52 ।। यशसा वर्धते सोऽपि कीर्तिमाण्डितभूतले ।  जपेत्सप्तशतीं चण्डीं कृत्वा तु कवचं पुरा ।। 53 || यावद्भमण्डलं धत्ते सशैलवनकाननम्। तावत्तिष्ठति मेदिन्यां संततिः पुत्रपौत्रिकी । । 54 ।। देहान्ते परमं स्थानं यत्सुरैरपि दुर्लभम् । प्राप्नोति पुरुषो नित्यं महामायाप्रसादतः ।। 55 || लभते परमं रूपं शिवेन सह मोदते ।। ऊँ ।।56 || "
},
" लक्ष्मी स्त्रोतम " : {
    "title" : "लक्ष्मी स्त्रोतम ",
    "image" : "https://t3.ftcdn.net/jpg/05/82/68/88/360_F_582688840_I1Hdnq02BwUl6gewoWLxoCWtCP4OINjQ.jpg",
    "story" : "त्वं सिद्धिस्त्वं स्वधा स्वाहा सुधा त्वं लोकपावनी । सन्ध्या रात्रिः प्रभा भूतिर्मेधा श्रद्धा सरस्वती ।। 1। यज्ञविद्या महाविद्या गुह्यविद्या च शोभने आत्मविद्या च देवि त्वं विमुक्तिफलदायिनी ।। 2। आन्वीक्षिकी त्रयीवार्ता दण्डनीतिस्त्वमेव च। सौम्यासौम्यैर्जगद्रूपैस्त्वयैत्तद्देवि पूरितम् ।। 3। का त्वन्या त्वामृते देवि सर्वयज्ञमयं वपुः  अध्यास्ते देवदेवस्य योगिचिन्त्यं गदाभृतः ।। 41 त्वया देवि परित्यक्तं सकलं भुवनत्रयम्। विनष्टप्रायं भवत्वयेदानीं समेधितम् ।। 5 । दाराः पुत्रास्तथागार सुहृद्धान्यधनादिकम्  भवत्येतन्महाभागे नित्यं त्वद्वीक्षणान्नृणाम् ।। 61 शरीरारोग्यमैश्वर्यमरिपक्षक्षयः सुखम् । देवि त्वदृष्टिदृष्टानां पुरुषाणा वाणा न दुर्लभम् ।। 7 । त्वं माता सर्वलोकानां देवदेवो हरिः पिता  त्वयैतद्विष्णुना चाम्ब जगद्व्याप्तं चराचरम् ।। 8| मा नः कोशं तथा गोष्ठ मा गृहं मा परिच्छदम्   मा शरीरं कलत्रं च त्यजेथाः सर्वपावनि ।। 9। मा पुत्रान्मा सुहृद्वर्ग मा पशून्मा विभूषणम्  त्यजेथा मम देवस्य विष्णोर्वक्षः स्थलालये ।। 10 | सत्वेन सत्यशौचाभ्यां तथा शीलादिभिर्गुणैः । त्यज्यन्ते ते नराः सद्यः सन्त्यक्ता ये त्वयामले ।। 11 | त्वया विलोकिताः सद्यः शीलाद्यैरखिलैर्गुणैः  कुलैश्वर्यैश्च युज्यन्ते पुरुषा निर्गुणा अपि ।। 121 स श्लाघ्यः स गुणी धन्यः स कुलीनः स बुद्धिमान् । स शूरः स च विक्रान्तो ।। 13। सद्यो वैगुण्यमायान्ति शीलाद्याः सकला गुणाः  पराङ्‌मुखी जगद्धात्री यस्य त्वं ।। 14 । न ते वर्णयितुं शक्ता गुणांजह्वापि वेधसः । प्रसीद देवि पद्माक्षि मास्मांस्त्याक्षीः कदाचन ।। 15।। ।"
},
"कनकधारा स्त्रोत " :{
    "title" : "कनकधारा स्त्रोत  ",
    "image" : "https://upload.wikimedia.org/wikipedia/commons/3/30/Lalita_sm.JPG",
    "story" : "अङ्ग हरेः पुलकभूषणमाश्रयन्ती भृङ्गाङ्गनेव मुकुलाभरणं तमालम् । अङ्गीकृताखिलविभूतिरपाङ्गलीला मांगल्यदाऽस्तु मम मङ्गलदेवतायाः । ।। । मुग्धा मुहुर्विदधती वदने मुरारेः प्रेमत्रपाप्रणिहितानि गतागतानि । माला दृशोर्मधुकरीव महोत्पले या सा मे श्रियं दिशतु सागरसम्भवायाः । ।2। विश्वामरेन्द्रपदविभ्रमदानदक्षमानन्दहेतुरधिकं मुरविद्विषोऽपि । ईषन्निषीदतु मयि क्षणमीक्षणार्धमिन्दीवरोदरसहोदरमिन्दिरायाः । ।3 । आमीलिताक्षमधिगम्य मुदा मुकुन्दमानन्दकन्दमनिमेषमनङ्गतन्त्रम् । आकेकरस्थितकनीनिकपक्ष्मनेत्रं भूत्यै भवेन्मम भुजधैँशयाङ्गनायाः । ।4। बाह्वन्तरे मधुजितः श्रितकौस्तुभे या हारावलीव हरिनीलमयी विभाति । कामप्रदा भगवतोऽपि कटाक्षमाला कल्याणमावहतु मे कमलालयायाः ।। 5 । कालाम्बुदालिललितोरसि कैटभारेर्धाराधरे स्फुरति या तडिदङ्गनेव । मातुः समस्तजगतां महनीयमूर्तिर्भद्राणि मे दिशतु भार्गवनन्दनायाः । ।6। प्राप्तं पदं प्रथमतः किल यत्प्रभावान्माङ्गल्यभाजि मधुमाथिनि मन्मथेन । मय्यापतेत्तदिह मन्थरमीक्षणार्धं मन्दालसं च मकरालयकन्यकायाः । ।7 । दद्याद्दयानुपवनो द्रविणाम्बुधारामस्मिन्नकिंचनविहङ्गशिशौ विषण्णे । दुष्कर्मधर्ममपनीय चिराय दूरं नारायणप्रणयिनीनयनाम्बुवाहः । । 8 । इष्टा विशिष्टमतयोऽपि यया दयार्द्रदृष्ट्या त्रिविष्टपपदं सुलभं लभन्ते । दृष्टिः प्रहृष्टकमलोदरदीप्तिरिष्टां पुष्टिं कृषीष्ट मम पुष्करविष्टरायाः ।।9।  गीर्देवतेति गरुडध्वजसुन्दरीति शाकम्भरीति शशिशेखरवल्लभेति। सृष्टि स्थितिप्रलयकेलिषु संस्थितायै तस्यैनमस्त्रिभुवनैकगुरोस्तरुण्यै  श्रुत्यै नमोऽस्तु शुभकर्मफलप्रसूत्यै रत्यै नमोऽस्तु रमणीयगुणार्णवायै  शक्यै नमोऽस्तु शतपत्रनिकेतनायै पुष्ट्यै नमोऽस्तु पुरुषोत्तमवल्लभायै । ।1। नमोऽस्तु नालीकनिभाननायै नमोऽस्तु दुग्धोदधिजन्मभूत्यै। नमोऽस्तु सोमामृतसोदरायै नमोऽस्तु नारायणवल्लभायै ।।12। सम्पत्काराणि सकलेन्द्रियनन्दनानि साम्राज्यदानविभवानि सरोरुहाक्षि  त्वद्वन्दनानि दुरिताहरणोद्यतानि मामेव मातरनिशं कलयन्तु मान्ये ।।13। यत्कटाक्षसमुपासनाविधिः सेवकस्य सकलार्थसम्पदः   संतनोति वचनाङ्ग‌मानसैस्त्वां मुरारिहृदयेश्वरीं भजे ।।14। सरसिजनिलये सरोजहस्ते धवलतमांशुकगन्धमाल्यशोभे । भगवति हरिवल्लभे मनोज्ञे त्रिभुवनभूतिकरि प्रसीद मह्यम् ।।15। दिग्धस्तिभिः कनककुम्भमुखावसृष्टस्वर्वाहिनीविमलचारुजलप्लुताङ्गीम् । प्रातर्नमामि जगतां जननीमशेषलोकाधिनाथगृहिणीममृताब्धिपुत्रीम् । ।16 । कमले कमलाक्षवल्लभे त्वं करुणापूरतरङ्गितैरपाङ्गैः। अवलोकय मामकिंचनानां प्रथमं पात्रमकृत्रिमं दयायाः ।।17 । स्तुवन्ति ये स्तुतिभिरमूभिरन्वहं त्रयीमयीं त्रिभुवनमातरं रमाम्। गुणाधिका गुरुतरभाग्यभागिनो भवन्ति ते भुवि बुधभाविताशयाः ।।18 । ।। इति श्रीकनकधारा लक्ष्मीस्तोत्रम् ।।"
},
"अन्नपूर्णा स्त्रोत " :{
    "title" : "अन्नपूर्णा स्त्रोत",
    "image" : "https://www.templepurohit.com/wp-content/uploads/2016/09/Goddess-Annapurna-Story-Hindu-God-of-Food.jpghttps://www.templepurohit.com/wp-content/uploads/2016/09/Goddess-Annapurna-Story-Hindu-God-of-Food.jpg",
    "story" : "नित्यानन्दकरी वराभयकरी सौन्दर्यरत्नाकरी। निर्धूताखिलघोरपावनकरी प्रत्यक्षमाहेश्वरी । प्रालेयाचलवंशपावन करी काशीपुराधीश्वरी। भिक्षां देहि कृपावलम्बनकरी मातान्नपूर्णेश्वरी ।। भिक्षां देहि. ।। 1 । नानारत्नविचित्रभूषणकरी हेमाम्बराडम्बरी । मुक्ताहारविलम्बमानविलसद्वक्षोजकुम्भान्तरी । काश्मीरागरुवासितांगरुचिरे काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 2। योगानन्दकरी रिपुक्षयकरी धर्मार्थनिष्ठाकरी चन्द्रार्कानलभासमानलहरी त्रैलोक्यरक्षाकरी । सर्वेश्वर्यसमस्तवान्छितकरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 3 । कैलासाचलकन्दरालयकरी गौरी उमा शंकरी कौमारी निगमार्थगोचरकरी ओंकारबीजाक्षरी । मोक्षद्वारकपाटपाटनकरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 4। दृश्यादृश्यविभूतिवाहनकरी ब्रह्माण्डभाण्डोदरी लीलानाटकसूत्रभेदनकरी विज्ञानदीपांकुरी। श्रीविश्वेशमनः प्रसादनकरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 5। उर्वीसर्वजनेश्वरी भगवती मातान्नपूर्णेश्वरी वेणीनीलसमानकुन्तलहरी नित्यान्नदानेश्वरी। सर्वानन्दकरी सदा शुभकारी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 6। आदिक्षान्तसमस्तवर्णनकरी शम्भोस्त्रिभावाकरी काश्मीरात्रिजलेश्वरी त्रिलहरी नित्यांकुरा शर्वरी कामाकाङ्‌क्षकरी जनोदयकरी काशीपुराधीश्वरी ।। भिक्षां देहि ।।  देवी सर्वविचित्ररत्नरचिता दाक्षायणी सुन्दरी। वामं स्वादु पयोधरप्रियकरी सौभाग्यमाहेश्वरी । भक्ताभीष्टकरी सदाशुभकरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 8 । चन्द्रार्कानलकोटिकोटिसदृशा चन्द्रांशुबिम्बाधरी चन्द्रार्काग्निसमानकुन्तलधरी चन्द्रार्कवर्णेश्वरी  मालापुस्तक पाशसांकुशधरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। १ ।। क्षत्रत्राणकरी महाऽभवकरी माता कृपासागर साक्षान्मोक्षकरी सदा शिवकरी विश्वेश्वरश्रीधरी । दक्षाक्रन्दकरी निरामयकरी काशीपुराधीश्वरी ।। भिक्षां देहि. ।। 10 । अन्नपूर्णे सदापूर्ण शंकरप्राणवल्लभे । ज्ञानवैराग्यसिद्धयर्थं भिक्षां देहि च पार्वति ।। भिक्षां देहि. ।। 11 | माता च पार्वती देवी पिता देवो महेश्वरः । बान्धवाः शिवभक्ताश्च स्वदेशो भुवनत्रयम् ।। भिक्षां देहि. ।। 12।।"
},
"संतानगोपाल स्तोत्रम्" : {
    "title" : "संतानगोपाल स्तोत्रम्",
    "image" : "https://pujayagna.com/cdn/shop/products/santan-gopal-homa2_1024x1024.jpg?v=1568703289",
    "story" : "श्रीशं कमलपत्राक्षं देवकीनन्दनं हरिम् । सुतसम्प्राप्तये कृष्णं नमामि मधुसूदनम् ।।नमाम्यहं वासुदेवं सुतसम्प्राप्तये हरिम् ।यशोदांकगतं बालं गोपालं नन्दनन्दनम् ।।अस्माकं पुत्रलाभाय गोविन्दं मुनिवन्दितम्।नमाम्यहं वासुदेवं देवकीनन्दनं सदा ।।गोपालं डिम्बकं वन्दे कमलापतिमच्युतम् ।पुत्रसम्प्राप्तये कृष्णं नमामि यदुपुंगवम् ।।पुत्रकामेष्टिफलदं कप्रजाक्ष कमलापतिम् । देवकीनन्दनं वन्दे सुतसम्प्राप्तये मम। पद्मापते पद्मनेत्र पद्मनाभ जनार्दन। देहि मे तनयं श्रीश वासुदेव जगत्पते।यशोदांकगतं बालं गोविन्दं मुनिवन्दितम् ।अस्माकं पुत्रलाभाय नमामि श्रीशमच्युतम्।श्रीपते देवदेवेश दीनार्तिहरणाच्युत ।गोविन्द मे सुतं देहि नमामि त्वां जनार्दन।भक्तकामद गोविन्द भक्तं रक्षशुभप्रद । देहि मे तनय कृष्णं रुक्मिणीवल्लभ प्रभो ।। रुक्मिणीनाथ सर्वेश देहिमे तनयं सदा।भक्तमन्दार प‌द्माक्ष त्वामहं शरणं गतः ।।देवकीसुत गोविन्द वासुदेव जगत्पते।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।वासुदेव जगद्वन्द्य श्रीपते पुरुषोत्तम।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।कप्रजाक्ष कमलानाथ परकारुणिकोत्तम ।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।लक्ष्मीपते पद्मनाभ मुकुन्द मुनिवन्दित। देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।कार्यकारणरूपाय वासुदेवाय ते सदा।नमामि पुत्रलाभार्थं सुखदाय बुधाय ते ।।राजीवनेत्र श्रीराम रावणारे हरे कवे।तुभ्यं नमामि देवेश तनयं देहि मे हरे।।अस्माकं पुत्रलाभाय भजामि त्वां जगत्पते ।देहि मे तनयं कृष्ण वासुदेव रमापते ।। श्रीमानिनीमानचोर गोपीवस्त्रापहारक। देहि मे तनयं कृष्ण वासुदेव जगत्पते ।।अस्माकं पुत्रसम्प्राप्तिं कुरुष्व यदुनन्दन।रमापते वासुदेव मुकुन्द मुनिवन्दित् ।।वासुदेव सुतं देहि तनयं देहि माधव।पुत्रं मे देहि श्रीकृष्ण वत्सं देहि महाप्रभो ।।डिम्भकं देहि श्रीकृष्ण आत्मजं देहि राघव ।भक्तमन्दार मे देहि तनयं नन्दनन्दन ।। नन्दनं देहि मे कृष्ण वासुदेव जगत्पते।कमलनाथ गोविन्द मुकुन्द मुनिवन्दित ।।अन्यथा शरणं नास्ति त्वमेव शरणं मम।सुतं देहि श्रियं देहि पुत्रं प्रदेहि मे ।।यशोदास्तन्यपानज्ञं पिबन्तं यदुनन्दनम्।वन्देऽहं पुत्रलाभार्थ कपिलाक्षं हरिं सदा ।।नन्दनन्दन देवेश नन्दनं देहि मे प्रभो ।रमापते वासुदेव श्रियं पुत्रं जगत्पते ।। पुत्रं श्रियं श्रियं पुत्रं पुत्रं मे देहि माधव।अस्माकं दीनवाक्यस्य अवधारय श्रीपते ।।गोपालडिम्भ गोविन्द वासुदेव रमापते।अस्माकं डिम्भकं देहि श्रियं देहि जगत्पते ।।मनोवांछितफलं देहि देवकीनन्दनाच्युत।मम पुत्रार्थितं धन्यं कुरुष्व यदुनन्दन ।।याचेऽहं त्वां श्रियं पुत्रं देहिमे पुत्रसम्पदम् ।भक्तचिन्तामणे रामकल्पवृक्ष महाप्रभो ।।आत्मजं नन्दनं पुत्रं कुमारं डिम्भकं सुतम्।अर्भकं तनयं देहि सदा मे रघुनन्दन ।।वन्दे सन्तानगोपालं माधवं भक्तकामदम् ।अस्माकं पुत्रसम्प्राप्त्यै सदा गोविन्दमच्युतं ।।ओंकारयुक्तं गोपालं श्रीयुक्तं यदुनन्दनम्।क्लींयुक्तं देवकीपुत्रं नमामि यदुनायकम् ।।वासुदेव मुकुन्देश गोविन्द माधवाच्युत।देहि मे तनयं कृष्ण रमानाथ महाप्रभो ।।राजीवनेत्र गोविन्द कपिलाक्ष हरे प्रभो। समस्तकाम्यवरद देहि मे तनयं सदा ।।अब्जपद्मनिभं पद्मवृन्दरूप जगत्पते।देहि मे वरसत्पुत्रं रमानायक माधव ।।नन्दपाल धरापाल गोविन्द यदुनन्दन ।देहि मे तनयं कृष्ण रुक्मिणीवल्लभ प्रभो ।।दासमन्दार गोविन्द मुकुन्द माधवाच्युत ।गोपाल पुण्डरीकाक्ष देहिमे तनयं श्रियम् ।।यदुनायक पद्मेश नन्दगोपवधूसुत । देहि मे तनयं कृष्ण श्रीधर प्राणनायक ।।अस्माकं वाप्रिछतं देहि देहि पुत्रं रमापते।भगवन् कृष्ण सर्वेश वासुदेव जगत्पते ।।रमॉदयसम्भार सत्यभामामनःप्रिय ।देहि मे तनयं कृष्ण रुक्मिणीवल्लभ प्रभो ।।चन्द्रसूर्याक्ष गोविन्द पुण्डरीकाक्ष माधव । अस्माकं भाग्यसत्पुत्रं देहि देव जगत्पते ।। कारुण्यरूप प‌द्माक्ष पद्मनाभसमर्चित । देहि मे तनयं कृष्ण देवकीनन्दनन्दन ।।देवकीसुत श्रीनाथ वासुदेव जगत्पते।समस्तकामफलद देहि मे तनयं सदा ।।भक्तमन्दार गम्भीर शंकराच्युत माधव।देहि मे तनयं गोपबालवत्सल श्रीपते ।।श्रीपते वासुदेवेश देवकीप्रियनन्दन ।भक्तमन्दार मे देहि तनयं जगतां प्रभो ।।जगन्नाथ रमानाथ भूमिनाथ दयानिधे ।वासुदेवेश सर्वेश देहि मे तनयं प्रभो ।।श्रीनाथ कमलपत्राक्ष वासुदेव जगत्पते।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।दासमन्दार गोविन्द भक्तचिन्तामणे प्रभो।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।गोविन्द पुण्डरीकाक्ष रमानाथ महाप्रभो।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।श्रीनाथ कमलपत्राक्ष गोविन्द मधुसूदन ।मत्पुत्रफलसिद्धयर्थं भजामि त्वां जनार्दन ।।स्तन्यं पिबन्तं जननीमुखाम्बुजं विलोक्य मन्दस्मितमुज्जवलांगम् ।स्पृशन्तमन्यस्तनमंगुलीभिर्वन्दे यशोदांकगतं मुकुन्दम् ।।याचेऽहं पुत्रसन्तानं भवन्तं पद्मलोचन ।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।अस्माकं पुत्रसम्पत्तेश्चिन्तयामि जगत्पते। शीघ्र मे देहि दातव्यं भवता मुनिवंदित ।।वासुदेव जगन्नाथ श्रीपते पुरुषोत्तम । कुरु मां पुत्रदत्तं च कृष्ण देवेन्द्रपूजित ।।कुरु मां पुत्रदत्तं च यशोदाप्रियनन्दन ।मह्यं च पुत्रसंतानं दातव्यं भवता हरे ।।वासुदेव जगन्नाथ गोविन्द देवकीसुत ।देहि मे तनयं राम कौसल्याप्रियनन्दन ।।पद्मपत्राक्ष गोविन्द विष्णो वामन माधव । देहि मे तनयं सीताप्राणनायक राघव ।। कप्रजाक्ष कृष्ण देवेन्द्रमण्डित मुनिवन्दित । लक्ष्मणाग्रज श्रीराम देहि मे तनयं सदा ।।देहि मे तनयं राम दशरथप्रियनन्दन ।सीतानायक कप्रजाक्ष मुचुकुन्दवरप्रद ।।विभीषणस्य या लंका प्रदत्ता भवतापुरा।अस्माकं तत्प्रकारेण तनयं देहि माधव ।।भवदीयपदाम्भोजे चिन्तयामि निरन्तरम् । देहि मे तनयं सीताप्राणवल्लभ राघव ।। राम मत्काम्यवरद पुत्रोत्पत्तिफलप्रद । देहि मे तनयं श्रीश कमलासनवन्दित ।।राम राघव सीतेश लक्ष्मणानुज देहि मे।भाग्यवत्पुत्रसंतानं दशरथात्मज श्रीपते ।।देवकीगर्भसंजात यशोदाप्रियनन्दन ।देहि मे तनयं राम कृष्ण गोपाल माधव ।।कृष्ण माधव गोविन्द वामनाच्युत शंकर। देहि मे तनयं श्रीश गोपबालनायक ।। गोपबाल महाधन्य गोविन्दाच्युत माधव। देहि मे तनयं कृष्ण वासुदेव जगत्पते ।।दिशतु दिशतु पुत्रं देवकीनन्दनोऽयं ।दिशतु दिशतु शीघ्र भाग्यवत्पुत्रलाभम् ।।दिशतु दिशतु श्रीशो राघवो रामचन्द्रो ।दिशतु दिशतु पुत्रं वंशविस्तारहेतोः ।।दीयतां वासुदेवेन तनयो मत्प्रियः सुतः । कुमारो नन्दनः सीतानायकेन सदा मम ।। राम राघव गोविन्द देवकीसुत माधव। देहि मे तनयं श्रीश गोपबालनायक ।।वंशविस्तारकं पुत्रं देहि मे मधुसूदन ।सुतं देहि सुतं देहि त्वामहं शरणं गतः ।।ममाभीष्टसुतं देहि कंसारे माधवाच्युत।सुतं देहि सुतं देहि त्वामहं शरणं गतः ।।चन्द्रार्ककल्पपर्यन्तं तनयं देहि माधव। सुतं देहि सुतं देहि त्वामहं शरणं गतः ।।विद्यावन्तं बुद्धिमन्तं श्रीमन्तं तनयं सदा। देहि मे तनयं कृष्ण देवकीनन्दन प्रभो ।।नमामि त्वां पद्मनेत्र सुतलाभाय कामदम।मुकुन्दं पुण्डरीकाक्षं गोविन्दं मधुसूदनम् ।।भगवन् कृष्ण गोविन्द सर्वकामफलप्रद।देहि मे तनयं स्वामिंस्त्वामहं शरणं गतः ।।स्वामिंस्तवं भगवन रामकृष्णमाधव कामद । देहि मे तनयं नित्यं त्वामहं शरणं गतः ।। तनयं देहि गोविन्द कप्रजाक्ष कमलापते । सुतं देहि सुतं देहि त्वामहं शरणं गतः ।।पद्मापते पद्मनेत्र प्रद्युम्नजनक प्रभो।सुतं देहि सुतं देहि त्वामहं शरणं गतः ।।शंखचक्रगदाखड्गशांर्गपाणे रमापते।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।नारायण रमानाथ राजीवपत्रलोचन । सुतं मे देहि देवेश पद्मपद्द्मानुवन्दित ।। रामराघव गोविन्द देवकीवरनन्दन । रुक्मिणीनाथ सर्वेश नारदादिसुरार्चित ।।देवकीसुत गोविन्द वासुदेव जगत्पते।देहि मे तनयं श्रीश गोपबालनायक ।।मुनिवन्दित गोविन्द रुक्मिणीवल्लभ प्रभो।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।गोपिकार्जितपंकेजमरन्दासक्तमानस ।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।रमॉदयपंकेजलोल माधव कामद। ममाभीष्टसुतं देहि त्वामहं शरणं गतः ।।वासुदेव रमानाथ दासानां मंगलप्रद।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।कल्याणप्रद गोविन्द मुरारे मुनिवन्दित ।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।पुत्रप्रद मुकुन्देश रुक्मिणीवल्लभ प्रभो । देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।। पुण्डरीकाक्ष गोविन्द वासुदेव जगत्पते। देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।दयानिधे वासुदेव मुकुन्द मुनिवन्दित ।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।पुत्रसम्पत्प्रदातारं गोविन्दं देवपूजितम् ।वन्दामहे सदा कृष्ण पुत्रलाभप्रदायिनम् ।।कारुण्यनिधये गोपीवल्लभाय मुरारये। नमस्ते पुत्रलाभार्थ देहि मे तनयं विभो ।। नमस्तस्मै रमेशाय रुकिमणीवल्लभाय ते। देहि मे तनयं श्रीश गोपबालनायक ।।नमस्ते वासुदेवाय नित्यश्रीकामुकाय च।पुत्रदाय च सर्पेन्द्रशायिने रंगशायिने ।।रंगशायिन् रमानाथ मंगलप्रद माधव।देहि मे तनयं श्रीश गोपबालनायक ।।दासस्य मे सुतं देहि दीनमन्दार राघव । सुतं देहि सुतं देहि पुत्रं देहि रमापते ।। यशोदातनयाभीष्टपुत्रदानरतः सदा। देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।मदिष्टदेव गोविन्द वासुदेव जर्नादन।देहि मे तनयं कृष्ण त्वामहं शरणं गतः ।।नीतिमान् धनवान् पुत्रो विद्यावांश्च प्रजायते ।भगवंस्त्वकृपायाश्च वासुदेवेन्द्रपूजित ।। 1यः पठेत् पुत्रशतकं सोऽपि सत्पुत्रवान् भवेत।श्रीवासुदेवकथितं स्तोत्ररत्नं सुखाय च।। जपकाले पठेन्नित्यं पुत्रलाभं धनं श्रियम् । ऐश्वर्य राजसम्मान सद्यो याति न संशयः ।।"
},
"अथ नवग्रहस्तोत्रम्" :{
    "title" : "अथ नवग्रहस्तोत्रम्",
    "image" : "https://i.pinimg.com/236x/39/d1/1e/39d11ee43c1bf3a86b3bb03a0352304a.jpg",
    "story" : "ओं ब्रह्मा मुरारिस्त्रिपुरान्तकारी भानुः शशी भूमिसुतो बुधश्च। गुरुश्च शुक्रः शनिराहुकेतवः सर्वे ग्रहाः शान्तिकराभवन्तु ।। जपाकुसुमस‌ङ्काशं काश्यपेयं महाद्युतिम् ।  तमोऽरिं सर्वपापघ्नं प्रणतोऽस्मि दिवाकरम् ।।1।। दधिशङ्खतुषाराभं क्षीरोदार्णवसम्भवम् । नमामि शशिनं भक्त्या शम्भोर्मुकुटभूषणम् ।।2।। धरणीगर्भसम्भूतं विद्युत्कान्तिसमप्रभम् ।  कुमारं शक्तिहस्तं तं मङ्गलं प्रणमाम्यहम् ।। 3 ।। प्रियङ्‌गुकलिकाश्यामं रूपेणाप्रतिमं बुधम्। सौम्यं सौम्यगुणोपेतं तं बुधं प्रणमाम्यहम् ।।4।। देवानां च ऋषीणां च गुरुं कांचनसन्निभम् ।  बुद्धिभूतं त्रिलोकेशं तं नमामि बृहस्पतिम् । ।5।। हिमकुन्दमृणालाभं देत्यानां परमं गुरुम्। सर्वशास्त्रप्रवक्तारं भार्गवं प्रणमाम्यहम् ।।6।। नीलांजनसमाभासं रविपुत्रं यमाग्रजम् ।  छायामार्तण्डसम्भूतं तं नमामि शनैश्चरम् । ।7 ।। अर्धकायं महावीर्यं चन्द्रादित्यविमर्दनम् । सिंहिकागर्भसम्भूतं तं राहुं प्रणमाम्यहम्।।8।। पलाशपुष्पस‌ङ्काशं तारकाग्रहमस्तकम्।  रौद्रं रौद्रात्मकं घोरं तं केतुं प्रणमाम्यहम्।।9।। इति व्यासमुखोद्‌गीतं यः पठेत् सुसमाहितः। दिवा वा यदि वा रात्रौ विघ्नशान्तिर्भविष्यति । ।10।। नरनारीनृपाणां च भवेद् दुःस्वप्ननाशनम् । ऐश्वर्यमतुलं तेषामारोग्यं पुष्टिवर्धनम् । ।11।। ग्रहनक्षत्रजाः पीडास्तस्कराऽग्निसमुद्भवाः । ताः सर्वाः प्रशमं यान्ति व्यासो ब्रूते न संशयः ।।12 || ।। इति व्यासविरचितं नवग्रहस्तोत्रम् सम्पूर्णम् ।। "
},
"आदित्य हृदय स्तोत्रम्" : {
    "title" : "आदित्य हृदय स्तोत्रम्",
    "image" : "https://i.pinimg.com/236x/f5/45/eb/f545eb0767fd4a8754a13292f78d80a9.jpg",
    "story" : "ततो युद्धपरिश्रान्तं समरे चिन्तया स्थितम् । रावणं चाग्रतो दृष्ट्वा युद्धाय समुपस्थितम् ।। 1 ।। दैवतैश्च समागम्य द्रष्टुमभ्यागते रणम् । उपागम्याब्रवीद्राममगस्त्यो भगवांस्तदा ।। 2 ।। राम राम महाबाहो ! शृणु गुह्यं सनातनम् । येन सर्वानरीन्वत्स ! समरे विजयिष्यसे । ।3।। आदित्यहृदयं पुण्यं सर्वशत्रुविनाशनम् । जयावहं जपं नित्यमक्षयं परमं शिवम् ।।4।। सर्वमङ्गलमाङ्गल्यं सर्वपापप्रणाशनम् । चिन्ताशोकप्रशमनमायुर्वर्धनमुत्तमम् । ।5।। रश्मिमन्तं समुद्यन्तं देवासुरनमस्कृतम् । पूजयस्व विवस्वन्तं भास्करं भुवनेश्वरम् । ।6।। सर्वदेवात्मको ह्येष तेजस्वी रश्मिभावनः । एष देवासुरगणांल्लोकान्पाति गभस्थिभिः ।।7 ।। एष ब्रह्मा च विष्णुश्च शिवः स्कन्दः प्रजापतिः । महेन्द्रो धनदः कालो यमः सोमो ह्यपाम्पतिः । ।8।। पितरो वसवः साध्या अश्विनौ मरुतो मनुः । वायुर्वह्निः प्रजाः प्राण ऋतुकर्ता प्रभाकरः ।।9 || आदित्यः सविता सूर्यः खगः पूषा गभस्तिमान् । सुर्वणसदृशो भानुर्हिरण्यरेता दिवाकरः । ।10।। हरिदश्वः सहस्रार्चिः सप्तसप्तिर्मरीचिमान् । तिमिरोन्मथनः शम्भुस्त्वष्टा मार्तण्डकोंऽशुमान् । ।11 । । हिरण्यगर्भः शिशिरस्तपनोऽहस्करो रविः । अग्निगर्भोऽदितेः पुत्रः शङ्खः शिशिरनाशनः ।।12।। व्योमनाथस्तमोभेदी ऋग्यजुः सामपारगः । घनवृष्टिरपां मित्रो विन्ध्यवीथीप्लवङ्गमः । ।13 || आतपी मण्डली मृत्युः पिङ्गलः सर्वतापनः । कविर्विश्वो महातेजा रक्तः सर्वभवोद्भवः । । 14 ।। नक्षत्रग्रहताराणामधिपो विश्वभावनः । तेजसामपि तेजस्वी द्वादशात्मन्नमोऽस्तु ते ।।15 || नमः पूर्वाय गिरये पश्चिमायाद्रये नमः । ज्योतिर्गणानां पतये दिनाधिपतये नमः ।।16 ।। जयाय जयभद्राय हर्यश्वाय नमो नमः । नमो नमः सहस्रांशो! आदित्याय नमो नमः ।।17 ।। नमः उग्राय वीराय सारौंय नमो नमः । नमः पद्मप्रबोधाय प्रचण्डाय नमोऽस्तु ते ।।18 || ब्रह्मेशानाच्युतेशाय सूरायादित्यवर्चसे । भास्वते सर्वभक्षाय रौद्राय वपुषे नमः ।।19 ।। तमोघ्नाय हिमघ्नाय शत्रुघ्नायामितात्मने । कृतघ्नघ्नाय देवाय ज्योतिषां पतये नमः ।।20।। तप्तचामीकराभाय हरये विश्वकर्मणे। नमस्तमोऽभिनिघ्नाय रुचये लोकसाक्षिणे । ।21 ।। नाशयत्येष वै भूतं तमेव सृजति प्रभुः । पायत्येष तपत्येष वर्षत्येष गभस्तिभिः । |22 ।। एष सुप्तेषु जागर्ति भूतेषु परिनिष्ठितः । एष चैवाग्निहोत्रं च फलं चैवाग्निहोत्रिणाम्।।23 ।। देवाश्च क्रतवश्चैव क्रतूनां फलमेव च। यानि कृत्यानि लोकेषु सर्वेषु परमप्रभुः ।।24 ।। एनमापत्सु कृच्छ्रेषु कान्तारेषु भयेषु च। कीर्तयन् पुरुषः कश्चिन्नावसीदति राघव ।। 25 || पूजयस्वैनमेकाग्रो देवदेवं जगत्पतिम् । एतत्त्रिगुणितं जप्त्वा युद्धेषु विजयिष्यसि । । 26 || अस्मिन्क्षणे महाबाहो ! रावणं त्वं जहिष्यसि । एवमुक्त्वा ततोऽगस्त्यो जगाम स यथागतम् ।।27 ।। एतच्छ्रुत्वा महातेजा नष्टशोकोऽभवत्तदा । धारयामास सुप्रीतो राघवः प्रयतात्मवान् । ।28 || आदित्यं प्रेक्ष्य जप्त्वेदं परं हर्षमवाप्तवान् । त्रिराचम्य शुचिर्भूत्वा धनुरादाय वीर्यवान् । ।29 ।। रावणं प्रेक्ष्य हृष्टात्मा जयार्थं समुपागतम् । सर्वयत्नेन महता वृतस्तस्य वधेऽभवत् । ।30 ।। अथ रविरवदन्निरीक्ष्य रामं मुदितमनाः परमं प्रहृष्यमाणः । निशिचरपतिसंक्षयं विदित्वा सुरगणमध्यगतो वचस्त्वरेति । ।31 ।। "
},
"श्री सूक्त " :{
    "title" : "shree shukh ",
    "image" : "https://i.pinimg.com/736x/df/15/b9/df15b9e67031c0dc043c4387cf3d3c08.jpg",
"story" : "ॐ हिरण्यवर्णां हरिणीं सुवर्णरजतस्रजाम् । चन्द्रां हिरण्मयीं लक्ष्मीं जातवेदो म आ वह । तां म आ वह जातवेदो लक्ष्मीमनपगामिनीम्  यस्यां हिरण्यं विन्देयं गामश्वं पुरुषानहम् ।  अश्वपूर्वां रथमध्यां हस्तिनादप्रमोदिनीम् । श्रियं देवीमुप ह्वये श्रीर्मा देवी जुषताम् । कां सोस्मितां हिरण्यप्राकारामार्दा ज्वलन्तीं तृप्तां तर्पयन्तीम् पद्मस्थितां पद्मवर्णां तामिहोप द्वये श्रियम् ।  चन्द्रां प्रभासां यशसा ज्वलन्तीं श्रियं लोके देवजुष्टामुदाराम्   तां पद्मिनीमीं शरणं प्रपद्ये अलक्ष्मीर्मे नश्यतां त्वा वृणे । आदित्यवर्णे तपसोऽधि जातो वनस्पतिस्तव वृक्षोऽथ बिल्वः  तस्य फलानि तपसा नुदन्तु या अन्तरा याश्च बाह्या अलक्ष्मीः । उपैतु मां देवसखः कीर्तिश्च मणिना सह प्रादुर्भूतोऽस्मि राष्ट्रेऽस्मिन् कीर्तिमृद्धिं ददातु मे । क्षुत्पिपासामलां ज्येष्ठामलक्ष्मीं नाशयाम्यहम्  अभूतिमसमृद्धिं च सर्वा निर्णद मे गृहात् । गंधद्वारां दुराधर्षां नित्यपुष्टां करीषिणीम् । ईश्वरीं सर्वभूतानां तामिहोप ह्वये श्रियम । मनसः काममाकृतिं वाचःसत्यमशीमहि  पशूनां रूपमन्नस्य मयि श्रीः श्रयतां यशः । कर्दमेन प्रजा भूता मयि सम्भव कर्दम । श्रियं वासय मे कुले मातरं पद्ममालिनीम् । आपः सृजंतु स्निग्धानि चिक्लीत वस मे गृहे नि च देवीं मातरं श्रियं वासय मे कुले । आर्द्रा पुष्करिणीं पुष्टिं पिंगलां पद्ममालिनीम् । चन्द्रां हिरण्मयीं लक्ष्मीं जातवेदो म आ वह। आर्द्रा यः करिणीं यष्टिं सुवर्णां हेममालिनीम्  सूर्या हिरण्मयीं लक्ष्मीं जातवेदो म आ वह । "
},
"श्री लक्ष्मी " : {
"title" : "श्री लक्ष्मी",
"image" : "https://img.freepik.com/premium-photo/goddess-lakshmi-greetings-card-design-light-festival-called-diwal-generative-ai_708829-2943.jpg",
"story" : "पद्मानने पद्मविपद्मपत्रे पद्मप्रिये पद्मदलायताक्षि । विश्वप्रिये विष्णुमनोऽनुकूले त्वत्पादपद्म मयि सं नि धत्स्व । ।। ।। पद्मानने पद्मऊरु पद्माक्षी पद्मसम्भवे। तन्मे भजसि पद्माक्षि येन सौख्यं लभाम्यहम् । ।2 ।। अश्वदायि गोदायि धनदायि महाधने। धनं मे जुषतां देवि सर्वकामांश्च देहि मे।।3।। पुत्रपौत्रधनं धान्यं हस्त्यश्वाश्वतरी रथम् । प्रजानां भवसि माता आयुष्मन्तं करोतु मे ।।4।। धनमग्निर्धनं वायुर्धनं सूर्यो धनं वसुः । धनमिन्द्रो बृहस्पतिर्वरुणो धनमश्विना ।।5।। वैनतेय सोमं पिब सोमं पिबतु वृत्रहा। सोमं धनस्य सोमिनो मह्यं ददातु सोमिनः । 16 || न क्रोधो न च मात्सर्यं न लोभो नाशुभा मतिः । भवन्ति कृतपुण्यानां भक्त्या श्रीसूक्तजापिनाम् । ।7 ।। सरसिजनिलये सरोजहस्ते धवलतरांशुकगन्धमाल्यशोभे । भगवति हरिवल्लभे मनोज्ञे त्रिभुवनभूतिकरि प्रसीद मह्यम् ।।8।। विष्णुपत्नीं क्षमां देवीं माधवीं माधवप्रियाम् । लक्ष्मीं प्रियसखीं भूमिं नमाम्यच्युतवल्लभाम् । ।9 ।। महालक्ष्म्यै च विद्महे विष्णुपत्न्यै च धीमहि। तन्नो लक्ष्मीः प्र चोदयात् ।।10।। आनन्दः कर्दमः श्रीदश्चिक्लीत इति विश्रुताः। ऋषयः श्रियः पुत्राश्च श्रीर्देवीर्देवता मताः ।। ऋणरोगादिदारिद्र्यपापक्षुदपमृत्यवः । भयशोकमनस्तापा नश्यन्तु मम सर्वदा ।। चन्द्रप्रभां लक्ष्मीमेशानीं सूर्या भांलक्ष्मीमैश्वरीम् । चन्द्र सूर्याग्निसंकाशां श्रियं देवीमुपास्महे ।।11।। श्रीवर्चस्वमायुष्यमारोग्यमाविधाच्छोभमानं महीयते। धनं धान्यं पशुं बहुपुत्रलाभं शतसंवत्सरं दीर्घमायुः । ।12।। "
},
"दुर्गा स्तुति" : {
    "title" : "दुर्गा स्तुति",
    "image" : "https://images.nightcafe.studio/jobs/W116dNIlNWs2LZh7OmEJ/W116dNIlNWs2LZh7OmEJ--1--jgijl.jpg?tr=w-1600,c-at_max",
    "story" : "या देवी सर्वभूतेषु बुद्धिरूपेण संस्थिता ।  नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु शक्तिरूपेण संस्थिता। नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु लज्जारूपेण संस्थिता ।  नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु शांतिरूपेण संस्थिता । नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु श्रद्धारूपेण संस्थिता ।  नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु लक्ष्मीरूपेण संस्थिता । नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु वृत्तिरूपेण संस्थिता ।  नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु स्मृतिरूपेण संस्थिता। नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु दयारूपेण संस्थिता ।  नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। या देवी सर्वभूतेषु तुष्टिरूपेण संस्थिता । नमस्तस्यै नमस्तस्यै नमस्तस्यै नमो नमः ।। "
},
"विष्णु स्तुति" : {
    "title" : "विष्णु स्तुति",
    "image" : "https://t3.ftcdn.net/jpg/06/15/88/68/360_F_615886873_DDDMJPlJFx2ml6OOTRBoGMCy3NpGueZp.jpg",
    "story" : "शान्ताकारं भुजगशयनं पद्मनाभं सुरेशं, विश्वाधारं गगनसदृशं मेघवर्ण शुभांगम्। लक्ष्मीकान्तं कमलनयनं योगिभिर्ध्यानगम्यं, वन्दे विष्णु भवभयहरं सर्वलोकैकनाथम् ।। "
},
"दुर्गा वन्दना" : {
    "title" : "दुर्गा वन्दना",
    "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTrvaGqLzL5F0GgDonSL7ZopkZpMzKdCvluTQ&s",
    "story" : "सर्वमंगलमंड, ल्ये शिवे सर्वार्थ साधिके ।  शरण्ये त्र्यम्बके गौरी नारायणी नमोस्तु ते ।। शरणागतदीनार्तपरित्राण परायणे। सर्वस्यार्तिहरे देवि नारायण नमोस्तु ते।। ॐ सर्वस्वरूपे सर्वेश सर्वेशे सर्वशक्तिसमन्विते ।  भयेभ्यस्त्राहि नो देवि दुर्गे देवि नमोऽस्तु ते।। या श्रीः स्वयं सुकृतिनां भवनेष्व लक्ष्मीः । पापात्मनां कृतधियां हृदयेषु बुद्धिः ।। श्रद्धा सतां कुलजनप्रभवस्य लज्जा ।  तां त्वां नताः स्म परिपालय देवि विश्वम् ।। दुर्गे स्मृता हरसि भीतिमशेषजन्तोः । स्वस्थैः स्मृता मतिमतीव शुभां ददासि ।। दारिद्र्यदुःखभयहारिणि का त्वदन्या।  सर्वोपकारकरणाय सदाऽऽर्द्रचित्ता ।। देवि प्रपन्नार्तिहरे प्रसीद। प्रसीद मातर्जऽगतोखिलस्य ।। प्रसीद विश्वेश्वरि पाहि विश्वं ।  त्वमीश्वरी देवि चराचरस्य ।। जयन्ती मङ्गला काली भद्रकाली कपालिनी। दुर्गा क्षमा शिवा धात्री स्वाहा स्वधा नमोऽस्तु ते।। देहि सौभाग्यमारोग्यं देहि मे परंमं सुखम्।  रूपं देहि जयं देहि यशो देहि द्विषो जहि ।। सर्वस्य बुद्धिरूपेण जनस्य हृदि संस्थिते। स्वर्गापवर्गदे देवि नारायणि नमोस्तु ते ।। "
},
"श्री गणेश वन्दना" : {
    "title" : "श्री गणेश वन्दना",
    "image" : "https://t3.ftcdn.net/jpg/05/66/14/24/360_F_566142422_dPs9D1ML7Z9oeJQIgHSV8MdofZBYVb2L.jpg",
    "story" : "वर्णनामर्थसंघानाम् रसानाम् छन्दसामपि। मंगलानाम् च कर्तारौ वन्दे वाणीविनायकौ।। गजाननं भूतगणादिसेवितं कपित्थजम्बू फल चारु भक्षणम् । उमासुतं शोकविनाशकारकं नमामि विघ्नेश्वर पादपंकजम् ।। "
},
"हनुमत्-वन्दना" : {
    "title" : "हनुमत्-वन्दना",
    "image" : "https://hindi.cdn.zeenews.com/hindi/sites/default/files/2023/05/02/1770577-hanuman-1.jpg",
"story" : "अतुलितबलधामं हेमशैलाभदेहं दनुजवनकृशानुं ज्ञानिनामग्रगण्यम् । सकलगुणनिधानं वानराणामधीशं रघुपतिप्रियभक्तं वातजातं नमामि ।। "       
},
"रुद्राष्टक": {
    "title": "रुद्राष्टक",
    "image" : "https://i.pinimg.com/736x/1d/49/40/1d494083d4eaac0a578ce521af1277b9.jpg",
    "story": "नमामि शमीशान निर्वाण रूपं । विभु व्यापकं ब्रह्म वेदस्वरूपं ।। निजं निर्गुणं निर्विकल्पं निरीहं । चिदाकाशमाकाशवासं भजेऽहं ।। निराकारमोंकारमूलं तुरीयं । गिरा ग्यान गोतीतमीशं गिरीशं ।। करालं महाकाल कालं कृपालं । गुणागार संसारपारं नतोऽहं ।। तुषाराद्रि संकाश गौरं गभीरं। मनोभूत कोटि प्रभा श्री शरीरं ।। स्फुरन्मौलि कल्लोलिनी चारु गंगा। लसद्भालबालेन्दु कंठे भुजंगा ।। चलत्कुंडलं भ्रू सुनेत्रं विशालं । प्रसन्नानं नीलकंठं दयालं ।। मृगाधीशमर्चाम्बरं मुण्डमालं । प्रियं शंकरं सर्वनाथं भजामि ।। प्रचंडं प्रकृष्ठं प्रगल्भं परेशं । अखंडं अजं भानुकोटि प्रकाशं ।। त्रयःशूल निर्मूलनं शूलपाणिं। भजेऽहं भवानीपतिं भावगम्यं ।। कलातीत कल्याण कल्पान्तकारी। सदा सज्जनानन्दाता पुरारी ।। चिदानंद संदोह मोहापहारी। प्रसीद प्रसीद प्रभां मन्मथारी ।। न यावद् उमानाथ पादारविन्दं । भजंतीह लोके परे वा नराणां ।। न तावत्सुखं शांन्ति संतापनाशं । प्रसीद प्रभो सर्वभूताधिवासं ।। न जानामि योगं जपं नैव पूजां । नतोऽहंसदा सर्वदा शंभु तुभ्यं ।। जरा जन्म दुःखौघ तातप्यमानं । प्रभो पाहि आपन्नमामीश शंभो ।।रुद्राष्टकमिदं प्रोक्तंविप्रेण हरतोषये ।ये पठन्ति नरा भक्त्या तेषां शम्भुः प्रसीदति ।।"
},
"संकटमोचन हनुमानाष्टक": {
    "title": "संकटमोचन हनुमानाष्टक",
    "image" : "https://i.pinimg.com/736x/6d/8f/59/6d8f59440f08d330cd3e1606bd90286d.jpg",
    "story": "बाल समय रबि भक्षि लियो तब, तीनहुँ लोक भयो अंधियारो। ताहि सों त्रास भयो जग को, यह संकट काहु सों जात न टारो देवन आनि करी बिनती तब, छांड़ि दियो रवि कष्ट निवारो  को नहिं जानत है जग में कपि, संकटमोचन नाम तिहारो। को- बालि की त्रास कपीस बसै गिरि, जात महाप्रभु पंथ निहारो चौंकि महा मुनि साप दियो तब, चाहिय कौन बिचार बिचारो। कै द्विज रूप लिवाय महाप्रभु, सो तुम दास के सोक निवारो। को- अंगद के संग लेन गए सिय, खोज कपीस यह बैन उचारो। जीवित ना बचिहौं हम सों जु, बिना सुधि लाय इहाँ पगु धारो  हेरि थके तट सिंधु सबै तब, लाय सिया सुधि प्रान उबारो। को- रावन त्रास दई सिय को सब, राक्षसि सों कहि सोक निवारो  ताहि समय हनुमान महाप्रभु, जाय महा रजनीचर मारो। चाहत सीय असोक सों आगि सु, दै प्रभु मुद्रिका सोक निवारो। को- बान लग्यो उर लछिमन के तब, प्रान तजे सुत रावन मारो  लै गृह वैद्य सुषेन समेत, तबै गिरि द्रोन सु बीर उपारो। आनि संजीवन हाथ दई तब, लछिमन के तुम प्रान उबारो। को- रावन जुद्ध अजान कियो तब, नाग कि फांस सबै सिर डारो  श्री रघुनाथ समेत सबै दल, मोह भयो यह संकट भारो। आनि खगेस तबै हनुमान जु, बंधन काटि सुत्रास निवारो। को- बंधु समेत जबै अहिरावन, लै रघुनाथ पाताल सिधारो  देविहिं पूजि भली विधि सों बलि, देउ सबै मिलि मंत्र बिचारो  जाय सहाय भयो तब ही, अहिरावन सैन्य समेत संहारो। को- काज किए बड़ देवन के तुम, बीर महाप्रभु देखि बिचारो। कौन सो संकट मोर गरीब को, जो तुमसों नहिं जात है टारो। बेगि हरो हनुमान महाप्रभु, जो कछु संकट होय हमारो। को- लाल देह लाली लसे, अरु धरि लाल लंगूर, बज्र देह दानवदलन, जय जय जय कपि सूर "
},
"बजरंग बाण": {
    "title": "बजरंग बाण",
    "image" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSySSazCLsdnzHHSO7tCzGVyVFNz6qXXE7wsA&s",
    "story": "निश्चय प्रेम प्रतीति ते, विनय करें सनमान। तेहि के कारज सकल शुभ, सिद्ध करें हनुमान ।। जय हनुमंत संत हितकारी। सुन लीजै प्रभु अरज हमारी ।।  जन के काज बिलंब न कीजै। आतुर दौरि महा सुख दीजै ।।  जैसे कूदि सिंधु महिपारा। सुरसा बदन पैठि बिस्तारा ।।  आगे जाय लंकिनी रोका। मारेहु लात गई सुरलोका ।।  जाय बिभीषन को सुख दीन्हा। सीता निरखि परमपद लीन्हा ।।  बाग उजारि सिंधु महँ बोरा। अति आतुर जमकातर तोरा ।।  अक्षय कुमार मारि संहारा। लूम लपेटि लंक को जारा।।  लाह समान लंक जरि गई। जय जय धुनि सुरपूर महँ भई ।।  अब विलंब केहि कारन स्वामी । कृपा करहु उर अंतरयामी ।।  जय जय लखन प्रान के दाता । आतुर होईदुख करहु निपाता ।।  जै हनुमान जयति बल-सागर। सुर-समूह-समरथ भट-नागर।  ॐ हनु हनु हनु हनुमंत हठीले । बैरिहि मारु बज्ज की कीले ।।  ॐ ह्रीं ह्रीं ह्रीं हनुमंत कपीसा। ॐ हुं हुं हुं हनु अरि उर सीसा ।।  जय अंजनि कुमार बलवंता। शंकरसुवन बीर हनुमंता ।।  बदन कराल काल-कुल-घालक। राम सहाय सदा प्रतिपालक ।।  भूत, प्रेत, पिसाच निसाचर । अगिन बेताल काल मारी मर।।  इन्हें मारु, तोहि सपथ राम की। राखु नाथ मरजाद नाम की ।।  सत्य होहु हरि सपथ पाइ कै। राम दूत धरु मारु धाइ कै ।।  जय जय जय हनुमंत अगाधा। दुख पावत जन केहि अपराधा ।।  पूजा जप तप नेम अचारा। नहिं जानत कछु दास तुम्हारा ।। बन उपबन मग गिरि गृह माहीं। तुम्हरें बल हौं डरपत नाहीं ।।  जनकसुता हरि दास कहावौ। ताकी सपथ बिलंब न लावौ ।।  जै जै जै धुनि होत अकासा। सुमिरत होय दुसह दुख नासा ।।  चरन पकरि, कर जोरि मनावों। यहि औसर अब केहि गोहरावौं ।।  उठु, उठु, चलु, तोहि राम दुहाई। पायँ परौं, कर जोरि मनाई।।  ऊँचंचं चंचं चपल चलंता। ऊँ हनु हनु हनु हनु हनुमंता ।।  ॐ हं हं हाँक देत कपि चंचल। ऊँ संसं सहमि पराने खल-दल ।। अपने जन को तुरत उबारौ। सुमिरत होय आनंद हमारौ।। यह बजरंग बाण जेहि मारै। ताहि कहौ फिरि कवन उबारै ।।  पाठ करै बजरंग बाण की। हनुमत रक्षा करै प्रान की।।  यह बजरंग बाण जो जापैं। तासों भूत-प्रेत सब कापैं।।  धूप देय जो जपै हमेसा । ताके तन नहिं रहै कलेसा।। उर प्रतीति दृढ़, सरन ह्वै, पाठ करै धरि ध्यान। बाधा सब हर, करें सब काम सफल हनुमान ।। "
},
};

const Path = () => {
    const [selectedItem, setSelectedItem] = useState(Object.keys(data)[0]);

    // Handle dropdown change
    const handleChange = (itemValue) => {
        setSelectedItem(itemValue);
    };

    // Get selected data
    const selectedData = data[selectedItem];

    const storyLines = selectedData.story.split('।।').map(line => line.trim());

    // Function to handle speech
    const speakText = () => {
        Speech.speak(selectedData.story, {
            language: 'hi', // Set language to Hindi
            pitch: 1,
            rate: 1,
        });
    };

    return (
        <>
        <View style={styles.container}>
            <Picker
                selectedValue={selectedItem}
                onValueChange={handleChange}
                style={styles.picker}
            >
                {Object.keys(data).map((key) => (
                    <Picker.Item key={key} label={key} value={key} />
                ))}
            </Picker>
        <ScrollView style={styles.scrollView}>
                <Image source={{ uri: selectedData.image }} style={styles.image} />
                <Text style={styles.subtitle}>{selectedData.title}</Text>
                <TouchableOpacity onPress={speakText} >
                {storyLines.map((line, index) => (
                <Text key={index} style={styles.storyText}>{line}</Text>
                ))}
                </TouchableOpacity>
              </ScrollView>
                </View>
            <CustomBottomNavbar />
            </>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        padding: 16,
        backgroundColor: 'white',
        paddingBottom: 60,
    },
    scrollView: {
        flex: 1,
    },
    picker: {
        height: 50,
        width: '100%',
        marginBottom: 16,
    },
    contentContainer: {
        padding: 16,
        backgroundColor: '#f0f0f0',
        borderRadius: 8,
        borderWidth: 1,
        borderColor: '#ddd',
        flexGrow: 1,
    },
    image: {
        width: '100%',
        height: 300,
        borderRadius: 8,
        marginBottom: 10,
    },
    subtitle: {
        fontSize: 20,
        fontWeight: '600',
        textAlign: 'center',
        marginBottom: 10,
    },
    storyText: {
        marginTop: 10,
        fontSize: 16,
        color: '#333',
        marginBottom: 10,
    },
    button: {
        backgroundColor: '#4CAF50',
        padding: 10,
        borderRadius: 5,
        alignItems: 'center',
    },
    buttonText: {
        color: 'white',
        fontSize: 16,
    },
});

export default Path;
