import React, { useState } from 'react';
import { View, Text, TouchableOpacity, StyleSheet } from 'react-native';
import { Picker } from '@react-native-picker/picker'; // Updated import
import * as Speech from 'expo-speech'; // Importing expo-speech
import CustomBottomNavbar from '@/components/BottomNavbar';

// Sample JSON data
const data = {
    "श्री यंत्र": {
        "title": "श्री यंत्र",
        "mantra" : "षोडशाक्षरी मंत्र : ह्रीं क ए ई ल हीं ह स क ह ल ह्रीं स क ल हीं महाषोडशी मंत्र : श्रीं ह्रीं क्लीं ऐं सौः ॐ ह्रीं क ए ई ल ह्रीं ह स क ह ल ह्रीं स क ल ह्रीं सौः ऐं क्लीं ह्रीं श्र",
        
        "story": "यंत्रों कां राजा। धन, यश की स्थायी प्राप्ति व सर्व मंगल हेतु।"
    },
    "महालक्ष्मी यंत्र": {
        "title": "महालक्ष्मी यंत्र",
        "mantra" : "श्रीं ह्रीं क्लीं कमले कमलालये प्रसीद प्रसीद श्रीं ह्रीं श्रीं महा लक्ष्म्यै नमः । 2. ऊं श्री महालक्ष्म्यै स्वाहा। 3. ॐ ह्रीं श्रीं क्लीं महालक्ष्म्यै नमः ॥",
        
        "story": "धन वृद्धि, सिद्धि प्राप्ति व वैभव लक्ष्मी के पूजन हेतु"
    },
    "कमला यंत्र": {
        "title": "कमला यंत्र",
        "mantra" : "मंत्र: ॐ ऐं ह्रीं श्रीं क्लीं ह्सौः जगत्प्रसूत्यै नमः।",
        
        "story": "संपत्ति प्राप्ति"
    },
    "कनकधारा यंत्र": {
        "title": "कनकधारा यंत्र",
        "mantra" : "मंत्र: ॐ वं श्रीं वं ऐं ह्रीं श्रीं क्लीं कनकधारायै नमः।",
        
        "story": "स्वर्ण व संपत्ति प्राप्ति के लिए"
    },
    "गायत्री यंत्र": {
        "title": "गायत्री यंत्र",
        "mantra" : "मंत्र : ॐ भूर्भुवः स्वः तत्सवितुर्वरेण्यम् भर्गो देवस्य धीमहि धियो यो नः प्रचोदयात्",
        
        "story": "ऊर्जा प्राप्ति"
    },
    "दुर्गा बीसा यंत्र": {
        "title": "दुर्गा बीसा",
        "mantra" : "मंत्र : ॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चै ।",
        
        "story": "दुर्गति नाश के लिए"
    },
    "नव दुर्गा यंत्र": {
        "title": "नव दुर्गा यंत्र",
        "mantra" : "मंत्र : ॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चै।",
        
        "story": "शक्ति, विजय व सफलता प्राप्ति के लिए"
    },
    "सरस्वती  यंत्र ": {
        "title": "सरस्वती  यंत्र",
        "mantra" : "मंत्र : ॐ ऐं महासरस्वत्यै नमः ।",
        
        "story": "विद्या, बुद्धि व सृजनात्मक शक्ति के लिए"
    },
    "काली यंत्र": {
        "title": "काली यंत्र",
        "mantra" : "मंत्र: ॐ क्रीं कालिकायै नमः ।",
        
        "story": "विजय प्राप्ति"
    },
    "तारा यंत्र": {
        "title": "तारा यंत्र",
        "mantra" : "मंत्र: ॐ ह्रीं स्रीं हुं फट्।",
        
        "story": "वाकपटुता, संपत्ति के लिए"
    },
    "भुवनेश्वरी यंत्र": {
        "title": "भुवनेश्वरी यंत्र",
        "mantra" : "मंत्र : ह्रीं",
        
        "story": "शक्ति प्राप्ति"
    },
    "छिन्नमस्ता यंत्र": {
        "title": "छिन्नमस्ता यंत्र",
        "mantra" : "मंत्र : ॐ श्रीं ह्रीं क्लीं ऐं वज्र वै रो चनी मे हुं हुं फट् स्वाहा।",
        
        "story": "शत्रु नाश, दुर्गति नाश व विद्या के लिए निराशा, दुःख, दुर्घटना, रोग नाश के लिए वैवाहिक जीवन व संगीत के क्षेत्र में सफलता के लिए भविष्य कथन की योग्यता के लिए वाहन दुर्घटना से सुरक्षा प्राप्ति के लिए"
    },
    "बगलामुखी यंत्र": {
        "title": "बगलामुखी यंत्र",
        "mantra" : "मंत्र : ॐ ह्रीं बगलामुखि सर्वदुष्टानां वाचं मुखं पदं स्तम्भय। जिव्हाम् कीलय कीलय बुद्धिं विनाशय ह्रीं ॐ स्वाहा ॥",
        
        "story": "शत्रु नाश व मुकदमे में विजय के लिए"
    },
    "त्रिपुर भैरवी यंत्र": {
        "title": "त्रिपुर भैरवी यंत्र",
        "mantra" : "मंत्र : हसै हसकरी हसै।",
        
        "story": "आत्म संयम व विजय के लिए"
    },
    "धूमावती यंत्र": {
        "title": "धूमावती यंत्र",
        "mantra" : "मंत्र : धू धू धूमावती ठः ठः।",
        
        "story": "निराशा, दुःख, दुर्घटना, रोग नाश के लिए "
    },
    "मातंगी यंत्र": {
        "title": "मातंगी यंत्र",
        "mantra" : "मंत्र : ॐ ह्रीं क्लीं हूं मातंग्यै फट् स्वाहा",
        
        "story": "वैवाहिक जीवन व संगीत के क्षेत्र में सफलता के लिए "
    },
    "गीता यंत्र ": {
        "title": "गीता यंत्र यंत्र",
        "mantra" : "मंत्र : ॐ नमो भगवते वासुदेवाय ।",
        
        "story": "यश प्राप्ति के लिए"
    },
    "पंचांगुली यंत्र यंत्र": {
        "title": "पंचांगुली यंत्र यंत्र",
        "mantra" : "ध्यान : ॐ पंचांगुली महादेवी श्री सीमधर शासने। अधिष्ठात्र करस्यासौ शक्ति श्री त्रिदशेशितुः॥  मंत्र : ॐ नमो पंचांगुलीं पंचांगुली परशरी परशरी मातामयंगल वशीकरणी लोहमयदंडमणिनि चौंसठ काम विहंडनी रणमध्ये राउलमध्ये शत्रुमध्ये दीवानमध्ये भूतमध्ये प्रेतमध्ये पिशाचमध्ये झोंटिगमध्ये डाकिनीमध्ये शंखिनी मध्ये यक्षिणीमध्ये दोषेणीमध्ये शेकनीमध्ये गुणीमध्ये गारुड़ीमध्ये विनारीमध्ये दोषमध्ये दोषाशरणमध्ये दुष्टमध्ये घोर कष्ट मुझ उपरे बुरो जो कोई करावे जड़े जड़ावे तत् चिन्ते चिन्तावे तस माथे श्री माता श्री पंचांगुली देवी तणो वज्र निर्धर पड़े ॐ ठं ठं ठं स्वाहा।।",
        
        "story": "भविष्य कथन की योग्यता के लिए "
    },
    "गणेश यंत्र ": {
        "title": "गणेश यंत्र ",
        "mantra" : "मंत्र : ॐ गं गणपतये नमः ।",
        
        "story": "सुख-समृद्धि के लिए"
    },
    "स्वस्तिक गणेश यंत्र": {
        "title": "स्वस्तिक गणेश यंत्र",
        "mantra" : "मंत्र : ॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वर वरद सर्वजन मे वशमानय ठः ठः।",
        
        "story": "भाग्योन्नति के लिए"
    },
    "हनुमान यंत्र": {
        "title": "हनुमान यंत्र",
        "mantra" : "मंत्र : ॐ हनुमते नमः।",
        
        "story": "शक्ति प्राप्ति के लिए"
    },
    "वाहन दुर्घटना नाशक यंत्र": {
        "title": "वाहन दुर्घटना नाशक यंत्र",
        "mantra" : "मंत्र: ॐ नमो भगवते आंजनयाय महाबलाय स्वाहा ।",
        
        "story": "वाहन दुर्घटना से सुरक्षा प्राप्ति के लिए"
    },
    "आकर्षण यंत्र": {
        "title": "आकर्षण यंत्र",
        "mantra" : "मंत्र : आकर्षय महादेवि र मम् प्रियम् हे त्रिपुरे देवदेवेशि तुभ्यम् दश्यामि याचितम् ।",
        
        "story": "वशीकरण के लिए"
    },
    "वशीकरण यंत्र": {
        "title": "वशीकरण यंत्र",
        "mantra" : "मंत्र: वशीकरणाय स्वाहा।",
        
        "story": "व्यक्ति विशेष के आकर्षण के लिए"
    },
    "प्रेम वृद्धि यंत्र": {
        "title": "प्रेम वृद्धि यंत्र",
        "mantra" : "मंत्र : क्लीं कामदेवाय नमः।",
        
        "story": "पति पत्नी के बीच प्रेम वृद्धि के लिए"
    },
    "सुख समृद्धि यंत्र": {
        "title": "सुख समृद्धि यंत्र",
        "mantra" : "मंत्र: ॐ मंगलमूर्तये नमः।",
        
        "story": "पारिवारिक सुख शांति के लिए"
    },
    "संतान गोपाल यंत्र": {
        "title": "संतान गोपाल यंत्र",
        "mantra" : "मंत्र : ॐ क्लीं श्रीं ह्रीं जीं ओं भूर्भुवः स्वः ॐ देवकीसुतगोविंद वासुदेवजगत्पते देहि मे तनयं कृष्ण त्वामहं शरणं गतः ॐ ॐ स्वः भुवः भूः जीं ह्रीं श्रीं त्वीं ओं।",
        
        "story": "संतान प्राप्ति के लिए"
    },
    "व्यापार वृद्धि यंत्र": {
        "title": "व्यापार वृद्धि यंत्र",
        "mantra" : "मंत्र: ॐ गं गणपतये नमः।",
        
        "story": "व्यापार की सफलता के लिए"
    },
    "कुबेर यंत्र": {
        "title": "कुबेर यंत्र",
        "mantra" : "मंत्र: ॐ कुबेराय नमः।",
        
        "story": "धन प्राप्ति के लिए"
    },
    "महामृत्युंजय यंत्र": {
        "title": "महामृत्युंजय यंत्र",
        "mantra" : "मंत्र : ॐ त्र्यम्बकम् यजामहे सुगन्धिम्पुष्टिवर्धनम् उर्वारुकमिवबन्धनान् मृत्योर्मुक्षीयमाऽमृतात्",
        
        "story": "रोग नाश व प्राणघातक समय की निष्क्रियता के लिए"
    },
    "महासुदर्शन यंत्र": {
        "title": "महासुदर्शन यंत्र",
        "mantra" : "मंत्र : श्री कृष्ण गोविन्द हरे मुरारी हे नाथ नारायण वासुदेवा।",
        
        "story": "शत्रु से सुरक्षा के लिए"
    },
    "राम रक्षा यंत्र": {
        "title": "राम रक्षा यंत्र",
        "mantra" : "मंत्र: ॐ श्री राम जय राम जय जय राम।",
        
        "story": "शत्रु शमन के लिए"
    },
    "कालसर्प यंत्र": {
        "title": "कालसर्प यंत्र",
        "mantra" : "मंत्र: ॐ क्लीं मत्स्यरूपाय।",
        
        "story": "कालसर्प योग की शांति हेतु"
    },
    "मत्स्य यंत्र": {
        "title": "मत्स्य यंत्र",
        "mantra" : "मंत्र: ॐ क्लीं मत्स्यरूपाय।",
        
        "story": "वास्तु व समस्या निवारण के लिए"
    },
    "वास्तु दोष निवारण यंत्र": {
        "title": "वास्तु दोष निवारण यंत्र",
        "mantra" : "मंत्र: ॐ वास्तुपुरुषाय नमः।",
        
        "story": "वास्तु दोष के निराकरण के लिए"
    },
    "दशमहाविद्या यंत्र": {
        "title": "दशमहाविद्या यंत्र",
        "mantra" : "मंत्र : ॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चै ।",
        
        "story": "आध्यात्मिक ज्ञान, सुख संपत्ति व संपूर्ण आनंद के लिए"
    },
    "सूर्य यंत्र": {
        "title": "सूर्य यंत्र",
        "mantra" : "ॐ ह्रां ह्रीं ह्रौं सः सूर्याय नमः",
        
        "story": "उत्तम स्वास्थ्य हेतु"
    },
    "चंद्र यंत्र": {
        "title": "चंद्र यंत्र",
        "mantra" : "ॐ श्रां श्रीं श्रौं सः चंद्रमसे नमः",
        
        "story": "ज्ञान वृद्धि हेतु "
    },
    "मंगल यंत्र": {
        "title": "मंगल यंत्र",
        "mantra" : "ॐ क्रां क्रीं क्रौं सः भौमाय नमः",
        
        "story": "शीघ्र सफलता हेतु "
    },
    "बुध यंत्र": {
        "title": "बुध यंत्र",
        "mantra" : "ऊँ ब्रां ब्रीं ब्रौं सः बुधाय नमः",
        
        "story": "वाकपटुता, ज्ञान वृद्धि हेतु "
    },
    "गुरु यंत्र": {
        "title": "गुरु यंत्र",
        "mantra" : "ऊँ ग्रां ग्रीं ग्रौं सः गुरुवै नमः",
        
        "story": " सुख सम्मान के लिए "
    },
    "शुक्र यंत्र": {
        "title": "शुक्र यंत्र",
        "mantra" : "ऊँ द्रां द्रीं द्रौं सः शुक्राय नमः",
        
        "story": "वैवाहिक जीवन हेतु "
    },

    "शनि यंत्र": {
        "title": "शनि यंत्र",
        "mantra" : "ॐ प्रां प्रीं प्रौं सः शनैश्चराय नमः",
        
        "story": "आकस्मिक हानियों को रोकने के लिए"
    },
    "राहु यंत्र": {
        "title": "राहु यंत्र",
        "mantra" : "ऊँ भ्रां भ्रीं भ्रौं सः राहुवे नमः",
        
        "story": "विदेश में सफलता प्राप्ति के लिए"
    },
    "केतु यंत्र": {
        "title": "केतु यंत्र",
        "mantra" : "ऊँ स्रां सीं सौं सः केतवे नमः",
        
        "story": "सफलता प्राप्ति, जादू-टोना दूर करने के लिए  "
    },
    "संपूर्ण व्यापार वृद्धि यंत्र": {
        "title": "संपूर्ण व्यापार वृद्धि यंत्र",
        "mantra" : "मंत्र: ॐ गं गणपतये नमः।",
        
        "story": "व्यापार में सिथरता व सफलता के लिए "
    },
    "संपूर्ण विद्या दायक यंत्र": {
        "title": "संपूर्ण विद्या दायक यंत्र",
        "mantra" : "मंत्र : ॐ ऐं महासरस्वत्यै नमः।",
        
        "story": "विद्या, ज्ञान प्राप्ति के लिए "
    },
    "संपूर्ण बाधा मुक्ति यंत्र": {
        "title": "संपूर्ण बाधा मुक्ति यंत्र",
        "mantra" : "मंत्र : सर्वाबाधाविनिर्मुक्तो धनधान्यसुतान्वितः मनुष्यो मत्प्रसादेन भविष्यति न संशयः।",
        
        "story": "समस्या निराकरण के लिए"
    },
    "संपूर्ण रोग नाशक यंत्र": {
        "title": "संपूर्ण रोग नाशक यंत्र",
        "mantra" : "मंत्र : ॐ त्र्यंबकम् यजामहे सुगन्धिं पुष्टि वर्धनम्। ऊर्वारुकमिव बन्धनान् मृत्योर्मुक्षीय माऽमृतात्",
        
        "story": "उत्तम स्वास्थ्य व रोग शांति के लिए"
    },
    "संपूर्ण कालसर्प यंत्र": {
        "title": "संपूर्ण कालसर्प यंत्र",
        "mantra" : "मंत्र : ॐ नमोऽस्तु सर्पेभ्यो ये के च पृथिवीमनु । येऽअंतरिक्षे ये दिवि तेभ्यः सर्पेभ्यो नमः ।।",
        
        "story": "जीवन क्षेत्र में आने वाली बाधाओं के निवारण हेतु "
    },
    "संपूर्ण वास्तु दोष निवारण यंत्र  ": {
        "title": "संपूर्ण वास्तु दोष निवारण यंत्र  ",
        "mantra" : "मंत्र : वास्तुदेव नमस्तेस्तु भूशय्यानिरत प्रभो। मद्गृहं धन धान्यादि समृद्धं कुरु सर्वदा ।",
        
        "story": "कार्य स्थल, घर, दुकान के वास्तु दोषों की शांति हेतु "
    },
    "संपूर्ण नवग्रह यंत्र": {
        "title": "संपूर्ण नवग्रह यंत्र",
        "mantra" : "मंत्र : ॐ ब्रह्ममुरारीः त्रिपुरान्तकारी भानुः शशीः भूमिसुतो बुधश्च गुरूश्च शुक्रः सर्वे ग्रहाः शान्तिकरा भवन्तु ॥",
        
        "story": "सभी नौ ग्रहों की शुभता के लिए "
    },
    "संपूर्ण महालक्ष्मी यंत्र": {
        "title": "संपूर्ण महालक्ष्मी यंत्र",
        "mantra" : "मंत्र : ॐ श्रीं ह्रीं श्रीं कमले कमलालये प्रसीद प्रसीद श्रीं ह्रीं श्रीं ॐ महालक्ष्म्यै नमः।",
        
        "story": "धन, वैभव, सुख, शांति के लिए "
    },
    "सर्व कार्य सिद्धि यंत्र": {
        "title": "सर्व कार्य सिद्धि यंत्र",
        "mantra" : "मंत्र : सर्वाबाधाविनिर्मुक्तो धनधान्य सुतान्वितः मनुष्योमत्प्रसादेन् भविष्यति न संशयः।",
        
        "story": "जीवन में लक्ष्य प्राप्ति व चहुंमुखी सफलता के लिए"
    }
};

const Yantra = () => {
    const [selectedItem, setSelectedItem] = useState(Object.keys(data)[0]);

    // Handle dropdown change
    const handleChange = (itemValue) => {
        setSelectedItem(itemValue);
    };

    // Get selected data
    const selectedData = data[selectedItem];

    // Function to handle speech
    const speakText = () => {
        Speech.speak(selectedData.story, {
            language: 'hi', // Set language to Hindi
            pitch: 1,
            rate: 1,
        });
    };

    return (
        <>
            <View style={styles.container}>
                <Picker
                    selectedValue={selectedItem}
                    onValueChange={handleChange}
                    style={styles.picker}
                >
                    {Object.keys(data).map((key) => (
                        <Picker.Item key={key} label={key} value={key} />
                    ))}
                </Picker>

                <TouchableOpacity style={styles.contentContainer} onPress={speakText}>
                    <Text style={styles.subtitle}>{selectedData.title}</Text>
                    <Text style={styles.storyText}>{selectedData.story}</Text>
                </TouchableOpacity>
            </View>
            <CustomBottomNavbar />
        </>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        padding: 16,
        backgroundColor: 'white',
    },
    title: {
        fontSize: 24,
        fontWeight: 'bold',
        textAlign: 'center',
        marginBottom: 16,
    },
    picker: {
        height: 50,
        width: '100%',
        marginBottom: 16,
    },
    contentContainer: {
        padding: 16,
        backgroundColor: '#f0f0f0',
        borderRadius: 8,
        borderWidth: 1,
        borderColor: '#ddd',
    },
    subtitle: {
        fontSize: 20,
        fontWeight: '600',
        textAlign: 'center',
    },
    storyText: {
        marginTop: 10,
        fontSize: 16,
        color: '#333',
    },
});

export default Yantra;
